import '../../constants/image_strings.dart';
import '../../models/albums.dart';
import '../../models/singer.dart';
import '../../models/song.dart';

class SongHelper {
  static List<Song> getAllSongs() {
    // To be populated later on!
    List<Song> allSongs = [];

    // List of Singers
    List<Singer> allSingers = getMockedSongs();
    for (Singer singer in allSingers) {
      for (Albums album in singer.albums) {
        for (Song song in album.songs) {
          song.singerName = song.singerName;
          allSongs.add(song);
        }
      }
    }
    return allSongs;
  }

  static List<Singer> getMockedSongs() {
    return [
      Singer(name: 'ዘማሪ ሃዋዝ ተገኝ', photo: GSHawaz, singerId: 's-01', albums: [
        Albums(
            name: 'ልሻገረው',
            photo: lshagerew,
            albumNumber: 04,
            realeasedDate: DateTime.now(),
            songs: [
              Song(
                  name: 'መዳፉ',
                  videoURL: 'https://youtu.be/VxZfeQt2u0A?si=9hyzfbSyOClZc-YB',
                  songLyrics: {
                    'lyrics': '''
መዳፉ በአይኖቼ ፍቅሩ በልቤ ነው
ይታየኛል ገፁ ደም እንደሸፈነው 
አሁን ምን ይገርማል ብታመን በፍቅሩ
ከአንደበቴ በላይ ያወራል ችንካሩ (2x)

የፈሰሰው ደሙ ከእሩቅ እየጠራኝ 
 አስነባኝ መከራው የአምላኬ
እንዳላዝን አዝኖ እንዳልደማ ደምቶ 
 እስከሞት ወዶኛል ጌታዬ 
በጥፊ እየመቱት ምራቅ ቢተፉበት 
መች ሰለቸው ይሄ የእኔ አባት 
ከዚህም በላይ ሆኖ ቤዛ ሆኖልኛል
 ጌታዬ እስከሞት ወዶኛል 

ከዘባነኪሩብ መስቀል ያስመረጠው 
  ሌላ ምንም አይደል ፍቅር ነው 
ተከሳሹ ድኜ ዳኛው ተከሰሰ 
 ሊያከብረኝ ውደቀቴን ለበሰ 
ሁሉም ሲጮኽበት ይሰቀል እያለ 
 እንደሚሸለት በግ ዝም አለ 
ሸክሜን ተሸክሞ ቢያቀረቅርልኝ
 ወንበዴው ፀድቄ ቀና አልኩኝ

ያየሩማ ጅራፍ ጀርባህን ያረሰው
ፅድቄን የፃፍክበት ብዕር ነው 
ትሁት አካልህን ደጋግሞ ጠቀሰው 
ደምህ እንደቀለም ቢሆነው
ተዘርግተህላት ነፍሴ አነበበችህ
በሰንበር ተከፍለው ገጾችህ
አማረብኝ ጎንህ ውሃ ደም ሲያነባ
ጠውልገህ የቆላው አበባ

መከራህ ደስታዬ ስቃይህ እረፍቴ
ሞትህ ህይወት ሆነኝ አባቴ 
የፍቅር ንጉስ ነህ የእሾህ ዘውድ የደፋህ
ለእኔ እርቃን መሰቀል ያልከፋህ
ከቁንዳላህ መሀል ደምህ ዘነበልኝ
ለእኔ ያለህን ፍቅር ስትነግረኝ 
ኢየሱስ አንተ ነህ የሕይወት ወደቤ 
አለሜን ያስናከኝ ጥበቤ
'''
                  }),
              Song(
                  name: 'ባለውለታዬ',
                  videoURL: 'https://youtu.be/VxZfeQt2u0A?si=9hyzfbSyOClZc-YB',
                  songLyrics: {
                    'lyrics': '''
ከፍዬ የማልመልሰው
ተናግሬ የማልጨርሰው
አለብኝ ያንተ ውለታ
ላክብርህ ቸር የኔ ጌታ

አይዘነጋውም ቸርነትህን ያስባል ልቤ
የሕይወቴ እልፍኝ የእረፍት ውሃ ሆነህ ወደቤ
አሳዳጊዬ የልጅነቴ ጣፋጭ ትዝታ
እንዴት ልጨክን አልረሳም ከቶ ያንተን ውለታ

እጆቼን ይዘህ የመራኸኝ
ከጥልቁ ባህር ያሳለፍከኝ
ብቸኝነቴን እቅፍህ ነቅሎት
ደጄ ሰላም ነው መንፈስህ መልቶት
ልቤ ሰላም ነው መንፈስህ ነክቶት(x2)

ባለውለታዬ የነፍሴ ጌታ 
ባለውለታዬ የሕይወቴ ጌታ
ከምስጋና በቀር የለኝ ችሎታ
ለፍቅርህ ሚመጥን ለዋልከው ውለታ

አቤቱ አቅም የሌለውን ምንኛ ረዳኸው
አቤቱ ሀይል የሌለውን ምንኛ አገዝከው
ይችላል ክንድህ መደገፍ የደከሙትን
ያወጣል ከሞት መንጋጋ የተጣሉትን

አይኖቼ ወደ ላይ ቀና ይላሉ
ጣቶቼ ላንተ ዜማ ያፈልቃሉ
ሁሉ ካንተ ነው አንድ የለም ከእኔ
ጌታ ያንተ ነው ቀሪው ዘመኔ
ለፍቅር ውለታህ ይኸው ዘመኔ

እጆቼን ይዘህ የመራኸኝ
ከጥልቁ ባህር ያሻገርከኝ
ብቸኝነቴን እቅፍህ ነቅሎት
ደጄ ሰላም ነው መንፈስህ መልቶት
ልቤ ሰላም ነው መንፈስህ ነክቶት(x2)

በደምህ አጥበህ ከተቀበልከኝ
ፊትህ እንድቆም ከፈቀድክልኝ
በወርቅና ብር የማይለካ
ሕይወት ለሰጠኸኝ ዜማዬን እንካ
ሕይወት ለሰጠኸኝ ሕይወቴን እንካ

ባለውለታዬ የነፍሴ ጌታ 
ባለውለታዬ የሕይወቴ ጌታ
ከምስጋና በቀር የለኝ ችሎታ
ለፍቅርህ ሚመጥን ለዋልከው ውለታ
'''
                  }),
              Song(
                  name: 'ልሻገረው',
                  videoURL: 'https://youtu.be/VxZfeQt2u0A?si=9hyzfbSyOClZc-YB',
                  songLyrics: {
                    'lyrics': '''
ልሻገረው ተነስቼ
በአንተ እግሮቼን አበርትቼ
በሸለቆ አትተወኝም
ጌታ እንዳንተስ አላገኝም

የጠላቴ ጥላ ሸሸ
ለኔ ነግቶ ለእርሱ መሸ
ብርሃኔ ነህ ዋስትናዬ
ማላፍርብህ መመኪያዬ
ልቤ ሆይ በል ቀና ቀና
ጣቴም ንቃ ለበገና
በሸለቆም በከፍታ
ለታመኑት አለ ጌታ

ፈረስና ሠረገላ
ፅኑ እምነቴን አያላላ
በጭንቅም ውሰጥ አምንሀለሁ
ማዳንህን አየዋለሁ
የነሀሱን ደጅ ሰብረኸዋል
ሰልፉን ያንተ አርገኸዋል
እንዴት ልዞር ወደ ኋላ
አዳኝ የለም ከአንተ ሌላ

ከመከራ ማምለጫዬ
ወደ እረፍቴ ማለፊያዬ
ኧረ ስንቱን አሻገርከኝ
የደም ድልድይ ሰርተህልኝ
ከእግሬ በታች ያለው ቀላይ
ሜዳ ሆነ ወዳንተ ሳይ
ፍቅርህ ስቦኝ እሮጣለሁ 
አቅፍህና አነባለሁ

ከመከራ ማምለጫዬ
ወደ እረፍቴ ማለፊያዬ
ኧረ ስንቱን አሻገርከኝ
ጌታ ኢየሱስ  በር ሆነኸኝ
ከሸለቆው ከነጠቅከኝ
በተራራው ራስ ካረከኝ
ምን ይደንቃል ማመስገኔ
ብትሞትልኝ ነው መዳኔ
'''
                  }),
              Song(
                  name: 'ኢየሱስ ናይን',
                  videoURL: 'https://youtu.be/VxZfeQt2u0A?si=9hyzfbSyOClZc-YB',
                  songLyrics: {
                    'lyrics': '''
ኢየሱስ ናይን ወዳጄ
እብኖዲ ናይን ወዳጄ
የነፍሴ ካህን ጌታዬ
አመልክሀለሁ በእንባዬ

እንባዬን በደም ገደብከው
ቁስሌን በቁስልህ አከምከው
ሞቴን በሞትህ ገደልከው
   ልናዘዝ ግፌን ላውራልህ
   ጭንቄን የውስጤን ላዋይህ
   አንተ ነህ ለእኔ ሚገድህ

ኪሪያላይሶ ማስያስ
መሀሪው ኢየሱስ 
ይቅር ባይ ክርስቶስ
አዝ
ናይን ልበልህ ተወዳጅ
ፍቅርህ አለሙን የሚዋጅ
መውደድህ መቼም አያረጅ
   ዘውዴ ነው የእሾህ አክሊልህ
   በትሬ ነው ለኔ ችንካርህ
   ይለፍ ዘመኔ ሳመልክህ

ኪሪያላይሶ ማስያስ
መሀሪው ኢየሱስ 
ይቅር ባይ ክርስቶስ
አዝ
የዋኖስ እና የጠቦት
ደማቸው ግፌን መች አጥቦት
ሞታቸው ሞቴን መች ችሎት
   ነበረ ፅድቄ እንደ መርገም
   ባልነፃ ውዴ ባንተ ደም
   መዳኔ አይዘልም ከሕልም

ኪሪያላይሶ ማስያስ
መሀሪው ኢየሱስ 
ይቅር ባይ ክርስቶስ
አዝ
ስምዖኖች በሩን ቢይዙት
አደባባዩን ባይከፍቱት
በእሾህ መንገዱን ቢዘጉት
   አንተ ልብህን ከፍተሀል
   በእንባዬ እንዳጥብህ ፈቅደሀል
   ካህኑ ነፍሴን ፈተሀል

ኪሪያላይሶ ማስያስ
መሀሪው ኢየሱስ 
ይቅር ባይ ክርስቶስ
'''
                  }),
              Song(
                  name: 'ማህተሙን የፈታኸው',
                  videoURL: 'https://youtu.be/VxZfeQt2u0A?si=9hyzfbSyOClZc-YB',
                  songLyrics: {
                    'lyrics': '''
ማህተሙን የፈታኸው
መጽሐፉንም የገለጥከው
ታረድክልኝ መታመኛዬ
ጌታ ኢየሱስ ንገስ ቤዛዬ

ንጉስ ሳለህ በዙፋንህ ልታድነኝ በመውደድህ
ልትለግሰኝ ምህረትህን ጦር ቀዶታል አካልህን
ታርደሀልና ታርደሀልና ለክብርህ ክብሬን ልጣለውና
ሞተሀልና ሞተሀልና ስለ ውለታህ ላብዛ ምስጋና

ፅድቅ የሆንከኝ ለመርገሜ በጎንህ ደም ቆሟል ደሜ
ሠው ያልሰጠኝ ሠው ማይቀማኝ የልቤ ልብ የማትከዳኝ
ታርደሀልና ታርደሀልና ለክብርህ ክብሬን ልጣለውና
ሞተሀልና ሞተሀልና ስለ ውለታህ ላብዛ ምስጋና

መቃብሬን ወስደህልኝ ዙፋንህን ከሰጠኸኝ
ላንሳህ እንጂ አፍቃሪዬ ዝም አልልም ሠውን ብዬ
ታርደሀልና ታርደሀልና ለክብርህ ክብሬን ልጣለውና
ሞተሀልና ሞተሀልና ስለ ውለታህ ላብዛ ምስጋና

የኪዳን ልጅ ያውም የሀዲስ የዋጀኸኝ በደም መፍሰስ
ስለሆንኩኝ እኔ አልፈራ ባንተ ወድቋል የሞት ጭፍራ
ታርደሀልና ታርደሀልና ለክብርህ ክብሬን ልጣለውና
ሞተሀልና ሞተሀልና ስለ ውለታህ ላብዛ ምስጋና
'''
                  }),
              Song(
                  name: 'ይናፍቃል ልቤ',
                  videoURL: 'https://youtu.be/VxZfeQt2u0A?si=9hyzfbSyOClZc-YB',
                  songLyrics: {
                    'lyrics': '''
ይናፍቃል ልቤ በበብዙ
ሊታዘዝህ ሊገዛልህ ሊያገለግልህ

ኃጢአትም እንደ ህልም ውስጤን ሲገዛኝ
በፍቅርህ ስታየኝ አነባለሁኝ 
በውስጤ ይፈሳል ፍቅርህ እንደዘይት
እንዴት ልርሳው ቸርነትክን ከተለወጥኩብት

ለፍርድ አትቸኩልም በልጆችህ ላይ
 ልቦናዬን ማርከኸዋል ከምንም በላይ
የእኔ አይደለምና የምድር ሰውነቴ
ላገልግልህ ባሪያህ ሆኜ ቸር ነህ መዳኒቴ

አመፅን ለመስራት ስፈጥን ከመንገድ 
ከአጠገቤ አይሃለሁ እብደቴን ስታግድ
 እንደምን ወደድከኝ ምን እከፍልሃለሁ
ከሰው ምንም የማትወስድ መሆንክን አውቃለሁ 

እንግዳ ነህ ለእኔ አዲስ ነህ ለቤቴ 
ትልቁ ዘመዴ ለብቸኝነቴ 
ዳር ሆነህ አታየኝ ሀዘን ሲገርፈኝ
ለጥያቄዎቼ ሁሉ መልስ የምትሆነኝ
'''
                  }),
              Song(
                  name: 'ክብርህን ሳይ',
                  videoURL: 'https://youtu.be/VxZfeQt2u0A?si=9hyzfbSyOClZc-YB',
                  songLyrics: {
                    'lyrics': '''
ክብርህን ሳይ እጠግባለሁ
ለሞትክልኝ አድልቻለሁ(x2)
ቢበረታም ግፍ መከራው
አይነቅለኝም ከተራራው(x2)

ሰው ላጣሁት ሰው ሆነሀል
መዋረዴን አክብረሀል
በአንተ ድካም ተሸልሜ
ወድቀህልኝ ታየሁ ቆሜ

ከቀመሱ የማይተውህ
ወይን እኮ ነህ የማይጠግቡህ
ዜማ ዜማ መተንፈሴ
ደርሰህላት ነው ለነፍሴ(x2)

ወትሮም አለም እንደዚህ ነች
እንኳን ለእኔ ላንተ አልሆነች
ደምተህላት ተሰቅለህም
ሞተህላት አታምንህም

ይሄን ሳስብ ብቻ አርፋለሁ
ነቀፋዬን እረሳለሁ
ከፍ ብለህ ከፍ ያረከኝ
የእምነቴ ራስ ክበርልኝ(x2)

ፅኑ እምነቴ ከዱላቸው
ዝማሬዬ ከስድባቸው
ያሸንፋል ለዘላለም
ስላለበት ታላቁ ስም

በታቦር ነኝ ካንተ ጋራ
በርቶልኛል ስታበራ
እሰወር ዘንድ አይቻለኝ
እንድሰብክህ ከቀባኸኝ(x2)
'''
                  }),
              Song(
                  name: 'መለስክልኝ ፊትህን ',
                  videoURL: 'https://youtu.be/VxZfeQt2u0A?si=9hyzfbSyOClZc-YB',
                  songLyrics: {
                    'lyrics': '''
መለስክልኝ ፊትህን 
ከፈትክልኝ ልብህን
በበደል ስበረታ
ሸፈንከኝ በይቅርታ

ደግሜ ደጋግሜ አንብቼ ደጅህ ቆሜ
ስታየኝ በዝምታ ስጨነቅ ሳመነታ
ደርሳልኝ ስውር እጅህ ሰርታልኝ ቤቴን ቀኝህ
ሳልጨርስ አጉረምርሜ ባረኩህ ተሸልሜ

በደም የተሸለምክ የሕይወት ምሰሶ
አምሮበታል ልቤ ምህረትህን ለብሶ

በሰው ፊት ማይነገር ከአንተ ግን ማይሰወር
ነበረኝ ብዙ ሸክም መንፈሴን የሚያደክም
ስትለኝ ና ወደ እኔ እንባዬ ሸሸ ካይኔ
ፈገግታህ ፈታው ፊቴን በክንድህ ጥዬ ክንዴን

በደም የተሸለምክ የሕይወት ምሰሶ
አምሮበታል ልቤ ምህረትህን ለብሶ

የልቤን ስውር መዝገብ የምትገልጥ የምታነብ
የነፍሴ ነፍስ አንተ ነህ ያስጌጥከኝ እርቃን ሆነህ(x2)
ክፋቴ ያላከፋህ ግፊያዬ የማይገፋህ
ዘላለም ማትቀየር አባት ነህ ሁሌም ፍቅር

በደም የተሸለምክ የሕይወት ምሰሶ
አምሮበታል ልቤ ምህረትህን ለብሶ
'''
                  }),
              Song(
                  name: 'አንተን ያስቀደመ',
                  videoURL: 'https://youtu.be/VxZfeQt2u0A?si=9hyzfbSyOClZc-YB',
                  songLyrics: {
                    'lyrics': '''
አንተን ያስቀደመ እንዴት ይሸነፋል
ወጀብ ማዕበሉን በክንድህ ይቀዝፋል
በባህር ላይ ቆመህ አይታሀለች አይኔ
ሞቴን ረግጠሀል ኢየሱስ መድህኔ

ያንተስ አይወራም ከቋንቋ በላይ ነው
ይሰብክሀል ደምህ ምድርን የሸፈነው
አንደበት አጠረኝ ለክብርህ ርዝመት
ፍቅርህ ነው ልሳኔ አንተን ምገልፅበት

በዘመን ፍፃሜ በአንተ ተናግሮኛል 
አባትህ ወደ ክብር በቃሉ ጠርቶኛል
ያንን ድምፅ ሰምቼ እንዴት ዝም እላሉሁ 
ኢየሱስ አምኜህ ከኋላህ እሮጣለሁ
ጌታዬ አምኜህ ከኋላህ እሮጣለሁ

እንደ ጠላት ሀሳብ ጉድጓዴ ቢማስም
በሞት ጀርባ ቆም ኩኝ አንግቤ ያንተን ስም
አንተን አስቀድሜ እየተከተልኩህ
ዘመን ይቆጠራል ተባረክ እያልኩህ
'''
                  }),
            ]),
        Albums(
            name: 'የእረፍቴ ቦታ',
            photo: yeErefteBota,
            albumNumber: 02,
            realeasedDate: DateTime.now(),
            songs: [
              Song(
                  name: 'አንተ የልቤ ጌታ',
                  videoURL: 'https://youtu.be/cSOatY_5mYs?si=AUKXJnz1nhIuXypV',
                  songLyrics: {
                    'lyrics': '''
አንተ የልቤ ጌታ አንተ የልቤ ንጉስ
ግባ ከልቤ መቅደስ
ልፅና ባንተ ልቀደስ

በሕይወት መስታወት ፊት የነበረኝ ውበት
እረግፏል ሲመሽ ቀኑ የሳቄ ዘመኑ
ወደ ደጅህ ልገስግስ ሽቶዬን እንዳፈስ
እንድነሳ አጎንብሼ ከፍቅርህ ቀምሼ

ከልካይ የለበት እግሬ ተሰብሯል ቀንበሬ
አለም ጀርባዬን ትየው ፊቴስ ወዳንተ ነው
አይኔ እንዴት ሊከደን ሳላየው ገፅህን
ያፍክን በረከት ልስማ ነገ እንዳልጠማ

አንተን ማን ሊከልለኝ በፍቅርህ ወርሰኸኝ
ምን ሊነቅልህ ከሀሳቤ ተተክለህ በሀሳቤ
መስቀልህን ታቅፌ ላንተ ተሰልፌ
ሽንፈት ሞትን አላይም ጋርዶኛል ያንተ ስም

ከስሞች የበለጠ ክሴን ያቀለጠ
ታላቁን ስም ይዣለሁ ማንን እፈራለሁ
ኢየሱስ ሆይ ሳልልህ ልሳኔ ሳይጠራህ
አይነጋልኝ ሌሊቱ የልቤ ፅልመቱ

'''
                  }),
              Song(
                  name: 'መቼ ነው',
                  videoURL: 'https://youtu.be/VcEutMQWzU8?si=4bDCIBbNnFNF9Nm1',
                  songLyrics: {
                    'lyrics': '''
መቼ ነው ያለ ቅድመ ሁኔታ
መቼ ነው በእምነት ምሰብክህ ጌታ
መቼ ነው የዙሪያዬን ረስቼው
መቼ ነው ስለ እውነትህ ማደላው

የዘላለሙን ስለ ዛሬዬ
አልለውጥ ኑሮዬን ብዬ
የማታልፈውን ዛሬ በሚያልፈው
አልቀይርህ በማይዘልቀው
ለመድረክ ድምቀት ከንቱ ጭብጨባ
ሀሰት እንዴት ላስተጋባ
የነገርከኝን ያንን መስክሬ
ልረፍ ከእውነትህ አብሬ

ከንቱ ማባበል ከአንተ አይደለም
ስለ ሰው ብዬ አልተውህም
ላገልግል እንጂ ሀሳብክን ጌታ
እጄን አልሰጥም ለእልልታ
መክፈቻ መዝጊያው በእጅህ እያለ
ልቤ ሰው ሰውን እያለ
ላላመንኩበት አልሰለፍም
በአፌ ክህደት አያልፍም

የአይሁድ ከበባ የቄሳር ምክር
የነቀያፋ ማህበር
ውዴ ከአላማህ መቼ መለሰህ
ሀሰት ቢያድንህም እውነት ነህ
እርቃን ተሰቅለህ እርቃን የዋልከው
ስለ ልጅህ ያላፈርከው
ቃልህን በሀሰት እንዳልቀባባ
መንፈስህ ይርዳኝ አባባ

እግሬ ሲተከል ስቆም ደርቡ ላይ
አይኖቼን ላቅና ወደ ላይ
ምናገረውን የሚያሳውቀኝ
አብሮኝ ነውና አይጨንቀኝ
እብደት ቢመስልም ላንተ ማድላቴ
አልሸሽግህም እውነቴ
መንገድ ሕይወቴ ነህ አቅጣጫዬ
ዘላለሜን መፍሰሻዬ

'''
                  }),
              Song(
                  name: 'ያላንተ ክብር የለኝም ',
                  videoURL: 'https://youtu.be/BJ5TqigN-KE?si=EhZBCrxfmeyBYHGa',
                  songLyrics: {
                    'lyrics': '''
ያላንተ ክብር የለኝም 
ላምልክህ ለዘላለም
ተባረክ ቸር ጌታዬ
ምንጭ ነህ ለደስታዬ

የልቤን ጥማት ተካህ በሙላት
ላክብር ስምህን ላውራ ዝናህን
ሞግስ ግርማዬ ሃር ሸማዬ
አፍሯል ከሳሼ አንተን ለብሼ

ተባረክ ውዴ እውነት መንገዴ (x2)

ልውጣ ማልጄ ተከፍቶ ደጄ
ወደ ናፍቆቴ አቅንቷል ፊቴ
ድካሜን ጥዬ እልፍ ብዬ
አግኝቼሃለሁ መች እለቅሃለሁ

ዘውዴን ላንሳልህ  እጅ እንድነሳህ
ክብርስ ላንተ ነው  ሞቴን ለሞትከው
አልደራደር ባንተማ ነገር 
ብኖር ብሞትም አንተን አልክድም

ልቁም ሰገነት በቤተ መንግስት
ዓለቴ አንተ ነህ የምመካብህ
የነፍሴን አውታር ቃኝተህ በፍቅር
ባታሰልፈኝ ማን ሊያስታውሰኝ

'''
                  }),
              Song(
                  name: 'ከሰንፔር በላይ',
                  videoURL: 'https://youtu.be/SOarTY-oz6o?si=s4Uc1RUHNGMbpvw_',
                  songLyrics: {
                    'lyrics': '''
ከሰንፔር በላይ ከኢያሰጲድ በላይ(x2)
በልቤ በራ የፍቅርህ ፀሀይ

ቢደነግዝም ሌቱ ቢረዝም
ሰማዩ ቀልቷል በደምህ ፈክቷል
ይኸው ለንጋት ሰጠውህ ስብሀት
ያርግድ ጉልበቴ ነቅቶ አንደበቴ(x2)

የሞት እርግማን ቢሞላው አፌን
ደምህ አጥቦታል ቅኔ ተርፎታል
የሌቱ ግርማ ብርቱ ጨለማ 
ተገፏል ዛሬ ቢስብህ ፍቅሬ

የልቤ መቅረዝ እንዳይደበዝዝ
ከጎንህ ዘይት አፈሰስክበት
መብራቱን በእጄ አርገህ ወዳጄ
በሩ ሲከፈት ሞቴን ቀደምኩት

በሰማይ በምድር በእንቁና በብር
እንዴት ይለካል ፍቅርህ ይለያል
ልትፈውስ ነፍሴን ሰበርከው ልቤን
በመሰዊያዬ በዛ እልልታዬ
'''
                  }),
              Song(
                  name: 'ልሄድ ከጌታ ጋር',
                  videoURL: 'https://youtu.be/UjtlzoWozrE?si=iJPXy3MOIW15iCXs',
                  songLyrics: {
                    'lyrics': '''
ልሄድ ከጌታ ጋር ልኖር እናፍቃለሁ
ኢየሱስ ውብ ሙሽራዬን ላየው ወዳለሁ
ነጩን ልብስ ተጎናፅፌ በቀኙ ቆሜ
ቡሩኩን ስባርክ መኖር ይሄ ነው ሕልሜ

ጥቅሜ ነው ለኔ ሞት ከአለሙ ሞኝነት
ለማያልፈው አለም ታጭቻለሁ በደም(x2)
የሚለኝ እኔ ነኝ የእኔ ነው የምለው
ሊወስደኝ ይመጣል በክብር ይገለጣል(x2)

ያልተበረዘ እውነት የሚታወጅበት
የጠራ አምልኮት የሚፈፀምበት(x2)
ያ ዘመን ናፈቀኝ የሰማያት እልፍኝ 
ውዴን ከውዴ ጋር ልካፈል በመዝሙር

በፀጋው ያዳነኝ በቀኙ ሚያቆመኝ
እርሱ ነው ሕይወቴ ድልድዬ ነው ሞቴ(x2)
ትንሳኤው ሕይወቴ ኢየሱስ አባቴ
እንደሞትኩ አልቀርም መስክሬ ያንተን ስም (x2)

በተዘጋጀልኝ ሰማያዊ እልፍኝ
ካከበሩት ጋራ ተሰጥቶኛል ስፍራ(x2)
ማህተሙን ሊፈታ የተገባው ጌታ
ለሚያበራው አጥቢያ አሜን ሀሌሉያ(x2)

ማራናታ ማራናታ
አሜን ጌታ ሆይ ቶሎ ና
'''
                  }),
              Song(
                  name: 'የእረፍቴ ቦታ',
                  videoURL: 'https://youtu.be/q_gjgDkeJpo?si=wxESA14IUI9bcDjC',
                  songLyrics: {
                    'lyrics': '''
ራፊዲም ነህ የእረፍቴ ቦታ
ኢየሱስ ነህ የነፍሴ እርካታ
ታገሰልኝ ብርቱ ጥማቴ
ደም አፍልቆ ጎንህ አለቴ

በሲን እና  በሲና መሐል
የእረፍት አለት አንተ ቆመሀል
ስቅለት ሞትህ ቢሆን ከሽፍታ
በፍቅር ነው አንተ ስትረታ

ከሲን ምድር ተላቅቄአለሁ
ወደ እረፍቴ ተሻግሬአለሁ
ጥዑም ፈሳሽ ቀምሶ ከንፈሬ
ተወገደ ማንጎራጎሬ

እንደ ሙሴ በትር አንስቼ
እንደ አለቱ ጎንህን ወግቼ
ዝግ አይኖቼ ብርሃን ተሞሉ
ስለ ፍቅርህ ዘለላ ጣሉ

ባዶ ሆነህ ሁሉን ሰጠኸኝ
ወዝክን አጥተህ አለመለምከኝ
ሳጉረመርም ባንተ ላይ ቆሜ
ደምተህልኝ ተቀጣ ጥሜ

አማሌቅም በእኔ አልበረታም
በሀያል ክንድህ ስለተመታ
ከሞቴ ቤት ሞትህ ነጠለኝ
ራፊዲም ነው የነፍሴ ስንኝ

'''
                  }),
              Song(
                  name: 'አሜን የአጥቢያ ኮከቤ',
                  videoURL: 'https://youtu.be/2-vDpnsXT0o?si=9YFcIZwsvdOyDm7g',
                  songLyrics: {
                    'lyrics': '''
አሜን የአጥቢያ ኮከቤ ድመቅ በልቤ ብራ
ክበርልኝ ኢየሱስ አፌ ዝናህን ያውራ

አለኝ ማወራው አለኝ ታላቅ ቃል
ቅዱስ መንፈስህ እንደ አውሎ ይነጥቃል
ደመናም ባይኖር ማን ይወቅስሀል
ምድረበዳውን አረስርሰሀል

የዘይቱ ቀንድ ይዘላል ፊቴ
ቀብዓ አለ ዛሬ ድል አለ ቤቴ
በሩን ክፈቱት ይግባ ወዳጄ
የነፍሴ ነፍሷ የወይን ጠጄ

ሰባቱ መቅረዝ አሉ በፊትህ 
ዛሬም ህያው ነው ታላቅነትህ
የዝግባው አናት ተንቀጠቀጠ
ድምፅህን ሰምቶ ሞት ደነገጠ

ከሁሉ ይበልጣል ውዴ ልዩ ነው
በቁንዳላው ላይ ውብ ሽቶ ያለው
የጥበብ ሰዎች አዩት ሲያበራ
የአጥቢያ ኮከቤ ውዱ ሙሽራ
'''
                  }),
              Song(
                  name: 'መሃናየም',
                  videoURL: 'https://youtu.be/s3abAI8Sog4?si=zuxg5WlviDgRS00g',
                  songLyrics: {
                    'lyrics': '''
መሃናይም አይገደብም
የዝማሬው ጅረት አይቆምም
የእግዚአብሔር ነው ሠራዊቱ
አይፈታም ትጥቁ ጉልበቱ

ከፊታችን ሰባሪው ቀድሞ
ሠራዊቱ ከኋላው ተሞ
እንደ ፈሳሽ ምድርን አራሰ
አለምን ወረሰ
የመነጨው ከመላእክት አለም
ኢያሪኮን የመታው ዝናብ
መች ይቆማል ግንቡን ሳይነድል
የዜማው ማእበል 

አንቅቶናል እንደ ዲቦራ
እንድንቀኝ ለደሙ ስራ
የድል ሆኗል መወድሳችን
ምርኮ ላበዛልን
መላእክቱን ያሰለፈልን
ሠራዊቱን ያዘመተልን
ተአምር ሰሪ አለ መዳፉ
የጌታ ነው ሰልፉ

ወንጌላችን የተከደነው
ላላመኑት ለሚጠፉት ነው
ገልጦልናል የእውቀቱን ሽታ
የሞተልን ጌታ
ብንገፋም አንጨነቅም
ብንወድቅም ከቶ አንጣልም
ብንሰጥም ለሞት ተላልፈን
በእርሱ ህያዋን ነን

የክርስቶስ ልብ አለንና
አንጓዝም በሰው ጎዳና
ይሰበራል ብረትና ጦር 
ያሸንፋል ፍቅር
የዝማሬ ጥሩር ለብሰናል
የጠላትን ምሽግ ሰብረናል
የማረክነው አይምሮን ሁሉ 
ስላለን ነው ቃሉ

ተወልደናል ከማይጠፋ ዘር
በሰማያት ነው የእኛስ ሀገር
አይነቀል አብ የተከለው 
ኢየሱስ ያፀናው
በኮቴያችን ገዳዩ ሸሸ
ለእኛ ነግቶ ለጠላት መሸ
መሃናይም የአምላክ ዘማች ነን
ሽንፈት የማያውቀን

'''
                  }),
              Song(
                  name: 'ሕይወት ተገልጧል',
                  videoURL: 'https://youtu.be/9agffE6n-qA?si=_cTARt-ZXcerhS6S',
                  songLyrics: {
                    'lyrics': '''
ሕይወት ተገልጧል እኔ አይቻለሁ
በአንድ ልጁ ሞት ተዋጅቻለሁ
ስለ አብ ፍቅር ተሰልፌአለሁ

በደብረታቦር ሰጥቶኝ ምስክር
እርሱን ስማልኝ አባቱ ካለኝ
አደምጠዋለሁ መች ጠግበዋለሁ
ማይዋሽ እውነቴ ይክበር ሕይወቴ

ልጁ ተብዬ ሊሆን ጥሪዬ
ምን እንደሰጠኝ ፍቅሩን እዩልኝ
ለባሪያው ድነት በአንድ ልጁ ሞት
ይደንቃል ፍርዱ እፁብ መውደዱ

ድኜ በደሙ አላፍር በስሙ
ይህን በሰው ፊት ልመስክርለት
ልድን እንዳምነው ልጁን የላከው
ታርቆኛል በሱ ተዘግቷል ክሱ

ከኡየሱስ ጋር ሁሉንም ነገር
ወዶ ለሰጠኝ ማጉረምረም የለኝ
ልጁ ስላለኝ ባለሕይወት ነኝ
ለነፍሴ ክብር አለኝ ምስክር
'''
                  }),
              Song(
                  name: 'ችንካርህ',
                  videoURL: 'https://youtu.be/9eE3JRWBzZI?si=fo-espkMmPYhi1Oy',
                  songLyrics: {
                    'lyrics': '''
ችንካርህ ፍቅርህን ነገረኝ
አባቴ ያኔ ስትሞትልኝ
በልቤ በደም ያተምክልኝ
ዘላለም ስምህ ይክበርልኝ

አይደለም የቃል ብቻ መውደድህ የለው አቻ
ፈፀምከው ያንን ኪዳን ጠራኸኝ በደም ልሳን
አልመልስ ውለታህ ከበደኝ
በደም የዋልክልኝ
ከአይምሮ ከሕሊና በላይ ነው
በቃል የማልገልፀው

ሞትህን ልሙት የሚል እንዳንተ የት ይገኛል
ከአንተ እኔን ያስቀድመኝ ብለህ ተሰበልክልኝ
አልመልስ ውለታህ ከበደኝ
በደም የዋልክልኝ
ከአይምሮ ከሕሊና በላይ ነው
በቃል የማልገልፀው

ፈሰሀል በልቤ ላይ ልትቀጣው ያንን ዋዕይ
አይሆንም ምድረበዳ ከምንጭህ የሚቀዳ
አልመልስ ውለታህ ከበደኝ
በደም የዋልክልኝ
ከአይምሮ ከሕሊና በላይ ነው
በቃል የማልገልፀው

ገና ነው መች ጨርሼ ስላንተ ቅኔ አፍስሼ
ለደምህ ባወርድ እንባ አልረካም ነጋ ጠባ
አልመልስ ውለታህ ከበደኝ
በደም የዋልክልኝ
ከአይምሮ ከሕሊና በላይ ነው
በቃል የማልገልፀው

'''
                  }),
              Song(
                  name: 'እንመሰክራለን',
                  videoURL: 'https://youtu.be/5PKn4WoGB9w?si=ir_CaFWI27reM73Q',
                  songLyrics: {
                    'lyrics': '''
ያለ ልክ እግዚአብሔር ከፍ ከፍ ያረገው
ከስም ሁሉ በላይ ስምን ያወረሰው
እንመሰክራለን ኢየሱስ ጌታ ነው(x2)

በሰማይም በምድርም ከምድርም በታች ያሉ
በኢየሱስ ስም ይንበርከክ ይማረክ ለሀያሉ
ለእግዚአብሔር አብ ክብር ምላስ ሁሉ ይገዛ 
ኢየሱስ ክርስቶስ ነው ሽረት የሌለው ቤዛ

በሰውና በእግዚአብሔር በመካከል አንድ አለ
የዘመናትን እዳ በደሙ የከፈለ
ህያው መስዋዕታችን መታረቂያ የሆነ
በሰማይም በምድርም ከኢየሱስ በቀር የለ

ማርልኝ የሚል ደሙ ከአቤል የተሻለው
ዛሬም ለታመኑበት ይቅርታን የሚያሰጠው
ከሳሹን የሚያሳፍር ዋስትናችን ነው እሱ
መማፀኛ ግንባችን መዳን የለም ያለ እርሱ

ስሙ መለመኛችን ስሙ ማመስገኛችን
በረከትም ነቀፋም ሁሉን መቀበያችን
የበጎች በር የሆነው ወደ ክብር መፍለሻ
ከፍጡር ማንም የለም ቤዛም ሆነ መሸሻ
'''
                  }),
            ]),
        Albums(
            name: 'ይቅርታ',
            photo: yikirta,
            realeasedDate: DateTime.now(),
            albumNumber: 03,
            songs: [
              Song(
                  name: 'ይቅርታ',
                  videoURL: 'https://youtu.be/1kghZOwwQW0?si=jMgj259YYop7PNTO',
                  songLyrics: {
                    'lyrics': '''
ከፊትህ ርቄ መቼ ተመቸኝ
ከፍቅርህ ኮብልዬ መቼ ተመቸኝ
መጣሁ ማረኝ ይቅር በለኝ (x2)
ይቅርታ (X6)
ተቀበለኝ ጌታ

አልውጣ ከመገኘትህ
አይሂድ አይራቀኝ መንፈስህ
ማረኝ እኔን ማረኝ ጌታ
አጥፍቻለሁ ይቅርታ
መተላለፌን አውቃለሁ 
ጌታዬ በድዬሀለሁ
ነፃለሁ ይጠበኝ ደምህ
ይሰረይ ነውሬ በስምህ

ይቅርታ (X6)
ተቀበለኝ ጌታ

ሩህሩህ ሊቀ ካህኔ
የማትጨክን በድካሜ
ታይልኝ በአባትህ ፊት
እንዲሆንልኝ ምህረት

በምህረት (X3)
የኔ ኢየሱስ አይተኸኛል በምህረት
በይቅርታ(X3)
ስለ ደምህ ይቅር በለኝ ማረኝ ጌታ

ይቅርታ (X6)
ተቀበለኝ ጌታ

አሳልፈህ አትስጠኝ ለጠላቴ
አንተው ቅጣኝ በራስህ እጅ ቸር አባቴ
ደምህ ስለ ሀጢአቴ ፈሶልና
በምህረትህ ላብብ እንደገና

በምህረት (X3)
የኔ ኢየሱስ አይተኸኛል በምህረት
በይቅርታ(X3)
ስለ ደምህ ይቅር በለኝ ማረኝ ጌታ

ይቅርታ (X6)
ተቀበለኝ ጌታ
'''
                  }),
              Song(
                  name: 'ሾመኝ',
                  videoURL: 'https://youtu.be/6KDNdvt5YJQ?si=UQygppSUBK1D1jbx',
                  songLyrics: {
                    'lyrics': '''
ከሀጢአተኞች ዋና በምሆን በኔ ላይ
ምህረቱ በዝቶ በዝቶ በኔ ሊያሳይ
ቸርነቱ ገዝፎ ገዝፎ በኔ ሲያሳይ

ባለማመን ባደረኩት ባለማወቅ ያሳደድኩት
ያሳይ ዘንድ ትእግስቱን አበዛልኝ ምህረቱን
በደማስቆ ላይ ተንበርክኬ በፍቅሩ ተማርኬ
     በኢየሱስ ተማርኬ
እንዳላሳደድኩ ተከተልኩት ከአእላፋት መረጥኩት
   ራሴን ክጄ ወደድኩት

ሾመኝ ሾመኝ
ታማኝ አርጎ ቆጥሮኝ
ሾመኝ ሾመኝ
ኢየሱስ ወደደኝ

ከማህፀን የለየኝ የእርሱ እንድሆን ነጠራኝ
ልጁን በኔእንዲገልጠው መማከሬ አይደል ከሰው
ሀጢአተኞችን ሊያድን መጣ ከሲኦል ሊያወጣ
   ከቁጣ ፍርድ ሊያወጣ
ከእነርሱም መሀል ዋና የሆንኩ ይኸው ዳግም ተወለድኩ
   በኢየሱስ ስላመንኩ

ሾመኝ ሾመኝ
ታማኝ አርጎ ቆጥሮኝ
ሾመኝ ሾመኝ
ኢየሱስ ወደደኝ

የአዋጅ ቃል ተናጋሪ የምስራቹን መስካሪ
ምርኮኛ ነኝ የይቅርታው ኑ ስሙልኝ ስለ ውለታው
ያሳደደውን ማን ይምራል ማን ጠላቱን ይወዳል
   ማን እስከ ሞት ያፈቅራል
የማልጠቅመውን ምርጥ እቃ አለኝ ሰይፌን ከእጄ አስጥሎኝ
   ምህረቱን አስታቀፈኝ

ሾመኝ ሾመኝ
ታማኝ አርጎ ቆጥሮኝ
ሾመኝ ሾመኝ
ኢየሱስ ወደደኝ
'''
                  }),
              Song(
                  name: 'በሕይወት መዝገብ',
                  videoURL: 'https://youtu.be/5T0XhDjOy0Y?si=OnpByQ12FMncit1B',
                  songLyrics: {
                    'lyrics': '''
በሕይወት መዝገብ ፃፍከኝ
በፅድቅህ ፃድቅ ሆንኩኝ
ሰርቼ ሳይሆን በስራህ
ዳንኩኝ በፀጋህ 

በሀጢአት የሞትኩኝ በህግ የተገደልኩ ሳለሁ ገና
በአመፃ እያለሁ ጠላትህ እየሆንኩ ሳለሁ ገና
በአንተ በልጁ ሞት ታረቀኝ አባትህ ቸር ጌታዬ
በችንካርህ ብዕር ፃፍከኝ በመዝገብህ ቸር ጌታዬ

የማያሳፍር ተስፋ ማይደበዝዝ የፅድቅ ብርሃን
የማያሳዝን ደስታ ማይቆጠር ልዩ ዘመን
በአይን ያልታየ እርስት ሀገር ከለኝ በአባቴ ዘንድ
መጥተህ ትወስደኛለህ ጌታ ኢየሱስ የኔ መንገድ

ፃፍከኝ በሕይወት ፃፍከኝ(x2)

የኔ ስራ ሳይሆን ተቆጥሮልኝ ስራህ ድኛለሁ
መዝኖ ከሀጢአቴ በሚጮኸው ደምህ ድኛለሁ
ከሕይወት መዝገብ ላይ መልአኩ አያጣኝም ድኛለሁ
በፅድቅህ ተፅፌ ኩነኔ አይፍቀኝም ድኛለሁ

አልጠፋም ከመዝገብህ በመንፈስህ ታትሜአለሁ
ሊደመሰስ እንዳይችል ጌታ ባንተ አምኛለሁ
በዚያ የሕይወት መፅሐፍ ስሜ አለ በሰማያት
በደምህ ወርሻለሁ ገብቻለሁ ወደ እረፍት

ፃፍከኝ በሕይወት ፃፍከኝ(x2)

ነውር የሌለበት እንድሆን በፊቱ የመረጠኝ
የንጉስ ካህን አርጎ የለየኝ ለርስቱ የመረጠኝ
የእርሱን በጎነት ለአለም እንድናገር የመረጠኝ
ወደ ብርሃን ጠራኝ ከጨለማው መንደር አከበረኝ

ከድቅድቁ ጨለማ ወደ ሚደንቅ ልዩ ብርሃን 
ጠራኸኝ ሙሽራዬ ወደ ክብርህ ልዩ ዙፋን
በፀጋህ ነው የዳንኩት ከቶ አይደለም በኔ ስራ
ዋስትናዬ ደምህ ነው እንዳልሰጋ እንዳልፈራ

ፃፍከኝ በሕይወት ፃፍከኝ(x2)

ለሀጢአት ፈቃድ አይደለም መዳኔና ነፃነቴ
የእንደልብ ኑሮ እንዳይሆን የደም ዋጋ ነው ሕይወቴ
ስጋዬ ደክሞ ብስት እንዳይገድለኝ ሀጢአት ደግሞ
ከአብ ዘንድ ጠበቃ አለኝ የሚታይልኝ ለኔ ቀድሞ

ስጋዬ ደክሞ ብስት እንዳይገድለኝ ሀጢአት ደግሞ
ጌታዬ ኢየሱስ አለኝ የሚታይልኝ ለኔ ቀድሞ

ፃፍከኝ በሕይወት ፃፍከኝ(x2)
'''
                  }),
              Song(
                  name: 'በመንፈስ በእውነት',
                  videoURL: 'https://youtu.be/bcFeXFH9L_I?si=5hYTnF11R9JjJpBG',
                  songLyrics: {
                    'lyrics': '''
በመንፈስ በእውነት ላምልክህ ላምልክህ ላምልክህ
ክብርህን እያየሁ ላክብርህ ላክብርህ ላክብርህ

በደም አዲስ ኪዳን ሆኗልና
ከልካይ መጋረጃው ተቀዷልና
በስጋ ገብቼ ወደ ቅድስት
ጌታ አመልክሀለሁ በነፃነት
ውዴ አመልክሀለሁ ያለ ፍርሃት

በሰሎሞን መቅደስ አልባዝንም 
መንፈስህን በስፍራ አልገድብም 
ስምህ ነው የአምልኮ ማዕከሌ
መቅደስህ ማደሪያህ ነኝ ጌታዬ
መቅደስህ ማደሪያህ ነኝ ጌታዬ

ይቃኘኝ ይውረሰኝ መንፈስ ቅዱስ
ሰንሰለት ይበጠስ ወህኒው ይፍረስ
ከእንግዲህ አያስረኝ የሰው መርህ
መዝሙሬ ላንተ ነው ስለ ክብርህ
ዜማ ላንተ ብቻ ስለ ክብርህ

ቅዱስ ቅዱስ ቅዱስ
ምስጋና ላንተ ይኸው ኢየሱስ 
አምልኮ ላንተ ይኸው ኢየሱስ 
ሀያል ሀያል ሀያል
አምልኮ ላንተ ይገባሀል
ዝማሬ ላንተ ይገባሀል
ታርደሀልና ይገባሀል
ሞተሀልና ይገባሀል
'''
                  }),
              Song(
                  name: 'አመሰግንሃለሁ',
                  videoURL: 'https://youtu.be/_srulPsj8yk?si=lw8azM5UpkOUmIMX',
                  songLyrics: {
                    'lyrics': '''
በእንግድነቴ ሀገር 
ሞገስ የሆነኝ አፅናኝ የሆነኝ 
እንባዬን አባሮ ደስታ የሆነኝ 
ሰላም የሆነኝ
አፌን በዝማሬ በቅኔ ሞልቶ 
   በዕልልታ ሞልቶ 
አሸበሽባለው ጉልበቴ ፀንቶ
ጭንቄ ተረስቶ 

የከሳሼን ጦሩን ሰብረህልኝ
ከአሳዳጆቼ ዛቻ ሰውረኸኝ
የአኪጦፌል ምክር ተበትኖ 
ከጎልያድ ሰይፍ ጠጠሬ መዝኖ
እኔ በዐይኔ ሲሆን ያላየሁት
ከልለኸኝ ስንቱን በአንተ አለፋኩት
አልተውከኝም ወንድሞች ሲጠሉኝ
በእንግድነት ሃገር አስከበርከኝ

ሌላም ፈተናም ቢመጣ ይታለፋል በአንተ 
ስምክን አምኖ እየጠራ ላንተ ለዘመተ
ሃይልን በምትሰጠኝ ጌታ ሁሉን እችላለሁ 
ኢየሱስ ጌታ ነዉ እያልኩ ቅጥሩን አፈርሳለሁ 
እመሰክራለሁ

አመሰግንሃለሁ አመሰግንሃለሁ
ኢየሱስ የኔ ነህና 
ማዕበሉን አልፋያለሁ

ስደት ሰለፉ ሲበረታ ሲያይል ማዕበሉ
ደርቡ ድንገት ሲሰነጠቅ ጀርባ ሲሰጥ ሁሉ
ወዳጅ እጁን ቢከለክል ሊያነሳኝ ሲፈራ 
የኔ ቸር ደጉ ሳምራዊ ፈጥነህ ደርሰኽልኝ 
     ጨለማዬ በራ

አመሰግንሃለሁ አመሰግንሃለሁ
ኢየሱስ የኔ ነህና 
ማዕበሉን አልፋያለሁ

ራሴን በዘይት ቀብተኸኛል
ምርኮዬን ተናጥቀህ አስመልሰሃል
ግፊያው ስደቱ ለበጎ ሆነልኝ 
በእጥፍ ድርብ እየባረከኝ (x2)

አመሰግንሃለሁ አመሰግንሃለሁ
ኢየሱስ የኔ ነህና 
ማዕበሉን አልፋያለሁ
'''
                  }),
              Song(
                  name: 'ነፍሴ የወደደችህ',
                  videoURL: 'https://youtu.be/OB6wQRufg7w?si=jWO_w8Jtxjjy7GEr',
                  songLyrics: {
                    'lyrics': '''
ነፍሴ የወደደችህ አገኘሁህ
እልፍ ስል ውዴ በአይኔ አየሁህ
አሁን ከቶ አያሻኝም ከአንተ ሌላ
እኔ አልመለስም ወደ ኋላ

በፍቅር የጠራኸኝ ወዳጄ
ሳትሰለች የፀናህ ከደጄ
እንደ ንፅህት ድንግል አጭተኸኝ
አንተም የእኔው ነህ ያንተው ነኝ

አሜን 
አንፅተኸኝ በደምምህ ከሀጢአቴ
አሜን
አባትህን እንድለው አባቴ
አሜን
ሳያገኘኝ የሀጢአት መከራ
አሜን
ወደ ክብር ገባሁ ባንተ ስራ

   ህይወት በዝቶልኛል በአንተ ሆኖልኛል
   ጌታ በከበረው ደምህ ገዝተኸኛል
   ዋሴ ጠበቃዬ የቅርቤ ዘመዴ
   ለአብ ቀርቤአለሁ ሆነኸኝ መንገዴ

በመስቀል ስራህ አርፌ
በደምህ ከቁጣህ ተርፌ
ይኸው በሰማያት በቀኝህ
አስቀመጠኝ ወዶኝ አባትህ

አሜን
በስቃይህ በመከራህ ድኜ
አሜን
በአንተ ፅድቅ የእግዚአብሔር ፅድቅ ሆኜ
አሜን
መንግስትና ካህን አድርገኸኝ
አሜን
የዘላለም ህይወትን ሸለምከኝ

አንተን እንድመስልህ ተወስኖልኛል
አለም ሳይፈጠር አብ አባት መርጦኛል
አሁን ምን እሻለሁ ከዚህ ፍቅር በላይ
የደም ኪዳን አለኝ ካንተ ወዲያ ላላይ

አሜን
ለእርስቴ መያዣ ሰጥተኸኝ
አሜን
በቅዱሱ መንፈስ አትመኸኝ
አሜን
እልፍኛችን በልቤ ተስሎ
አሜን
ናፍቄአለሁ ውዴ ናልኝ ቶሎ
'''
                  }),
              Song(
                  name: 'ተናገረኝ',
                  videoURL: 'https://youtu.be/w7TZ8FUAUho?si=mj_GvKYWpViNWEGQ',
                  songLyrics: {
                    'lyrics': '''
በሰማሪያ ልታልፍ ግድ እንደሆነብህ
በያዕቆብ ጉድጓድ አጠገብ ተቀምጠህ
አረፍ በል ከቤቴ እለፍ በልቤ እልፍኝ
ሳልሰማህ አልውጣ እስኪ ተናገረኝ(x2)

ተናገረኝ(x2)
እስኪ ተናገረኝ(x2)

ተራራውን ዘሎ ቃልህ ደጄን ይምታ
ዛሬስ ጠምተኸኛል አልችልም ዝምታ
ይሰማኝ ውብ ድምፅህ ያ የሚያሳርፈኝ
ተናገር እሰማለሁ ውድዬ አትለፈኝ

ተናገረኝ(x2)
እስኪ ተናገረኝ(x2)

ጉዴን ታውቀዋለህ ሸክሜን
እኔ ማላውቀው ምስጢሬን
ልውጣ በአይኖችህ ታይቼ
ልረፍ ድምፅህን ሰምቼ

ተናገረኝ(x2)
እስኪ ተናገረኝ(x2)

የሕይወት ምንጭ ሆይ ከአንተ የት እሄዳለሁ
ብቻ ቃል ተናገር እኔ እሰማሀለሁ
አቤት አባብዬ ሀሳብክን ንገረኝ
መፍትሔ አንተ ነህ እስኪ ኤፍታህ በለኝ(x2)

ኤፍታህ በለኝ(x2)
እስኪ ኤፍታህ በለኝ(x2)

እለፍ በሕይወቴ ላይ
ክብርህን እንዳይ
እለፍ በእልፍኜ ላይ 
ማዳንህን እንዳይ

እጠብቅሀለሁ በመጠበቂያዬ
ዘግይተህ አታውቅም አውቃለሁ ጌታዬ
ድምፅህ  ይታየኛል ሲወርድ እንደ ጅረት
ዛሬስ ቀኔ ሆኗል ድምፅህን ለመስማት
ዛሬስ ቀኔ ሆኗል እጅህን ለማየት
ዛሬስ ቀኔ ሆኗል ድምፅህን ለመስማት

ተናገረኝ(x2)
እስኪ ተናገረኝ

ኤፍታህ በለኝ ተናገረኝ
ውዴ ተናገረኝ
'''
                  }),
              Song(
                  name: 'ታስፈልገኛለህ',
                  videoURL: 'https://youtu.be/MQZ631vhvDc?si=SA57cJ9cWuujdDNX',
                  songLyrics: {
                    'lyrics': '''
የምወደው የማከብረው አብሮነትህ
የሚናፍቀኝ የማልጠግበው መገኘትህ
ህልውናህ የእረፍቴ ጥግ ነው ወደቤ
መንፈስህ ነው የዘወትር ረሃቤ

ታስፈልገኛለህ ታስፈልገኛለህ
መንፈስ ቅዱስ መንፈስ ቅዱስ ታስፈልገኛለህ(x2)

የርስቴ መያዣ ታትሜብህ ለቤዛ ቀን
ተስፋዬ ጣዕሜ ምኖርብህ ዘላለምን
የእውነትን መንገድ ያስተማርከኝ መምህሬ
ጌታ መንፈስ ቅዱስ በአንተ ነው መፅናናት መኖሬ

በማይነገር መቃተት የምትቃትትልኝ
በፍቅር ያሳወከኝ እውነትን የመሰከርክልኝ
እንዴት እንድፀልይ ለማላውቅ ጉድለቴን ምትሞላ
ከዚህም የላቀ ሀይልህን ናፈቅሁ እንደ ዋላ

ጌታችን ኢየሱስን ያስነሳኸው ከሙታን
የትንሳኤው ሀይል ነህ የሞትን ጣር ያጠፋህ
የእግዚአብሔር ቅዱስ መንፈስ ዛሬም አለ በእኔ ላይ
በአንተ ወጥቻለሁ ምድርን ትቼ ወደ ሰማይ
ሰላም እና እፎይታ ነፃነት ነህና
ልጥለቅለቅ በፍቅርህ በሀይልህ ልሞላ
የለየኸኝ ከአለም የተሰወርኩብህ
በውስጤም እያለህ ታስፈልገኛለህ
አልጠግብህም ገና ታስፈልገኛለህ

ያላንተ ይደክማል አልጫ ነው የለው ጣዕም
ባንተ መሆን እንጂ መኖር ማለት ኑሮ አይደለም
የእስትንፋስ ዝውውር መገኘትህ ከሌለበት
ምኑን ህያው ሆነ መንፈሰ ቅዱስ ሳትከብርበት

መንፈስ ሞልተህብኝ በብርታት ስጋ ደም ሳልመክር
ይታይ በሕይወቴ ኢየሱስ ይገለጥ በክብር
እፈልግሀለሁ ሁልጊዜ ትናፍቀኛለህ
ጌታ መንፈስቅዱስ አሁንም ታስፈልገኛለህ
'''
                  }),
              Song(
                  name: 'እንዴት',
                  videoURL: 'https://youtu.be/jWIH0SvYbr4?si=eEFHK_KJEk5RUqkO',
                  songLyrics: {
                    'lyrics': '''
እንዴት እንዴት ስምህን ሳልጠራው እንዴት እኖራለሁ
እንዴት
ለስምህ ሳልዘምር እንዴት እችላለሁ

አይሆንልኝም ጌታ ያላንተ
እኔስ አልችልም ውዴ ያላንተ
በልቤ መሐል ስምህ ተቋጥሯል
ሌት ቀን አይለይም ኢየሱስ ይላል

የምኖርበት ብቸኛ ምክንያት ነህ ጌታ
በትውልድ መሐል አንተን ልባርክ ጧት ማታ
በልጅነቴ የዜማን ዝናር አስታጥቀህ
ሾምከኝ ለክብር ከሸለቆ ውስጥ ጎትተህ

ጠላት ቢነሳም ስምክን ከአፌ ሊያስጥለኝ
እንዴት ይሆናል ከቶ እኔ ያላንተ ሕይወት የለኝ

መቼ ነው መቼ ነው ብዬ እቃትት ነበረ
ዙሪያዬን ማየት አሁን ቀርቶልኝ ታሪክ ተቀየረ
አልደራደር ባንተማ ነገር ብዬ አላፈርኩም
አምንብሀለሁ ብኖር ብሞትም ጌታ አንተን አልክድም

አይሆንልኝም ጌታ ያላንተ
እኔስ አልችልም ውዴ ያላንተ
በልቤ መሐል ስምህ ተቋጥሯል
ሌት ቀን አይለይም ኢየሱስ ይላል

እስኪ የሚያምርብኝን ስምህን ልጥራ
እስኪ የሚያዋጣኝን ስምክን ላውጀው
አባ ከፍቅርህ ምን ይለየኛል
ውድህ ከውዶች ይበልጥብኛል

አልችልም መኖር ጌታ ያለ ስምህ
ኢየሱስ ብቻ ትበቃኛለህ
አንተ አለኸኝ ይቅር የቀረው
ሙላት ደስታዬ ጌታ ስምህ ነው

አይሆንልኝም ጌታ ያላንተ
እኔስ አልችልም ውዴ ያላንተ
በልቤ መሐል ስምህ ተቋጥሯል
ሌት ቀን አይለይም ኢየሱስ ይላል
'''
                  }),
              Song(
                  name: 'የአሜን ነው',
                  videoURL: 'https://youtu.be/HhMA01mwTUY?si=udAcLUawbNeJMoBy',
                  songLyrics: {
                    'lyrics': '''
የአሜን ነው ሕይወቴ የአሜን ነው
የአሜን ነው ኑሮዬ የአሜን ነው
የለም ሌላ ቃል የለም አሜን ነው ለዘላለም
የለም አሉታ የለም አሜን ነው ለዘላለም

የሚያልፈው እያለፈ አሳላፊዬ ቆሞ
ገደቡ ተደርምሶ ሰባሪው ለእኔ ቀድሞ
አይቻለሁ በአይኖቼ ጌታ እጣዬን ሲያጠና
ሰነሰለቴ ተሰብሮ አሜን ሲሆን ምስጋና

እኔ በእኔ አልኖርም ጌታ ይኖራል በእኔ
ኑሮዬ በእምነት ሆኗል ከእርሱ ጋር ተሰቅዬ
ሚኖርብኝ አለና ነፍሱን ስለ እኔ ሰጥቶ
ሌላ ምላሽ የለኝም አፌ በአሜን ተሞልቶ

ሰማይ ምድርን የሚያልፍ የታመነ ቃል ኪዳን
ከኢየሱስ ጋር አለኝ የማይሻር በዘመን
እርሱ ያለኝን ብቻ ነኝ አልወርድም ከቃሉ ላይ
አሜን ነው ቃልኪዳኔ ከጌታ በቀር ላላይ

በእርሱ አዎን ሆኖልኝ አይደለም የለም በእኔ
በሸለቆም ተራራም አሜን ብቻ ነው ቃሌ
ዙሪያዬን እያስናቀ ዜማ የሚያስጎነጨኝ
አሜን በሆነው ጌታ አሜን የሚል ድምፅ አለኝ

'''
                  }),
              Song(
                  name: 'በሰላም ሂድ ያለኝ',
                  videoURL: 'https://youtu.be/Zm6eH46aQJw?si=B1Qp-yfkZ4jmsYpY',
                  songLyrics: {
                    'lyrics': '''
በሰላም ሂድ ያለኝ አዋጅን ቀይሮ
ድነሀል ኑር ያለኝ ቀንበሬን ሰባብሮ
ነፃነት የሰጠኝ አርነት ያወጣኝ
ሞቴን የሻረልኝ ሕይወት ያወጀልኝ

እርሱ ነው ኢየሱስ እርሱ ነው ጌታዬ
እርሱ ነው ክርስቶስ እርሱ ነው ቤዛዬ

ቃል አውጥቶብኛል በሕይወት ትኖራለህ በሰላም ሂድ ብሎ
እመን ትድናለህ እንዳለ አድኖኛል ሸክሜን አንከባሎ
የዘመናት ህማም የከረመ ሸክም
በጌታ ተሻረ ታሪክ ተቀየረ ነገር ተቀየረ
አሁንማ ባለዜማ ነኝ ባለ እልልታ
መዝሙር ቅኔ ስራዬ ሆኗል ድኜ በጌታ

በስሜ ጠርቶኛል አቤት ብዬ ልውጣ መግነዜ ይፈታ
ሞቷል ያለው ማነው አዋጅ ይቀየራል ላመነ በጌታ
የሌለውን ነገር እንዳለ ሚጠራ ታሪክ ሚገለብጥ
ዕፁብ የእርሱ ስራ ሃያል የእርሱ ስራ
ዕፁብ ዕፁብ ዕፁብ የኢየሱስ ስራ
ሀያል ሀያል ሀያል ያባብዬ ስራ

ቀሚሱን ብዳስስ ሀይል ከእርሱ ወጣ ቀጥ አለ መርገሜ
ኢየሱስ ያድናል ፈውስ በጌታ አለ ድኛለሁኝ እኔ
ልቤን አክሞታል ምስክር ነኝ እኔ
አይኖቼን አብርቷል አይቻለሁ እኔ
ልቤን ፈውሶታል ምስክር ነኝ እኔ
ልቤን አክሞታል ምስክር ነኝ እኔ
አይኖቼን አብርቷል አይቻለሁ እኔ
ልቤን ፈውሶታል ምስክር ነኝ እኔ
'''
                  }),
            ]),
        Albums(
            name: 'ኖላዊ ሄር',
            photo: nolawiHer,
            albumNumber: 04,
            realeasedDate: DateTime.now(),
            songs: [
              Song(
                  name: 'ሰማያት',
                  videoURL: 'https://youtu.be/FlVzM5decOk?si=97tbiDDoiWRyP9hl',
                  songLyrics: {
                    'lyrics': '''
ሠማያት ክብርህን ይናገራሉ
አፅናፋት የእጅህን ስራ ያወራሉ
የዘረጋሀት ምድር መረገጫ ሁና
በቅንነት በትር ዙፋንህ የፀና
ብርሀን ከቦህ ብርሃን ሆነህ ዘላለም አለህ
መሳይ የለህም ብቻህን አንተ እግዚአብሔር ነህ(x2)

የጠፈር ድንበር መጨረሻው
የት ጋር ይሆን ጥጉ ማብቂያው
ከዋክብት ነገድ ቁጥራቸው
ስንት ይሆን ብዛት ስፍራቸው
  ላስበው እልና ሀሳብ ይጠበኛል
  አንተ የጥበብ ሀገር ስራህ ይደንቀኛል
  የጣቶችህ ስንዝር አድማስን ለክቶ
  አለማትን ያልፋል ቀላያትን መልቶ

ትልቅ ነህ(x3) 
እግዚአብሔር እኩያ የሌለህ
ትልቅ ነህ(x3)
ያህዌ አምሳያም የሌለህ
ከላይ ነህ የበላይ የሌለህ
ብቻህን አንተ እግዚአብሔር ነህ


ዘላለም ወደ ፊት ነው ኋላ በአነዋወርህ ሲሰላ
ዘመናት ፊትህ ይወድቃሉ በአንተ ይጠቀለላሉ
  መናገርም ሳይኖር ድምፅም ሳይሰማ
  ፅርሃ አርያም ኢዮር ሳይፈጠር ራማ
  ከዘላለም በፊት ኖረሀል ዘላለም
  እግዚአብሔር ታላቅ ነህ እኛም አናውቅህም

ትልቅ ነህ(x3) 
እግዚአብሔር እኩያ የሌለህ
ትልቅ ነህ(x3)
ያህዌ አምሳያም የሌለህ
ከላይ ነህ የበላይ የሌለህ
ብቻህን አንተ እግዚአብሔር ነህ
'''
                  }),
              Song(
                  name: 'ብወድህ',
                  videoURL: 'https://youtu.be/KJJ695rs-Io?si=nk7U_0fyDFKibKRi',
                  songLyrics: {
                    'lyrics': '''
እጅግ ብዙ ምህረትህ 
ጫፍ በሌለው ቸርነትህ 
ወደኸኛል አስቀድመህ 
ለህይወቴ ህይወት ከፍለህ

ብወድህ ታድያ ምን ይገርማል 
ባከብርህ ታድያ ምን ይደንቃል (x2)

ስለ ጥቅሜ ስለ ራሴ ልውደድህ እንጂ እኔ
መች ጎድሎብህ መች አንሶብህ ውዳሴና ቅኔ
አምልጬብህ ከሞት ከሃጢአት ከሲኦል አለንጋ
ሃጢያተኛ ነብሴ ብትድን በፃድቁ ዋጋ
እንደምን ብዬ ቸል ልበለው
አይነጋም ሌቱ የወደደኝን ውዴን ሳልሰጠው
አልበዛም ላንተ ገና ያንስብሃል
ህይወት ለሰጠኝ የልቤ ጉልበት ይንበረከካል 

ብወድህ ታድያ ምን ይገርማል 
ባከብርህ ታድያ ምን ይደንቃል (x2)

የፈወሰ ያዳነ እጅህ በችንካር ቢደማ
ሰበቅታኒ ብለህ ስትጮህ ምላሽ ባይሰማ 
ባይረዳህ ባያስተውል ትዉልዱ ባያውቅህ
የርህራሄ የመውድ ምንጭ ኢየሱስ ፍቅር ነህ
የፍቅር ጉልበት ቀመር ቢሰላ 
ይቆጠር ቢባል ከምድር ጅማሬ እስከ በኋላ 
የፍጥረት ሁሉ ታሪክ ቢደመር 
ጀርባህ ላይ ካሉት ሰንበሮች መሀል 
     ካንዷ ጋር እንኳን አይወዳደር

ብወድህ ታድያ ምን ይገርማል 
ባከብርህ ታድያ ምን ይደንቃል (x2)

ስትክድን ፀሃይ አይኗን ደም ለብሳ ጨረቃ 
ተፈራርቆ የግፍ አይነት ተግተህ መራራ
እንደ ታቦር ተራራው ጫፍ ልብስህ ባያበራ 
ስጋህ ደምቶ ተጎሳቁሎ በደም ቢጎመራ
አየሁ ምህረት አየሁ ይቅርታ 
ፍቅር አይኖችህ ደም አንብተዋል ስለኔ ደስታ
ማራኪዬ ነህ ዉድህ ገዝቶኛል
ከነበደሌ የወደድከኝን
   አንተን ብወድህ ምኑ ይገርማል 

ብወድህ ታድያ ምን ይገርማል 
ባከብርህ ታድያ ምን ይደንቃል(x2)

እጅግ ብዙ ምህረትህ 
ጫፍ በሌለው ቸርነትህ 
ወደኸኛል አስቀድመህ 
ለህይወቴ ህይወት ከፍለህ(x2)
ብወድህ ታድያ ምን ይገርማል 
ባከብርህ ታድያ ምን ይደንቃል (x2)

'''
                  }),
              Song(
                  name: 'አምንሃለው',
                  videoURL: 'https://youtu.be/VxZfeQt2u0A?si=d7bd6Lj8oNH8-cSv',
                  songLyrics: {
                    'lyrics': '''

አምንሃለሁ ጌታ አምንሃለሁ
አምንሃለሁ ጌታ አምንሃለሁ

ተገልጠው ቢታዩ የዘመኔ ምዕራፍ ገፆች 
ካንተ ይጀምራሉ ካበጁኝ የእጆችህ ጣቶች 
እናቴም ሳትፀንሰኝ አባቴም ሳያውቀኝ ገና
ታስቤ ነበረ ጌታዬ በአንተ ህሊና
ጣቶቼን ይዘኸኝ እርምጃን ሳጠና
ስውተረተር ልሄድ እግሬን ስታቀና
ስኮላተፍ ስድህ አይን አይኔን እያየህ
ተጠንቅቀህልኝ አድጌያለሁ ፊትህ

ቢደራረብ ሰልፉ ክፉ ጦር ቢያዘምት ቢነሳ
አለኝ ፊት አውራሪ ድል ነስቶ ድል የሚያስነሳ
ማውቀው ጌታ እያለ ማላቀው ነገን አልፈራም
በአንተ ያልፍ የለም ወይ አምኜህ እኔስ አልሰጋም
የትላንቱ አመሻሽ ዛሬ ላይ ቢያጠላ
ምን እንዳለ ባላውቅ ከነገ በኋላ
እውቀቴ አንድ ብቻ እርሱም በአንተ ማመን
ማለዳ ነህ ብርሃን ጨለማን ምትበትን


የዘገየ ቢመስል ያሰብኩት ከጊዜው ረፍዶ
ከላይ ያስቀመጥኩት ቢገኝ ተደርምሶ ወርዶ
በግዜህ የምትባርክ አለህና ታማኝ ጌታ
ስለምን ላጉረምርም በምስጋና ፈንታ ለአፍታ
ለእኔ አትተወኝም እንኳን ለእኔነቴ
ነፍሴን አትሰጣትም ለከንቱ ምኞቴ
ስህተቴን ሰርዘህ ሰው ታደርገኛለህ
ያመንኩህ አባቴ መች ትጥለኛለህ'''
                  }),
              Song(
                  name: 'ቀኜ ትርሳኝ',
                  videoURL: 'https://youtu.be/nmRHklgBLJg?si=M6PV3G23HscJpEYw',
                  songLyrics: {
                    'lyrics': '''
መሰንቆዬን በአሃያ ዛፎች ላይ ሰቅዬ
የእንቢልታዬ ቅኝት ዜማው ቀርቶ ከኋላዬ
በአደባባዩ በደርቡ ዜማዬ ባይወጣ
ቢታቀብ አንደበቴ ቃል ከአፌ ሲታጣ
   የምስጋናን ቃል ፈለጉብኝ
   አመስግን እንጂ ዘምር ቢሉኝ
   ልቤ ተነሳ ሊያዜምልህ
   ቅኔዬ ነቃ እንዲህ ሊልህ

ቀኜ ትርሳኝ ብረሳህ
ምላሴ ይጣበቅ ባላስብህ
የምወድህ ደስታዬ
ገነቴ ነህ መኖሪያዬ
ቀኜ ትርሳኝ ብረሳህ
ምላሴ ይጣበቅ ባላስብህ

አንተ አይደለህም ወይ የኪዳን ሀገሬ
ሞት እንዳያገኘኝ ከለላ የሆንከኝ የሕይወት ድንበሬ
አንተ አይደለህም ወይ ያዘመትከኝ መሪ
በፀናች እጅና በተዘረጋች ክንድ ሆነህ ፊትአውራሪ

አንተ አይደለህም ወይ እንዴት ይዘነጋል
ውለታህ ልቤ ውስጥ ዘላለም ላይጠፋ በጣትህ ተፅፏል

ክንድህ አይደለም ወይ ትናንቴን የረታ
ዛሬን የሚያኖረኝ  የነገ ተስፋዬ የነፍሴ መከታ
እጅህ አይደለም ወይ ያጎረሰኝ ቆርሶ
ያጠጣኝ ስጠማ ከልዑላን ማዕድ በክብር አቋድሶ

እጅህ አይደለም ወይ ያከመኝ ታምሜ
አቅፎ ያባበለኝ እንባዬን ያበሰው ጣትህ ነው ሰላሜ

አንተ እኮ ነህ ጌታ የዜማዬ ቃና
የቃላቴ ሞገስ የስብከቴ ርዕስ የንግግሬ አርማ
አንተ እኮ ጌታ የልጅነት ህልሜ
የጉብዝና ሀሳቤ የምኞቴ አልፋ ርስቴ አለሜ

ባንተ እኮ ነው ጌታ መሻገር መትረፌ
የጭንቄን ማለዳ የእንባዬን ሌሊቶች የቆምኩት አልፌ


ላምጣ በገናዬን መወድሱን ላንሳ
የልሳኔን ጩኸት ሳልቆጥብ ሳልሳሳ
ታጥቄአለሁ ቅኔ ስምህ ነው ዜማዬ
ለክብርህ ኖራለሁ መዝሙር ነው ስራዬ

እኔስ አለኝ ምስጋና ለሕይወቴ ጀግና

ዜማን በልቤ አርገህ ፈጥረኸኛልና
ማምለክ ነው ስራዬ አንተን በምስጋና(x2)

ኧረ እኔስ አለኝ ምስጋና ለሕይወቴ ጀግና

ቀኜ ትርሳኝ ብረሳህ
ምላሴ ይጣበቅ ባላስብህ
የምወድህ ደስታዬ
ገነቴ ነህ መኖሪያዬ
ቀኜ ትርሳኝ ብረሳህ
ምላሴ ይጣበቅ ባላስብህ
'''
                  }),
              Song(
                  name: 'ታላቅን ነገር',
                  videoURL: 'https://youtu.be/ObsCPHj3Nu8?si=F2mQmWiYg9rMDXvC',
                  songLyrics: {
                    'lyrics': '''
እግዚአብሔር ታላቅን ነገር አደረገልኝ
መድሀኒቴ ታላቅን ነገር አደረገልኝ
ደስም አለኝ ማቄን ቀደደው አዲሱን በፍታ አለበሰኝ
ከሰማያት እጁን ዘርግቶ ወደ መንግስቱ አፈለሰኝ

ማንም በሌለበት በፊትህ የሚቀርብ 
     የሚማልድ ቀርቶ
ሁሉ በሞት መውጊያ ተጠርቆ ሳለ
       በሀጢአት ተወግቶ
የገዛ ክንድህ መድሀኒት አመጣ
         እያገዘው ፅድቁ
ስርየት አደረገው ቁጣና ምህረትህን
             በእርሱ እንዲታረቁ

ኤሎሄ ኤሎሄ ሲልህ
ዝምታ ቢሆን ምላሽህ
እድን ዘንድ እንዲሁ በፀጋ
ከፍለሀል ይህን ሁሉ ዋጋ


ማን ያድነኛል ስል ስጋ በስጋ ህግ
              ሲስበኝ ወድቄ
ፍቅር ቅዱስ ልጅህ ፀጋው አንስቶኛል
               ሆኖልኛል ፅድቄ
የቁጣ ልጅ ሆኜ በሞት እንዳልነበርኩ 
               ያሰረው ኩነኔ
ዛሬስ በአንድ ልጅህ ነፃ ወጥቻለሁ 
            ተውቧል ዘመኔ

እድን ዘንድ ወደሀልና
ላትጠላኝ ፍቅርህ ፀና
በቅዱስ አጠራርህ
ደመርከኝ በመንፈስህ


ገዢ ፈጣሪዬ ብዬ ሳላበቃ
          ሆነሀል አምላኬ
ደግሞ አባት ሆንኸኝ አምላክነትህን
            ሳልጠግብ ተርኬ
እንደኔ ማን አለ የተደረገለት
             ድንቅ ታላቅ ስራ
አብ አባት ወደኸኝ ባለአገር አረከኝ
          ከቅዱሳን ጋራ

መድረሻ ገነቴ ነህ
በእምነት የወረስኩህ
ተአምር አርገህልኛል
በልጅህ አፅድቀኸኛል
'''
                  }),
              Song(
                  name: 'ኖላዊ ሄር',
                  videoURL: 'https://youtu.be/LQvgMGoFkdQ?si=og9ulw34We9PcXKx',
                  songLyrics: {
                    'lyrics': '''
ኖላዊ ኄር ማታቀላፋ የማትተኛው
ኖላዊ ኄር የማትረሳ ማታክተው
መልካም ነህ ትጉህ እረኛ 
ጠባቂ ፅኑ መዳኛ

በዘላለም ኪዳን ደም 
ከአብ የተሰጠኸን ታማኙ እረኛ
ወደ ክብርም መግቢያ
መሪም ነህ መድረሻ 
ከቁጣ መዳኛ
እረፍትም አንተ ነህ
አሳራፊም አንተ ድንቅ መሰማሪያ
እጆቼን ይዘኸኝ ተከትዬ ገባሁ ከክብርህ መኖሪያ

አልጠፋም ከእይኖችህ 
አትሰወር ከአይኔ ትሳሳልኛለህ
በፍቅርህ ምረህ በበትርህ አርመህ
ስመህ ታቅፈኛለህ 
ወድቄ እንዳልቀር
ወድቀህ አንስተህ ተሸክመኸኛል
አሁንም ይዘኸኝ የእቅፍህ ሙቀት አባ ይሰማኛል

አትደክም አትሰለች ጸንተ ቁመህልኝ ትታይልኛለህ
ጮኸቴን ወስደኸው እንዳልሞት በደምህ ትጮህልኛለህ
ምክንያት አለኝ እኔ ብዘምር ብጠራህ ኖላዊ ኄር ብዬ
ከዙፋንህ ወርደህ ስለሆንክልኝ ነው ንጉሱ እረኛዬ

በስሜ ምታውቀኝ ወደአንተ እመጣለሁ ስጠራኝ ሰምቼ
ቀድመሃል ከፊቴ ተከትዬሃለው ከአዳኙ ሸሽቼ
ሌላውን አላውቅም ከእረኛዬ ውጭ ሌላ ድምጽ አልሰማም
ፍቅር ነው ጠረንህ 
መውደድ ነው መለያህ
ከዕልፍኝህ አልወጣም
'''
                  }),
              Song(
                  name: 'ያውም ለኔ',
                  videoURL: 'https://youtu.be/f-DNJK1yOPk?si=iktYppMnjcRTMNm8',
                  songLyrics: {
                    'lyrics': '''
አይቀልብኝም መዳኔ
ማምለጤ ከኃጢዓት ኩነኔ
አይረሳውም ህሊናዬ
አይጠፋም ከልቦናዬ

ያውም ለኔ ለጠፋሁ ኮብልዬ
ያውም ለኔ በኃጢአት ተታልዬ
ያውም ለኔ ከሰማያት ወርዶ
ነፃ ወጣሁ ጌታ እንደበግ ታርዶ

ፍጹም ራስህን ባዶ አደርገህ
የባሪያህን መልክ ይዘህ ተዋርደህ
መተካከልን እንደመቀማት
አልቆጠርከውም በመስቀል ስትሞት
በከንቱ ኑሮ በሚጠፋ ብር አልተገዛሁም
ከአባቶችም በተወረሰ ወርቅ አልተረፍኩም
ማይመነዘር ሃብት ማይገዛው ደም ነው ዋጋዬ
እንደ በግ ታርደህ የእግዚአብሔር ልጅ
     ሆንከኝ ቤዛዬ

አንተን የሚያህል ብርሃን በርቶልኝ
ብቸኛው መንገድ ሕይወት ተገልጦልኝ
ከቶ የት ልሄድ በምን ልረታ
በዓይኔ ተስሏል ተሰቅለህ ጌታ

አላስተያይም የእጅህን ርዝመት እኔ አለካውም
የማያልፈውን የዘላለሜን አልመዝነውም
እንጀራ አይደለም ሕይወት መዳን ነው
      የኔ ጉዳዬ
ሃብትና ንብረት ስቆጥር አልኖርም 
ወንጌልን ጥዬ
'''
                  }),
              Song(
                  name: 'ደግሞ ልዘምር ነው',
                  videoURL: 'https://youtu.be/guHJSyM1vVk?si=SdkIKeJt--iKNpyD',
                  songLyrics: {
                    'lyrics': '''
በፍቅር ሊያመልኩህ ከሚወዱ ጋራ
ክብርህን ላከብር ስምህን ልጠራ
የእርምጃዬ ፍጥነት ይቸኩላል እግሬ

ደግሞ ልዘምር ነው ደግሞ ላመልክህ ነው
   ቀን ወጣልኝ ዛሬ
የእልልታ ቀኔ ነው የዜማ ቀኔ ነው
   እልጠግብም ዘምሬ

በፍቅርህ ማርከኸኝ
በመውደድ አስረኸኝ
ከመዘመር ውጭ
        ምንም ስራ የለኝ
ዜማ አንተርሰኸኝ በክንድህ ታቅፌ
ለሞት እንዳልታጨው
የዝማሬ ሆኗል ተቀይኖ ሰልፌ

ያ ፍቅርህ ያ ፍቅርህ
ድቅን ይልብኛል
ዝም ስል ችንካርህ
        ጎኔን ይወጋኛል
ተረሳ እንዴ ውድህ
     ምነው ዝም አልክሳ
ብሎ ይጠቅሰኛል ከወንድሞችህ ጋር
      ለመዝሙር ተነሳ

በደምህ ታጥቤ አዲሱን ለብሼ
ቃኝተኸኝ በቃልህ
   በመንፈስ ታድሼ
አምሮብኝ መስቀልህ በአንተ ቀና ብዬ
ነፍስ አይቀርልኝም እኔ እኮ አልጠግብህም
     የእኔ ኢየሱስ ብዬ

ሁሉ ካንተ ሆኖ ምን እሰስታሁ
ያለ ልክ ከፍ ላልከው
ክብሬን እሰጣለሁ
ካንተ ቀጠሮ አለኝ በሰማይ ከተማ
  እወድሃለሁ ልልህ
ለታረድክልኝ በግ በዘላለም ዜማ
'''
                  }),
              Song(
                  name: 'ይትፌስሁ ፃድቃን',
                  videoURL: 'https://youtu.be/YQFH4vzF738?si=9tsbfLt0FsFokkqV',
                  songLyrics: {
                    'lyrics': '''
ሀሌ ሉያ(x3)
ይትፌስሁ ፃድቃን በእግዚአብሔር (x2)

ፃድቃን በእግዚአብሔር ደስ ይላቸዋል

ይትፌስሁ ፃድቃን በእግዚአብሔር (x4)

በስምህ ያመኑ ስምህን ተቀብለው በአንተ የተጠሩ
አባ አባት ብለው ማዳንህን አይተው ክብርህን ያከበሩ
የመጥራትህን ተስፋ ሊመጣ ያለውን ሀይልህን ሚጠብቁ
በእምነት ሰንሰለት በእውነት ምሰሶ  ካንተ የተጣበቁ

ይትፌስሁ ፃድቃን
በአብሮነትህ ሰላም በቅድስናህ ክብር በፅድቅህ ብርሃን
ይትፌስሁ ፃድቃን
ዝማሬ በመላው በፍቅር መንግስትህ በምስጋናህ ዙፋን
ይትፌስሁ ፃድቃን
በሰጠኸን አፅናኝ በቅዱስ መንፈስህ አሮጌአችን ወልቆ
ይትፌስሁ ፃድቃን
ንስብሆ እያልን ተቀኘን በሀሴት መርገማችን ወድቆ

ንሴብሆ ንሴብሆ ለእግዚአብሔር
ስቡሀ ዘተሰብሀ ስቡሀ ዘተሰብሀ

ቅዱስ ቅዱስ ሲሉ ነገደ መላእክት ተደንቀው በግርማህ
ማይቋረጥ ዜማ ዘወትር ሲያፈልቁ ሲሰግዱ በፊትህ
ማንነት ሞገስህን ኪሩብ ወ ሱራፌል አይለዱትም ከቶ
በሰማዩ መቅደስ ዘወትር አሜን ነው በክብርህ ተመልቶ

ይትፌስሁ ፃድቃን
ስብሀት በሰማያት ወ ሰላም በምድር ቅኔው ሲያስተጋባ
ይትፌስሁ ፃድቃን
ዝማሬ መላእክት ቅኔ መወድሱ ወደ ምድር ሲገባ
ይትፌስሁ ፃድቃን
በዘላለም ዜማ ሀሌሉያ ልንል እንሄዳለን ገና
ይትፌስሁ ፃድቃን
ከቅዱሳን ሀገር ከፃድቃን መንፈሶች ወደ መርጨት ደሙ ከበኩራት ማህበር አድርሶናልና

ይትፌስሁ ፃድቃን በእግዚአብሔር (x2)

በአንተ ደስ ይለናል በደም በዋጀኸን ባዳንከን በፀጋ
አጥበህ ለቀደስከን ላፀደቅኸን በፍቅር በከፈልከው ዋጋ
ደግመን እንላለን በአንተ ደስ ይለናል ከሀጢአት ላጠብከን
ለአባትህ ካህናት መንግስት ላደረከን እንዲህ በወደድከን

ይትፌስሁ ፃድቃን
በመብልና መጠጥ ያልሆነ በምድር ባላፊው ቆይታ
ይትፌስሁ ፃድቃን
በእግዚአብሔር ፅድቅ ሞትን ድል ባረገው በትንሳኤው ጌታ
ይትፌስሁ ፃድቃን
የመዳናችን ቀንድ ምክሃ ቅዱሳን አንተ የሕይወት ውሃ
ይትፌስሁ ፃድቃን
ስምህን ስንጠራ ሐሴት ሆኖልናል ዘመነ ፍሰሀ
'''
                  }),
              Song(
                  name: 'ሰው ነኝና',
                  videoURL: 'https://youtu.be/8VBWfrIh-L8?si=FsUcPyuUY0-6hTvD',
                  songLyrics: {
                    'lyrics': '''
ሰው ነኝና የረከሱብኝ ከንፈሮቼ
ወዮልኝ አልኩ ጌታን ስላየሁ በአይኖቼ

እኔ አልደፍርም ፊትህ መቆም እፈራለሁ
እኔ አልደፍርም አይገባኝም ይሄን አውቃለሁ(x2)

እኔ ማነኝ ክብርህን ለማየት
በአፌስ ስምህን ለመጥራት
ምን ሕይወት ብቃት አለኝና
ከግርማህ ስር ፊቴን ላቀና

በፊትህ ቢቃጠል መስዋዕቴ
መተላለፍ ባለው በአንደበቴ
እንዴት እቀርባለሁ በእኔ ብቃት
ታውቀው የለም እንዴ የእኔን ህይወት 

በልጅህ ደም ግን እቀርባለሁ
አብ አባት ብዬ እጣራለሁ
ዳብሰው በእሳቱ ከንፈሬን
ላመስግን ላውጣ ዝማሬን

በምህረትህ ብዛት ወደ ማደሪያህ እገባለሁ(x2)
በቸርነትህ ብዛት ወደ ማደሪያህ እገባለሁ(x2)


የትኛው ስራዬ ምን መዝኖ
ደጅህ ሊያቀርበኝ መንገድ ሆኖ
እንኳን አንተን ላይህ ፊትህ ልቆም
ስምህን መጥራት እኔ አልችልም

አንተን ማየቴ ይደንቀኛል 
አባት ሆይ ፍቅርህ ያስነባኛል
ምህረት በዝቶ ፊትህ አለሁ
እግዚአብሔር የኔ እወድሀለሁ

በምህረትህ ብዛት ወደ ማደሪያህ እገባለሁ(x2)
በቸርነትህ ብዛት ወደ ማደሪያህ እገባለሁ(x2)
'''
                  }),
              Song(
                  name: 'መቅረዝህ',
                  videoURL: 'https://youtu.be/bm27dT8vuUA?si=Djm3AxpDI02rub4U',
                  songLyrics: {
                    'lyrics': '''

መቅረዝህ አድርገኝ ጌታ ምትበራብኝ
እንደቃልህ ምኖር ፅድቅን ምመሰክር
ብርሃን እንደሆንክ አንተን እንዳበራ
በሕይወት ልምሰልህ በቃልም በስራ(x2)

በወንጌል ከመኖር ለወንጌልህ ልኑር
ለእውነትህ ወግኜ ካንተው ደጅ ልደር
የፍቅር ባለሀብት የእምነት ባለጠጋ
ክምችት ማይሞቀው ማይመክር ከስጋ(x2)

ገበሬው ሲመጣ ፍሬ ያላፈራ
ጣፋጭ ታቅዶለት ቢለግስ መራራ
ኋላ ቢቀር መና ተከፍሎለት ስንቱ
ሊሆን አይደለም ወይ እሳት ብድራቱ(x2)

መከራን በስምህ ልቀበል ታግሼ
እኔነቴን ልርሳው ፅድቅህን ለብሼ
ምርጥ እቃህ አድርገህ ስራህ ለአላማህ
ፍላጎቴን ሳይሆን አንተን ላገልግልህ
በአህዛብ መሐል ስምህን ማስከብር
አድርገህ አስታጥቀኝ የወንጌል ወታደር(x2)

ኋላ በአባትህ ፊት እንዳታፍር በእኔ
ሳላፍር በሰው ፊት ልስበክህ መድህኔ
ጌታ ሀይልህ ይንካኝ መንፈሴን አበርታ
በራሴ አልችልም ያላንተ የኔ ጌታ(x2)

'''
                  }),
            ]),
        Albums(
            name: 'ነጠላ ዝማሬዎች',
            photo: singles,
            realeasedDate: DateTime.now(),
            albumNumber: 03,
            songs: [
              Song(
                  name: 'ፍቅር ፍቅር',
                  videoURL: 'https://youtu.be/4SUzXkyLTdc?si=W9ebdt0ns3D2Za87',
                  songLyrics: {
                    'lyrics': '''
ባለምሕረት ባለይቅርታ
የፍቅር ንጉስ የፍቅር ጌታ 
አለህ በውስጤ ዛሬም ከእኔጋ 
መንፈስ ቅዱስ ሆይ ሆነኸኝ ጸጋ

ፍቅር ፍቅር ነህና 
በህልውናህ ዛሬም ልፅናና
ፍቅር ፍቅር ነህና
ስለአብሮነትህ መንፈስ ቅዱስ ሆይ አለኝ ምስጋና 

ወደተርሴስ ነጉዶ እምቢተኛው ልቤ
ስሸሽ ከፍቃድህ ሲናወጥ መርከቤ
በአሳንበሬው ጀልባ መከርኸኝ በጭንቁ
ያመነህ ተውጦ አይቀርም በጥልቁ
  እኔን እኔን ማየትህ ሰው እንዳጣ በምድሩ 
  ዮናስ ነፍሴ ባይገባው የምሕረትህ ቀመሩ
  ሳትተወኝ ለራሴ ሳይታክትህ ውድቀቴ
  ስታቀናኝ ኖረሃል ሳይፀንህ እኔነቴ



በጥፋት ዘመን ላይ ሆንኸኝ ከለላ 
ግራ ቀኝ ከብኸኝ ከፊትና ኋላ
ድብቅ ጦር ጥላዬ መሸሻ ድጋፌ
አሻግረኸኝ አለሁ ውጊያውን አልፌ

ሚገባኝ ሆኜ አይደለም ያዳንከኝ ከዚያ ሁሉ
እንደ እኔ ስህተት ብዛት ባሰጠመኝ ማዕበሉ
ተፍገምግሜ ሳልወድቅ ቀደምክልኝ ከፊቴ
አቅፈኸኝ አጽናናህኸኝ ጵራቅሊጦስ አባቴ

ሲያማትሩ አይኖቼ ስራመድ ለአመፃ
እጆቼ ሲያነሱ የኃጢአት ፍላፃ
ከፈቃድህ ስጎድል ሲጥለኝ ፈቃዴ
ኣልጨከንክብኝም ምረኸኛል ውዴ
የአባትነት ትዕግስትህ ከምድር ገዝፎ ከሰማይ
ኦ ስትችልበት ማፍቀር እንደእናት ከእናት በላይ
በበትርህ ተገስጬ ምርኩዝሕ አፀናንቶኝ 
በአብሮነት ህልውናህ ኖራለሁ ሰላም መልቶኝ

እንዳጣህ አልፈልግም እወድሃለሁ አምላኬ
ራሴን ሰጥቼሃለሁ በፍቅርህ ተማርኬ
የታተምኩብህ ፀጋ ስለቤዛነት ቀኔ 
ላሳዝንህ አልሻም ፍቅርህን አይቷል አይኔ
'''
                  }),
              Song(
                  name: 'ተወልደ ኢየሱስ',
                  videoURL: 'https://youtu.be/15mnxUINFcY',
                  songLyrics: {
                    'lyrics': '''
ተወልደ ኢየሱስ በቤተልሔም
በቤተልሔም ዘይሁዳ በቤተልሔም 
አዋልደ ጢሮስ አሜሃ ይሰግዳ
አሜሃ ይሰግዳ በቤተልሔም 

የተተወችው ሰዎች ያናናቋት ታናሿ ምድር
ከይሁዳ ግዛት የተረሳችው የራቃት ክብር
ትኩረት የማትስበው ወርቅ አልማዝ የሌላት የድሆች ከተማ
ዛሬስ ንጉስ መጥቶ ሆናለች የመዝሙር የምስጋና ማማ

በቤተልሔም 
ተገልጧል የአብ ቃል ከድንግል ማርያም
በቤተልሔም
መሲህ መጥቶልናል ከላይ ከአርያም
በቤተልሔም 
ቤተመንግሥት ሳይሆን በግርግም ተኝቷል
በቤተልሔም 
በአንዲት ታናሽ መንደር ኢየሱስ ተወልዷል

የጢሮስ ልዑላን ባለጠጋዎቹ መጥተው ይሰግዳሉ 
በታናሿ ሀገር አቻ የሌለው ንጉስ ተወልዷል እያሉ
ታላቅ ነገር ሆኗል የዚያች ምስኪን መንደር ታሪክ ተቀይሯል
የጥበብ ሰዎችን አቅጣጫ ሊያሳዩ ከዋክብት ከትመዋል

በቤተልሔም
ሊሰግዱለት መጡ በኮከብ ተመርተው 
በቤተልሔም 
በእናቱ እጆች ዙፋን ለታቀፈው
በቤተልሔም 
ወርቁን ለንግስናው እጣን ለክህነቱ
አቅርበውለታል
ከርቤን ለመከራው ለመስዋዕትነቱ

ህዝብን ከሀጢአታቸው ከሞት የሚታደግ የሚያድን ነውና
መላዕክት ረበዋል ከተማዋን ከበው ቆመው ለምስጋና
አትደንግጡ ብለው የምስራቹን ቃል ለእረኞች ነገሩ
ምድርና ሰማይ እርቅና ሰላምን በአንድነት ዘመሩ

በቤተልሔም 
ስሙ ድንቅ መካር ሀያል የተባለ
በቤተልሔም 
ከሰማይ ሳይጎድል ደግሞም በምድር ያለ
በቤተልሔም 
የአብ ቃል ሰው ሆኖ ታየ በተዋሕዶ 
በቤተልሔም
የሰላሙ አለቃ ከአርያም ወርዶ
'''
                  }),
              Song(
                  name: 'መጽአ ቃል',
                  videoURL: 'https://youtu.be/57x7jDFFegQ',
                  songLyrics: {
                    'lyrics': '''
መጽአ ቃል እምደመና ዘይብል ዘይብል(x2)
ዝንቱ ውእቱ ወልድየ ዘአፈቅር

ከአብ ዘንድ የኖረው የዘላለም ሕይወት
ለእኛ የተገለጠው ሰማያዊ እውነት
በእርሱ ደስ የሚለው አባቱ ነግሮናል
ልጄን ስሙት ብሎ ቃሉን ልኮልናል

ዝንቱ ውእቱ ወልድየ ዘአፈቅር(x2)

አስተርእዮ ኮነ በሰማይ ወምድር
አድምጠናልና የእግዚአብሔርን ፍቅር
በአምሳለ እርግብ መንፈስቅዱስ ወርዷል
ማዕከለ ዮርዳኖስ ታላቅ ነገር ሆኗል

ዝንቱ ውእቱ ወልድየ ዘአፈቅር(x2)

አንድስ እንኳ የለም እግዚአብሔርን ያየው
መጥቶ ተረከልን በእቅፉ ያለው
በእርሱ ሚያምን ሁሉ እንዳይጠፋ ከቶ
አብ እንዲህ ወዶናል አንድ ልጁን ሰጥቶ

ዝንቱ ውእቱ ወልድየ ዘአፈቅር(x2)

ከገናናው ክብር ከብሩህ ደመና
ከአማናዊው ድምፅ የሰማነው ዜና
ይህ ታላቅ መገለጥ ብርሃን ሆኖልናል
ወደ ልጁ ህብረት አብ አባት መርቶናል

ዝንቱ ውእቱ ወልድየ ዘአፈቅር(x2)

ንፁህ የእግዚአብሔር በግ የአለም መድሀኒት 
ሀጢአት የሚያስወግድ ተገልጦ በትስብእት
የትህትናን ጥግ አየን ፍቅርን በእርሱ
በአገልጋዩ እጅ ተጠምቋል ንጉሱ

ዝንቱ ውእቱ ወልድየ ዘአፈቅር(x2)

መጽአ ቃል እምደመና ዘይብል ዘይብል(x2)
ዝንቱ ውእቱ ወልድየ ዘአፈቅር
'''
                  }),
            ])
      ]),
      Singer(
          name: 'ዘማሪት ዘመናይ ጎሳዬ',
          photo: GSZemenay,
          singerId: 's-02',
          albums: [
            Albums(
                name: 'ይሄን ነው የማውቀው',
                photo: yhenew,
                realeasedDate: DateTime.now(),
                albumNumber: 01,
                songs: [
                  Song(
                      name: 'ካህኔ',
                      videoURL:
                          'https://youtu.be/7G4XcQ10ETo?si=CTMUc7NfopXR7oKS',
                      songLyrics: {
                        'lyrics': '''
ካህኔ ሊቀ ካህኔ
ኢየሱስ ሊቀ ካህኔ
በኔ እና አብ መሀል ያለኸው ወገኔ

እንደ አሮን ልጆች ሞት አይገድብህም
እንደ ሌዋውያን ነውር የለብህም
የማይለወጥ ነው ፍጹም  ክህነትህ
በመሀላ የጸና ነውና ሹመትህ
    ቤዛየ(x2) ኢየሱስ ቤዛየ
    ለነብሴ የወጣ ይጽድቅ ጸሀየ

ልሙትልሽ ብሎ ማን ፊቴ ቀደመ
ከኢየሱስ በቀር ማን ለኔ ታመመ
አላውቅም አይኖርም የለም ሌላ ቤዛ
ጠላቱን በዋጋ ደም ከፍሎ የገዛ
    አዳኜ(x2) ኢየሱስ አዳኜ
   የሞት መድኃኒቴ የህይወት እልፍኜ

የዚያ ክፉ እባብ የመርዙ ማርከሻ
የጠጣሁህ መጠጥ ፍቱን መፈወሻ
በመገረፍ ቁስል በጀርባ ላይ ሰንበር
ያኔ ተሰበረ የኃጢአቴ ቀንበር
   አለቴ(x2) ኢየሱስ አለቴ
   የተተከልኩብህ ጽኑ መሰረቴ

የህያው አምላክ ልጅ
ማለት አይደክመኝም 
ይህን ስጋና ደም አልገለጠልኝም
በዚህ አለትነት ተመስርቻለሁ
የማእዘኑ ራስ አግኝቼሀለሁ
  መልህቄ (x2) ኢየሱስ መልህቄ 
  ላትለቀኝ የያዝከኝ የእግዚአብሔር ልጅ ጽድቄ
'''
                      }),
                  Song(
                      name: 'ውለታህን',
                      videoURL:
                          'https://youtu.be/UlVTn_Ej5so?si=w_963DFxvTH91ng5',
                      songLyrics: {
                        'lyrics': '''
ውለታህን ኢየሱስ እንዴት ልደብቀው
የፈወሰኝ እጅህን እንደምን ልልቀቀው
አልተካህም በማንም በምንም
ራሴን እንኳን እንዳንተ አላምንም

ጥቅሜን ማውቀው እኔ ነኝ ሙላቴን ከእጅህ የበላሁት
ከመዳፍህ ዘግኜ መቃሜን መቼ ረሳሁት
የማነባው አይደለም አዝኜ ውለታህ ነው እንጅ
አልረሳህም እኔ አልሸሽግህም የእግዚአብሔር አብ ልጅ

በልቤ ውስጥ ፅኑ ኪዳን አለ የአባትነት ፍቅር
ልጅነቴን በደም ፅፈኸው ነው አባቴ የምልህ
የእንባ ደራሽ ይቀድመዋል አይኔን ሳልጀምር መናገር
ከህሊናዬ በላይ ሆኖብኛል አባ ያንተስ ነገር


ዳዴ እያልኩኝ የማውቀው ስምህን ያንን ያፌን መፍቻ
አልተውህም የህይወቴ ቁልፏን አይሁድን ፍራቻ
እኔ ገና መች ነካሁትና የቅኔ ዝርፊያዬን
ሳላፍርብህ ልገልጥህ ቃል አለኝ ውዴ ማትረፊያዬ

የሰው አፅናኝ እንባዬን የሚያብስ ብዙ ፈልጌያለሁ
ላንተ ጀርባ ለሰው ደግሞ ፊቴን ሰጥቼ ኖሬያለሁ
ገና አሁን ነው የገባኝ እውነቱ ለኔ የኔ እንዳለህ
ዘመዴ ሆይ ማልቀሴን የማትወድ በአባትህ ቀኝ ያለህ
'''
                      }),
                  Song(
                      name: 'ልቤ ላይ',
                      videoURL:
                          'https://youtu.be/Ug7aEX2lHDU?si=u0wYE2YA_zDgySLJ',
                      songLyrics: {
                        'lyrics': '''
ልቤ ላይ
ልቤ ላይ ነህ አንተ
ልቤ ላይ
በውስጤ ነህ አንተ
በደም የዋጀኸኝ በመስቀል ላይ ሞተህ
ልቤ ላይ ልቤ ላይ ነህ አንተ

ከፍ እላለሁ ባንተ በማምለጫ አለቴ እዘላለሁ ቅጥሩን
ጠላት እስኪገርመው ገዛሁት በስምህ ውቅያኖስ ባህሩን
በልቤ ሰማይ ላይ ፀሀይ ሆነህ ወጥተህ አበራች ህይወቴ
አለ በልቤ ላይ የመንፈስህ ቅባት ኢየሱስ አባቴ

አዋጁ ሲታወጅ ሲገለጥ መፅሀፉ መህተሙም ሲፈታ
ምድርና ሞላዋ አምልኮና ስግደት ላንተ ብቻ ጌታ
ከነገድ ከቋንቋ ዋጅተኸናልና እናገንሀለን
አሜን ሀሌሉያ እስከ አለም ዳርቻ ምስክሮችህ ነን

ሰው በልቡ አምኖ ኢየሱስ ይልሀል አንደበቱን ከፍቶ 
የዋጀኸው በእምነት ያገለግልሀል በፍቅርህ ተፅናንቶ
የመዳናችን ቀንድ እግዚአብሔር ያስነሳህ ታላቅ ወንድማችን
በመከራችን ቀን እንባችንን አባሽ አይዟችሁ ባያችን

አንድ ቤዛ አለ አንድ ሊቀ ካህን መርገም የሰበረ
ሞትን የገደለ አዋጁን የሻረ ኩነኔን ያስቀረ
ከፍ አለ ወደ ላይ ከፍ ወደ ሰማያት ወደ ክብሩ ገባ
አሁን ነው ዝማሬ አሁን ነው እልልታ ቅኔና ሽብሸባ

'''
                      }),
                  Song(
                      name: 'በማለዳ',
                      videoURL:
                          'https://youtu.be/v9g49Rk69_k?si=NcmMsT_h_2gcguex',
                      songLyrics: {
                        'lyrics': '''
በማለዳ ደምጽህን ሰማሁት በማለዳ
በጥኡም ቃል ለኔ ያለህን ፍቅር ስታስረዳ
በማለዳ በአዲስ መንፈስ ሆኜ ገሰገስኩኝ
አማኑኤል ከፊቴ ተስለህ እያየሁኝ

የበረታው ማዕበል ያልፋልና
ጸጥታ ይሰፍናል እንደገና
በሰላም ዋዜማ ጸብ እንዳለ
ልቤ እውነትህን አስተዋለ
  ደግፍልኝና ይጽና ልቤ
  ሀሳብህ ተሹሞ በሀሳቤ
  ከአንተ ሌላ እረፍት የለምና
  ኢየሱስ እቀፈኝ እንደገና

እንደ ማለዳ ወፍ ይዘምራል
ቃልህ ልቦናየን ያነቃቃል 
መታጠቂያየ ነው ምክርህ ለኔ
ስለበራህልኝ ፈክቷል ቀኔ
  ከመናገር አቅም የበረታ
  እየሰቀሰኝ ውድህ ጌታ
  አይበቃኝም መስኩ ሰፍቷል እግሬ
  መቆሚያ የለውም ለመዝሙሬ

በልቤ ትከሻ የቃል ሸክም
በግንባሬ አኑረህ ታላቁን ስም
ማልጄ እወጣለሁ ለምስጋና
በእልልታ ታጅቤ በበገና
  እንዳሰማራኸኝ ቅደምልኝ
  ሳትታገልልኝ ድልም የለኝ
  ተዋጋልኝና ላብዛ ምርኮ
  ለስብሀት እንድቆም ለአምልኮ

ለተሰቀልክልኝ ሽብሸባ
እየታጠብኩልህ በእንባ 
ለተሰዋህልኝ እልልታ
አይሆንልኝ እኔ ዝምታ
 ከሞት ለዋጀኸኝ ዝማሬ
 ያዘንባል መወድስ ከንፈሬ
 አምኜብሀለሁ አላፍርም
 ኢየሱስ ጌታ ነህ ዘላለም 
 ኢየሱስ እውነት ነህ ዘላለም 
 ኢየሱስ ሕይወት ነህ ዘላለም 
ኢየሱስ መንገድ ነህ ዘላለም 
ኢየሱስ በር ነህ ዘላለም
'''
                      }),
                  Song(
                      name: 'ያነቃል ተቃውሞ',
                      videoURL:
                          'https://youtu.be/EjEt0dVvoDQ?si=01meHE8mM0nivN2h',
                      songLyrics: {
                        'lyrics': '''
ያነቃል ተቃውሞ ያነቃል ደውሉ
ለኢየሱስ መነቀፍ ፍፃሜው ነው ድሉ
እንዳትፀፀቱ መከራን ፈርታችሁ
እውነቱ ይሄ ነው ጌታን መምረጣችሁ

ነግሮን ነው የሄደው ሚሆነውን ቀድሞ
ከፊት አለ ገና ከዚህ በላይ ደግሞ
ጠላት ወዶ አይደለም ሚያጓራው ዙሪያችን
ለሰይጣን እሳት ነው ኢየሱስ አርማችን
   ይሄ ነው በቃ እውነቱ
   የክርስትናው ድምቀቱ
   ሲያስሩ ሲገርፉ 
   እልልታ የጌታ ልጅ በርታ

ሲገፉን ቀንሙሉ ቀንሙሉ ነው ደስታ
የስደቱ አሻራ ጣፋጭ ነው ትዝታ
በፍቅር መታማት በኢየሱስ መጠርጠር
መታደል ነው ይሄ ካንተ ጋር መቆጠር
   ይሄ ነው በቃ እውነቱ
   የኢየሱስ መሆን ውበቱ 
   ሲጠሉን ሲረግሙን ምርቃት
   አለም እስኪደንቃት

እሱን ገድላ አለም ለኛ ላትራራ
ድነናል እያልናት አይገርምም መከራ
ይከድናል ምድሪቱን ገና ነው ወንጌሉ 
አይቆምም አዋጁ አይታሰር ቃሉ
   ይሄ ነው በቃ ጀግንነት 
   መዳንን ማወጅ በእምነት 
   አልተሳሳትክም በጉዞ
   የእግዚአብሔር ልጅ አይዞህ 

አናስተባብልም አይደለንም ብለን
አዎ የኢየሱስ ነን መዳን ተቀብለን
ከእንግዲህ ምን ቀርቶን እንሸቃቅጣለን
ኢየሱስ ጌታ ነው እያልን እንሞታለን
   ይሄ ነው በቃ ግባችን 
   ስሙን ሲያውጀው ዜማችን
   ስለ አሸናፊው መመስከር
   በሞት ላይ መፎከር

እዚያ በአባትህ ፊት ምስክርህ አለ
ተስፋህ የላቀ ነው ከዚህ የተሻለ
ምንህ ነው ይህ ክብር ይጠቅለል ለክብሩ
ጭብጨባ ሙገሳው አይበልጥም ከፍቅሩ
   ይሄ ነው በቃ ድፍረት
   አትጥራው ሲሉ መጥራት
   የማያልፈውን በማየት
   ከሚያልፈው መለየት
'''
                      }),
                  Song(
                      name: 'ደጄን እየመታህ',
                      videoURL:
                          'https://youtu.be/5Etj_GRppuo?si=fyCnmTAIC97Q6AKQ',
                      songLyrics: {
                        'lyrics': '''
ደጄን እየመታህ በትግስት እየተጣራህ
ችንካር ያለፈበት መዳፍክን በፍቅር ያሳየህ
ልቤን ከፈትኩልህ ግባልኝ የነፍሴ ሙሽራ 
አንድያዬ ኢየሱስ ውረሰኝ ልኑር ካንተ ጋራ

አንተን ባየሁበት አለምን እንደምን አያለሁ
የበላሁበትን በአመፅ እንዴት እሰብራለሁ
ልውጣ ቀራንዮ ጎለጎታ  በእግረ ህሊናዬ 
የከፈልክልኝን ላስተውል ልረዳ ዋጋዬን

ድካም ሳይሸፍነኝ ልንበርከክ ላገልግል በፊትህ
ስምህን ሚያሸንፍ ሀይል የለም በዝቷል ቸርነትህ
እጄን ይዟል እጅህ ሊያነሳኝ ከተናቀው ስፍራ
ሸለቆው ሰገነት ይሆናል ጌታ ካንተ ጋራ

ማር ያዘንባል አፍህ ወዳጄ ቃልህ ነው ወለላ
መሀሪዬ ኢየሱስ ላድምጥህ ሳልጓጓ ለሌላ
ባለ ብዙ ሰላም ንጉሴ ግባ ከጎጆዬ
ፍቅርህን ልመገብ ላጣጥም ይብዛ እፎይታዬ

በህይወቴ እልፍኝ ዙፋንን በክብር ዘርግተህ
ምታስተዳድረኝ አባቴ ሁሉንም አሟልተህ
ህልውናህ ጌጤ ነውና መገኘትህ ክብሬ
ሰልፌን ላሸንፈው በእምነት ጠብቆልኝ ዝናሬ
'''
                      }),
                  Song(
                      name: 'ባለዝናው',
                      videoURL:
                          'https://youtu.be/x0JdQ9tigIE?si=SZr6DRYUyc0MnIY2',
                      songLyrics: {
                        'lyrics': '''
ባለዝናው ክብርን ሁሉ ጠቅልለሃል
ሃሌ ሉያ አዎን አሜን ይገባሃል
ገናናነት ድል ያንተ ነው ቅድስና
አሸብርቋል ውብ 
ማደሪያህ በምስጋና
             
ከልዕልና በታች ወድቆ 
የዝማሬ ዝናር ታጥቆ
ሲባረክህ ምድር ሰማይ 
ሲጥለቀለቅ በአንተ ሲሳይ
ብልጽግናህ የሚያኖረው
እንባ ጉንጩን እያጠበው
ክበር ይላል ንገስ ይላል
ቀምሶ እንዴት ያስችለዋል

 ከዘላለም በፊት ያለህ
ዘመን ሰጭው ዘመን የለህ
ተራሮችን ምታቀልጠው
ውሃ እንደግንብ ምታቆመው
ያኔም ጌታ ዛሬም ጌታ 
እጅህ አለች ተዘርግታ
በዝምታ ትሰራለህ 
በዙፋንህ በስፍራህ ነህ
   
እመካለሁ እኮራለሁ
የሚያስመካ ስላገኘሁ
የዘላለም ንጉስ ወዶኝ 
በልጁ ልጅ ስላረገኝ
እንደ ልዕልት ሚያራምደኝ 
በራሴ ዘውድ ያኖረልኝ
በእሾህ ጉንጉን ጎሎጎታ
ያየሁት ነው የእኔ ዓሌንታ
         
ማደሪያህ ይባረክ(x2)
አቤቱ ልዑሉ ተባረክ
ማደሪያህ ይባረክ(x2)
አቤቱ ምስጉን ነህ ተባረክ
'''
                      }),
                  Song(
                      name: 'እዳዬን ተሸክመህ',
                      videoURL:
                          'https://youtu.be/yji9Z8YNOpE?si=mJluQOG-JC99-ucA',
                      songLyrics: {
                        'lyrics': '''
እዳዬን ተሸክመህ ወንጀለኛ ተብለህ
ከአመፀኛ ተቆጥረህ በችንካር ተቸንክረህ
ያየሁህ በመስቀል ያዳንከኝ በመስቀል
ኢየሱስ ከፍ ከፍ በል7
 ይገርመኛል ፍቅርህ ያ ብርቱ ትዕግስትህ
 ስጋ የሆንከው ቃል ያዳንከኝ በመስቀል

 አለምን ብዞራት ብወጣ ዳርቻ
 እውነተኛ ወዳጅ መድሃኒአለም ብቻ
 በደምህ ማህተም ገባሁ ከገነት
 ነጋ ጨለማዬ የነፍሴ ሌሊት

ያልተማረውን ሰው ጌታ ወዳጅ ካለ
ጥበበኛ የታል መርማሪስ የታለ
በስብከት ሞኝነት ስለመነች ነፍሴ
ኢየሱስ  ሆንክልኝ ክብርና ሞገሴ

ሊቀ ካህናቱ ሁሌም አምንሃለሁ
ሰው ልታረገኝ ሰው ሆነህ ስላየሁ
ምስክርህ ልሁን ሳልፈራ በአለም
አክሊሌ ነህና ለእኔ ዘላለም
'''
                      }),
                  Song(
                      name: 'አባትነት',
                      videoURL:
                          'https://youtu.be/V9fsgnF9TsI?si=3A_4XgDO3wo7UDEf',
                      songLyrics: {
                        'lyrics': '''
አባትነት ሁሉ ከሚሰየምበት ከአብ ፊት እንበረከካለሁ
በልጁ ለሚያየኝ የልቤን አስታውቀዋለሁ

ንፋስን መጎሰም አይሆንም ልፋቴ
ለአባትነት ጥጉ ነውና ጩኸቴ
በእንባ ብንበረከክ በሳቅ እነሳለሁ
አይጨክንም በኔ አብን አውቀዋለሁ

ቅርብ ነው የምለው መሐሉ ታይቶኝ ነው
እኔና እርሱ መሐል ያለው ኢየሱስ ነው
ለዚህ ነው ሚሰማኝ በልጁ ቀርቤ
ታይቼ ነው ፊቱ በበጉ ተውቤ

የአለም ዝና ስልጣን ሠላምን አይሰጥም
የቱም የተስፋ ቃል አብ ካለው አይበልጥም
ከአንድ ልጁ በላይ ምን አለ ስጦታ
ለዚህ ነው ማዜመው ለክብሩ ዉለታ

መንግስቱን ነውና ለኔ ያሰበልኝ
እደርሳለሁ ቀድሞ ወዳዘጋጀልኝ
እኔን በክርስቶስ ይጠቀልለኛል
ያለ መጋረጃ በልጁ ያየኛል
'''
                      }),
                  Song(
                      name: 'ምራኝ መንፈስቅዱስ',
                      videoURL:
                          'https://youtu.be/D0YYmijGj44?si=zQSbfVchECnYGVfw',
                      songLyrics: {
                        'lyrics': '''
ምራኝ መንፈስቅዱስ(x2)
ምራኝ መምህሬ
በስጋ እንዳልፈፅም(x2) በመንፈስ ጀምሬ
ናልኝ የኔ አፅናኝ(x2) ለልቤ ተናገር
ታላቁን ውብ ጥበብ የሠማዩን(x2) ነገር

ካሰብኩበት ልቅር ካሰብከው አኑረኝ
ልጁን እገልጥ ዘንድ ጥበብ አስተምረኝ
አፍጥነኝ ወደ እውነት እርሱ ነው ስፍራዬ
ዜማ ይሁን ግብሬ ቃል ይሁን ስራዬ

ያለ ስምሪትህ ወዴትም አልውጣ
የእውነት መንፈስ ካንተ ፈቃድ እስኪወጣ
ብዙ ቀን ሳልሰማህ እንዲሁ ጮኬአለሁ
አሁን ግን እዘዘኝ ምሪትህን እሻለሁ

ክብሬን አይንጠቀኝ እውነት መሳይ ሀሰት
ዋናዬን አልጣ በሀጢአት ስደሰት
ልቤን ተቆጣጠር በስርህ አኑራት
እኔነት ፀጥ ይበል ማንነቴን ስራት

ማስተዋል ትጋርደኝ ልታመን በፊትህ
በሙላት አስወጣኝ ወደ ሠገነትህ
አሁን ሀይልህ ይንካኝ በድፍረት ልናገር
አንተ ያስረዳኸኝን የኢየሱስን ነገር
'''
                      }),
                  Song(
                      name: 'ያለኝ እግዚአብሔር ነው',
                      videoURL:
                          'https://youtu.be/tLNbKALg8S4?si=FSn7C_XJzNfNQHja',
                      songLyrics: {
                        'lyrics': '''
ያለኝ እግዚአብሔር ነው
ያለኝ ኢየሱስ ነው
አባቴ ጌታ ነው 
አባቴ ንጉስ ነው
ይሄን ነው የማውቀው(x2)
በደም ተሳስረናል ላይለቀኝ ላለቀው

የደሙን ቀለበት አስሮታል ጣቴ
ሙሽራዬ ኢየሱስ ራስ ነው ለቤቴ
ሌላ ውድ የለኝም ብቻውን ማርኮኛል
የፍቅሩን ዳርቻ ሞቶ አሳይቶኛል

ይሄን ነው የማውቀው(x2)
በደም ተሳስረናል ላይለቀኝ ላለቀው

የክስ መዝገቤን የእዳዬን ዶሴ 
አቀለጠው ደምህ ተለቀቀች ነፍሴ
አሁን ከድቅድቁ ነፃ ወጥቻለሁ
የአርነት ሠንደቄን አውለበልባለሁ

ይሄን ነው የማውቀው(x2)
በደም ተሳስረናል ላይለቀኝ ላለቀው

ያለኝ የምወርሰው የልጅነት ርስቴ
የናዝሬቱ መልካም መልኬ ነው ውበቴ
ሞቴን የሞተ በግ ጣፋጩ ፍሪዳ
ለመሸባት ነፍሴ ሆኗታል ማለዳ

ይሄን ነው የማውቀው(x2)
በደም ተሳስረናል ላይለቀኝ ላለቀው

ማያ መታያዬ የሰላሜ ጮራ
መርሻ ማስረሻዬ ያን ክፉ መከራ
ሀሴቴ ክርስቶስ የፊቴ ፈገግታ
እርሱ ነው አባቴ እርሱ የኔ ጌታ

ይሄን ነው የማውቀው(x2)
በደም ተሳስረናል ላይለቀኝ ላለቀው
'''
                      }),
                  Song(
                      name: 'ና ይሉሀል',
                      videoURL:
                          'https://youtu.be/7QQbSiRIr5c?si=tt2oqrudgEjCdUVf',
                      songLyrics: {
                        'lyrics': '''
ና ይሉሀል መንፈሱና ሙሽራይቱ
ና ይሉሀል መምጣትህን የናፈቁቱ
ና ኢየሱስ የክብር ጌታ
አሜን ንገስ ማራናታ

የክፋት ርኩሰት ቅዱስ ስፍራ ቆሟል
ሀሰት እግሯ ፀንቶ እውነተኛው ደክሟል
የበለአም ትምህርት ዘልቆ ገብቷልና
ለሙሽራይቱ ኢየሱስ ቶሎ ና

አለም የምትፈርደው ለደም አፍሳሹ ነው
የሚወደድባት ከሳሽ ከሳሹ ነው
የታመንከው ዳኛ የእኛ ለእኛ ናልን
እውነታችን ጌታ መጥተህ ፍረድልን

ወንድማማች መሐል መዋደድ ቀዝቅዛ
በአጵሎስ በኬፋ መከፋፈል በዛ
ሁሉም ሰው ይሄዳል በገዛ መንገዱ
መጥተህ አሳርፈን ጌታ ኢየሱስ አንዱ

አለም በደም ታጥባ በኩራት ዘፈነች
በስምህ ሲቀለድ ሙሽራህ አዘነች
የቤተክርስቲያን ደስታዋ ተገለጥ
አብራላት ፀሀይዋ በሐሴት ትለወጥ
'''
                      }),
                ]),
            Albums(
                name: 'ነጠላ ዝማሬዎች',
                photo: collection,
                realeasedDate: DateTime.now(),
                albumNumber: 03,
                songs: [
                  Song(
                      name: 'አምሳል',
                      videoURL:
                          'https://youtu.be/zGX7Z_1MKK4?si=xtiPNtoxEn6qfLt0',
                      songLyrics: {
                        'lyrics': '''
አምሳል
አምሳል በሌለው አቻ በሌለው ፍቅር ወደድከኝ
ኢየሱስ በደምህ መፍሰስ በመገረፍህ ቁስል ፈወስከኝ

ቅጥቅጥ ሸንበቆን የማትሰብረው
የሚጤስ ጧፍን የማታጠፋው
ትሑት ኢየሱስ ንፁህ ጌታዬ
ፀሀዬ ፅድቄ አብ ፊት መውጫዬ
   ስላገኘኸኝ ተገኘሁ እንጂ 
   ችንካር አልፎበት የብርሀን እጅህ
   ስትወድ እንዲሁ ስትምር በፀጋ
   ነፍስህን የሰጠህ ለነፍሴ ዋጋ

ሞትህ ዘንጌ ነው ከሞት ቀስቃሼ
ደምህ ሚያነፃ ቀዳሽ ፈዋሼ
አዘንብለሀል በኮረብታው ላይ
በመራቆትህ ደምቄ እንድታይ
    ብር ወርቅም ከንቱ እንቁስ ምንድን ነው
   የተገዛሁት በክቡር ደም ነው
   ልሩጥ ላውጀው ይሄንን ማዳን
   ዋስ እንደሆንከኝ በሚሻል ኪዳን

በሞት ጥላ ሀገር ድቅድቅ ዙሪያዬ
ህግ ያጎበጠኝ መርገም በላዬ
የሚደነቀው ብርሃንህ መታኝ
ያንተ መታሠር ከእስራት ፈታኝ
   እንዴት ልከልክል አይኖቼን ከእንባ
   ፊቴ ተስሎ ገፅህ አባባ
   ባልተነገረ በአዲስ መወድስ
   ትዘምር ክብሬ ለክብርህ ትፍሰስ
ከወረስከኝ ጋር ተሰውሬአለሁ
ገነቴ ኢየሱስ ባንተ እኖራለሁ
ከቤዠኸኝ ጋር ተሰውሬአለሁ
ዘላለሜ ሆይ ባንተ እኖራለሁ

አንተን አንተን ይላል ደጋግሞ አንተን
ይጠማሀል ውስጤ በለሊት በቀን
አንተን አንተን ይላል መላልሶ አንተን
ቀምሶህ ልቤ መንፈስህ ዳስሶት አሜን
'''
                      }),
                  Song(
                      name: 'አይበቃህም ወይ',
                      videoURL:
                          'https://youtu.be/dmRwuL7jr0A?si=4TO96cfts--k2Y43',
                      songLyrics: {
                        'lyrics': '''
ምህረትህ እድሜው ስንት ነው
ይቅርታህስ መቼ ያበቃል
አትባልም አትባልም   (x2)
እንደ ዘላለምህ 
እንደማያልቁት አመታትህ
እንደማያረጅ ማንነትህ 
እንዲሁ ነው ፍቅርህ
እንዲህ ነው ምህረትህ

ጥንት የለው መውደድህ አንተ ጥንተ የለህም
ይቅርታህ ሲያበቃ ሲነጥፍ አላውቅም
ሁሉ ማረኝ ይላል እልፍ አእላፍ በፊትህ
አትደክም አይበዛብህ ፍቅር አይታክትህ

አይበቃህም ወይ ምህረት ማድረግ
አይሞላም ወይ ስፍራህ አይባል ሀገርህ
እንደ ዘላለምህ አያበቃም ፍቅርህ

የቸርነት ምንጭ ሆይ የማትጨረሰው
ባህርይህ ምህረት ካንተ ነው ሚፈሰው
ስለ ማይቀየር መልክህ ደምግባትህ
ልጅን እስከ መስጠት ሆኗል ደግነትህ

አይበቃህም ወይ ምህረት ማድረግ
መንግስትህ ይጠባል ለዚህ ሁሉ ፍጥረት
ላይባል ሰፊ ነው የቀኝህ ቸርነት


በጎነት ይፈልቃል ከታማኝነትህ
ፀጋ እና እውነት ነው ሚዛኑ የመንግስትህ
እንዲሁ ስትምር ቃልህ አልተሻረ
ፅድቅህ በፅድቅ ነው እንደተከበረ

አይበቃህም ወይ ምህረት ማድረግ
የማይባልልህ የማይጠቁር ፊትህ
ለሀጢአተኛ የሚሆን አያልቅም ትእግስትህ

አይበቃህም ወይ ምህረት ማድረግ
አያልቅብህም ወይ አይባል ይቅርታህ
ልክ እንደ ክብርህ ነው አይነጥፍም ስጦታህ

ጥንት የሌለው መውደድህ
ወትሮም አንተ ጥንት የለህ
ማያበቃ ማይቆም ፍቅር
ምህረት አለ የሚል ይቅር
'''
                      }),
                  Song(
                      name: 'ከቦናል',
                      videoURL:
                          'https://youtu.be/i3GHEiEM-vY?si=xL_av9vHpyNYb68J',
                      songLyrics: {
                        'lyrics': '''
ከቦናል የክብርህ ደመና
ተሞላን ለስምህ ምስጋና
ተገባህ ማህተሙን ልትፈታ
በእርግጥም ኢየሱስ ነህ ጌታ

የምድሩን ለምድሩ ትተን በሰማይ ነን
በመስቀል ታዳጊው ደምህ የቀደሰን
ከታላቅ መከራ ወጥተን በመከራህ
ወደ አብ አድርሶን ኢየሱስ ታላቅ ስራህ

ታቦር ሆኖልሀል ልባችን ተገልጦ
ግርማህ አጥለቅልቆት በሞገስህ ቀልጦ
በእርሱ ደስ የሚለኝ ብሎ ሲያስገመግም
በክብርህ ትኩሳት ነፍስ አልቀረልህም

የሰማይ መናወጥ የምድር ላይ ዋይታ
ማባራት የሌለው ምጥና ሁካታ
ምዕራፉን ያገኛል ስትመጣ ልዑሉ
በደመና ሆነህ ኢየሱስ ሀያሉ

የክብሩ ነፀብራቅ የባህርዩ ተምሳሌት
አብን የተረከው የመውደዱ ልኬት
በኩራችን ልንመስልህ ተወስኖልናል
በአንተ ተሰውረን በቀኙ ነግሰናል
'''
                      }),
                  Song(
                      name: 'ትናፍቀኛለህ',
                      videoURL:
                          'https://youtu.be/hLU2XuCbHoo?si=-KS12OLxOGnNuKC3',
                      songLyrics: {
                        'lyrics': '''
ትናፍቀኛለህ ኢየሱስ ትናፍቀኛለህ
ናፍቆቴ ትናፍቀኛለህ  
በልቤም ሆነህ  በቀኝህም ሆኜ ትናፍቀኛለህ  
እስክትመጣልኝ  ባይኔ እስከማይህ ትናፍቀኛለህ
            
ቡሩኩ ተስፋዬ የምጠባበቅህ
ዓይኔ ወደ ላይ ነች አለው ስናፍቅህ
የላክልኝ መንፈስ አንተን ያሰኘኛል
እየጠራሁትም ስምህ ይርበኛል
ኦ! ስምህ ይርበኛል(X4) 
ኢየሱስ ስምህ ይጠማኛል

ተጠማዉህና ና ሆኗል ስራዬ
መኖሪያዬ አንተን ናፈቅኩህ ስፍራዬ
ካንተ ጋር ለመኖር ላይህ ጓጉቻለሁ
ከጉያህ ልገባ ላገኝህ ሽቻለሁ
ኦ! ላገኝህ ሽቻለሁ(X4)
ላይህ ናፍቄለሁ
ኢየሱስ ላገኝህ ሽቻለሁ

በቶሎ እመጣለሁ ስላልከኝ ጠበኩህ
ታማኝነትህን ቀድሞ ስላወኩህ
ናፍቀኸኝ ነው እንጂ አትቀርም አውቃለሁ
አሜኔ ኢየሱስ እጠብቅሃለው
ኦ! እጠብቅሃለው(X4) 
ኢየሱስ እጠብቅሃለው
      
እንድነግስ አብሬህ ቀን ስለቀጠርከኝ
ሰማይ ሰማይ አየሁ ሙሽራው ናፈቅከኝ
በልማድ አይደለም ኢየሱስ የምለው
ሳዜምህ ስሰብክህ ስለምረካ ነው
ኦ! ስለምረካ ነው(X4)
ኢየሱስ ስለምረካ ነው
'''
                      }),
                  Song(name: 'አሁን ማን ያምናል', videoURL: '', songLyrics: {
                    'lyrics': '''
አሁን ማን ያምናል አልልም የእጅህን ስራ ሳወራ
ሁሉን ስትችል አውቃለሁ ምስክርህ ነኝ ማልፈራ

አትችልም የሚልህ ማነው በአፉ ስንፍናን ሚናገር
የቱ ነው ለአንተ ያልታዘዘ በሰማይና በምድር
በአውሎ በወጀብ መካከል ባለ መንገድ ነህ ወዳጄ
ምህረትህ አይቆም በዘመን ዛሬም ስላለህ በደጄ

አይኔ ላየችው ማዳንህ ብዘምር አንስቼ እጄን
በድንጋይ ዝም ሊያሰኙኝ ጌታዬ አንተን ካጅ አሉኝ
ባያውቁህ ባይገባቸው ነው የዋልክልኝን ውለታ
ከጨለማው ውስጥ አውጥተህ እንደሆንክልኝ ከፍታ

ጥማትህ ውሃ አይደለም በቀትር ወደ እኔ ያመጣህ
ምክንያትህ እኔ ነበርኩኝ አሳድዶ ያገኝኝ ፍቅርህ
ልውረድ ወደ መንደሬ ላውጅ ስላንተ ክብር
የአለም መድሀኒት ነህና ታሪክን የምትቀይር
'''
                  }),
                  Song(name: 'ቢታመኑብህ', videoURL: '', songLyrics: {
                    'lyrics': '''
ቢደገፉብህ የማትዝል
ቢታመኑብህ የማትከዳ(x2)
ነፍሴ ናፈቀችህ ምህረትህን ወዳ

የረድኤት መዝገብ የውስጤ ሠላም
አረፍኩብህ ጌታ ክንድህም አይዝልም
ጭንቄን ረሳሁብ ባለውለታዬ
እንዴት ዝም እላለሁ ካንተ ተቀብዬ(x2)

በእረፍት ውሃ በለመለመው መስክ
ወስደህ አሳረፍከኝ አባቴ የእኔ አምላክ
ምን ጎድሎብኝ ያውቃል አንተን ተስፋ አድርጌ
ለዚህ ክብር በቃሁ ሆነኸኝ ማዕረጌ(x2)

በእምነት ጌታዬ ስንቱን አገዝከኝ 
ከፊት እየቀደምክ እየረዳኸኝ
ሞቴንም ለወጥከው በሕይወት አዋጅ
አምላኬ ብቻ ነው የነፍሴ ወዳጅ(x2)

አልፎልኛል ዛሬ ስትጎበኘኝ ጌታ
ዘመን የፈጀውን ሕልሜን ስትፈታ
ቀን አይተህ አልተውከኝ እንዲሁ ወደድከኝ
ምን አለኝ ምን ልስጥህ እኔ ባዶ እኮ ነኝ(x2)

'''
                  }),
                ])
          ]),
      Singer(
          name: 'ዘማሪት ፍቅርተ ፈለቀ',
          photo: GSFikirte,
          singerId: 's-03',
          albums: [
            Albums(
                name: 'ጥያቄ የለኝም',
                photo: tyake,
                realeasedDate: DateTime.now(),
                albumNumber: 03,
                songs: [
                  Song(
                      name: 'በአባቱ የተወደደ',
                      videoURL:
                          'https://youtu.be/gelzhaEg5mk?si=4D77fRE2xobbU7T3',
                      songLyrics: {
                        'lyrics': '''
በአባቱ የተወደደ
በፍቅር የተገደደ
ተገፎ ልብሴ ቆሞ እረኛዬ
ታርዶ ምግቤ ነው ሞቶ ዳኛዬ

እረኛው በግ ሆኖ በጉ ደግሞ እረኛ
በላሁት ሲርበኝ ጠበቀኝ ሳይተኛ
መሰማሪያዬ እርሱ ደግሞ መግቢያ በሬ
የአባቱ አንድያ ልጅ እርሱ ነው ሀገሬ

ነጩ በግ ታርዶልኝ ለብሼው ሞቆኛል
ከእንግዲ የአይሁድ እሳት ለምኔ ይሆነኛል
በልቼው እራቴን ተኛሁ ተንተርሼው
የዘላለሜ ነው ኖራለሁ ወርሼው

መቃኔን አይደፍርም ሞት ይሸሻል አይቶ
ጉበኔን አይነካም ደሙን ተመልክቶ
ሀጢአት የሚያስወግድ ስላለልኝ በጉ
የኔ ነው ከፍታው የኔ ነው ማዕረጉ

የመዓዛ ሽታ ራሱን አርጎልኛል
የኘፍሴ መስዋዕት ፈልጎ አግኝቶኛል
ሊገለጥ ላለው ክብር ነፍሴን አዘጋጃት
የእግዚአብሔር ቅዱስ በግ አንዴ ስለዋጃት
'''
                      }),
                  Song(
                      name: 'እኔ ተኝቻለሁ',
                      videoURL:
                          'https://youtu.be/_-Q9U8UEXxk?si=ZqCS-Kug7JkFw4ke',
                      songLyrics: {
                        'lyrics': '''
እኔ ተኝቻለሁ ልቤ ግን ነቅቷል(x2) 
የውዴ ቃል ነው በሬን ይመታል
ይከተለኛል በባዕድ ሀገር
አቤት ኢየሱስ የፍቅር ማገር

ልቤ ታውኳል እጁን አይቼ
ተንሰፈሰፍኩኝ ድምፁን ሰምቼ
ከመዳፉ ላይ ፍቅር ያስነበበኝ
ባሰብኩት ጊዜ እንባዬ አጠበኝ

ሳልሄድ ወደ እርሱ መጥቷል ወደ እኔ 
ንጉስ ባርያው ደጅ ቆሞ አየች አይኔ
ለፍቅሬ ታሞ እርሱ ጎስቁሏል
ሰላሜን ሰርቶ ጭንቄን አስጥሏል

ከእልፍ ምርጥ ነው መርጦ የጠራኝ
የሽቱ እርከኔ በእጁ የሰራኝ
ከእናቴ እልፍኝ አስገባዋለሁ
አሁን በልቤ እሾመዋለሁ 

አልከፍትም ያልኩት በልጦብኝ ክብሬ
የኔ ሙሽራ ቆሟል ከበሬ
ውዴ ያንኳኳል እራቴ ለራት
የነፍሴ ብርሃን የልቤ መብራት
'''
                      }),
                  Song(
                      name: 'ኢየሱስ አንተ ማለት ለእኔ ',
                      videoURL:
                          'https://youtu.be/sAEzPh6VyFI?si=RTtTP6ArDTfmfJ04',
                      songLyrics: {
                        'lyrics': '''
ኢየሱስ(x4)
አንተ ማለት ለእኔ 
     ምን ማለት እንደሆንክ የማውቀው እኔ ነኝ
በደምህ የምኖር ነፍስህ ነፍስ የሆነኝ

እንደምን ዘረጋህ እጅህን
   በደም ለታጠቡ እጆቼ
ፍቅር ነህ አባባ ኢየሱስ
   ይሳሳሉ አይኖችህ ለአይኖቼ
  እኔን
 እኔን እኮ ነው የማርከው(x2)

በማዕረግ ከብዷል ትከሻዬ
    ሹመቴን አብዝተህ ደስታዬን
ከበኩራት ማህበር አረከው
    የእኔን እድል ፈንታ ቦታዬን
  እኔን
  እኔን እኮ ነው የማርከው(x2)

ውስጤ ነህ አባባ ኢየሱስ
   የቀመስኩህ ጣፋጭ ወለላ
ነፍሴ ላይ ምህረት ፅፈሀል
   እንዳልሆን አድርገህ የሌላ
  እኔን
  እኔን እኮ ነው የማርከው(x2)

ለራሴም እንኳን ይገርመኛል
   ያረከውን ሳስብ በሕይወቴ
ይቅርታህ ማቀርቀሬን ሽሮት
   ቀና አልኩልህ ይኸው አባቴ
  እኔን
  እኔን እኮ ነው የማርከው(x2)
'''
                      }),
                  Song(
                      name: 'መንፈስ ቅዱስ',
                      videoURL:
                          'https://youtu.be/ZhHAvV3QiFE?si=uuP_EOxFcLqSJfCY',
                      songLyrics: {
                        'lyrics': '''
አስተምረኝ አንተን መፍራት
ጨምርልኝ ፍቅርና እምነት
አመላልሰኝ በትሕትና 
መንፈስ ቅዱስ ሀይል ነህና

አደራህን ዝም እንዳትለኝ
በራሴ ስር እንዳትጥለኝ
ካልቀደምከኝ ከሌለህ ልቅር
ሰላሜ ሆይ የልቤ ፍቅር
  ይቅርብኝ ደስታው ይቅርብኝ
  በሕይወቴ ካልነገስክብኝ
  ትቅርብኝ ሳቄ ትቅርብኝ
  በነፍሴ ካልታየህብኝ

አሳ ቢሆን ያለ ውሃ አይኖርም
እኔ ያላንተ ዛሬን አላድርም
እስትንፋሴ እንዳትርቀኝ
ትቼህ ሲያየኝ ሞት እንዳያንቀኝ
  ይቅርብኝ ደስታው ይቅርብኝ
  በሕይወቴ ካልነገስክብኝ
  ትቅርብኝ ሳቄ ትቅርብኝ
  በነፍሴ ካልታየህብኝ

የፈለግሁት አሁን አይምጣ
ሚያስፈልገኝ ካንተ እስኪመጣ
ያላየኸው ነገ አይታየኝ
የማይጠቅም ሐሴት ይለየኝ
  ይቅርብኝ ደስታው ይቅርብኝ
  በሕይወቴ ካልነገስክብኝ
  ትቅርብኝ ሳቄ ትቅርብኝ
  በነፍሴ ካልታየህብኝ

ያልቀመሱህ ተይው ይሉኛል
እኔ ያላንተ መች ያምርብኛል
ምን ተስፋ አለኝ ከሕይወቴ እርቄ
ሞት አልገዛም ከአለም ታርቄ
  ይቅርብኝ ደስታው ይቅርብኝ
  በሕይወቴ ካልነገስክብኝ
  ትቅርብኝ ሳቄ ትቅርብኝ
  በነፍሴ ካልታየህብኝ
'''
                      }),
                  Song(
                      name: 'ስሙ የሚምር',
                      videoURL:
                          'https://youtu.be/vdX1y7Gh1As?si=MpoOQlcQ_OQ9TDtS',
                      songLyrics: {
                        'lyrics': '''
የሚያምር ስሙ የሚያምር
የሚምር በደሙ የሚምር
አባት አለኝ አባት አለኝ በላይ በሰማይ
ኢየሱስ ቀድሟል ሞትን እንዳላይ

የኔን ድካም ደክሞልኛል
ሊራራልኝ ተዛምዶኛል
አባት አለኝ በዙፋኑ
የፀና ነው ቃልኪዳኑ

ዋስትናዬን እንኳን ያዝኩት
አውቄው ነው ያመለኩት
እርስቴ ነው ይሄ ፍቅር
ደም አፍስሶ ያለኝ ይቅር

በሰማያት ያለፈልኝ
በአባቱ ፊት የታየልኝ
የኔ ምለው አለኝ እኔ
ጌታ ኢየሱስ አዲስ ቅኔ

ዋስትናዬን እንኳን ያዝኩት
አውቄው ነው ያመለኩት
እርስቴ ነው ይሄ ፍቅር
ደም አፍስሶ ያለኝ ይቅር

ከማይጠፋው ሆኗል ዘሬ
በሰማይ ነው ዛሬ አገሬ
ልጅ ነኝ እንጂ ባሪያ አይደለሁ
ካሰበልኝ እገባለሁ

ዋስትናዬን እንኳን ያዝኩት
አውቄው ነው ያመለኩት
እርስቴ ነው ይሄ ፍቅር
ደም አፍስሶ ያለኝ ይቅር

ከሲኦል ደጅ የለኝ ፈንታ 
ገነቴ ነው የኔ ጌታ
ሞት እንዳላይ ሞቶልኛል
ታዲያ የቱ ያሰጋኛል

ዋስትናዬን እንኳን ያዝኩት
አውቄው ነው ያመለኩት
እርስቴ ነው ይሄ ፍቅር
ደም አፍስሶ ያለኝ ይቅር
'''
                      }),
                  Song(
                      name: 'ጥያቄ የለኝም',
                      videoURL:
                          'https://youtu.be/Ck3uZvkie-s?si=RTiB-hrpqClpHxAk',
                      songLyrics: {
                        'lyrics': '''
ጥያቄ የለኝም(x3) መልስ ሆነህ መጥተሀል(x2)
የእንቆቅልሼ ፍች መስቀል ላይ ተገኝቷል
በኢየሱስ ስም ማለት አፌን በድል ሞልቷል

አላፊ ብሶቴን በዜማ አላቀርብም
እንጉርጉሮ ይዤ በፊትህ አልቀርብም
ባነባ ደስታ ነው የሚፈነቅለኝ
እጅህ እንዴት አርጎ እንደተቀበለኝ

እንኳን አሁን በለስ አፍርታ
በርሃቤም ታላቅ ነህ ጌታ
እንኳን አሁን ሞልቶኝ እልልታ
በሀዘኔም ታላቅ ነህ ጌታ

አንተ ነህ ምትነግረኝ የሚያስፈልገኝን
ልኬን ታውቀዋለህ ለእኔ ሚሆነኝን
ቁልፉ ደምህ ፈሶ የለም ያልተፈታ
መልሴ አግኝቼሀለሁ ክበር የኔ ጌታ

እንኳን አሁን በለስ አፍርታ
በርሃቤም ታላቅ ነህ ጌታ
እንኳን አሁን ሞልቶኝ እልልታ
በሀዘኔም ታላቅ ነህ ጌታ

ምግብ አልል ምግቤ ነህ በፍታም ሆነኸኛል
ደስታ ላይ ልቦርቅ አሰማርተኸኛል
ለእልልታዬ ምክንያት በቂ ነው መዳኔ
የማይቆም ዝማሬ ለመልሴ አለኝ ቅኔ

እንኳን አሁን በለስ አፍርታ
በርሃቤም ታላቅ ነህ ጌታ
እንኳን አሁን ሞልቶኝ እልልታ
በሀዘኔም ታላቅ ነህ ጌታ


ክርክር አልሻም ተገኝቷል እውነቴ
ቀና ብያለሁኝ ወደ ጉልላቴ
ለመዳን ባልሆነው ጉንጬን አላለፋም
ፈቅጃለሁ ፍቅርህ በልቤ እንዲፋፋም

እንኳን አሁን በለስ አፍርታ
በርሃቤም ታላቅ ነህ ጌታ
እንኳን አሁን ሞልቶኝ እልልታ
በሀዘኔም ታላቅ ነህ ጌታ
'''
                      }),
                  Song(
                      name: 'ያደርገዋል',
                      videoURL:
                          'https://youtu.be/pgSgLCpuOI8?si=WnFAGlHjYiVBEDQ7',
                      songLyrics: {
                        'lyrics': '''
ያደርገዋል እግዚአብሔር ያደርገዋል
ያደርገዋል የኛ ጌታ ምን ይሳነዋል

ያዕቆብ አድምጥ እስራኤል ስማ
ከግብፅ የወጣህ በታላቅ ግርማ
በባህሩ ፊት እጅህን ዘርጋ
ላንተ መንገድ ነው የተዘረጋ

ፈርኦን ይሰጥማል ከነ ሠረገላው
ይከድነዋል ውሃው 
ዳግመኛ ላታየው 
ያደርገዋል


የምታለቅሱ በድንኳናችሁ
ማርታና ማርያም መጥቷል ጌታችሁ
አልዓዛር የት ነው የተቀበረው
ይፈልገዋል ጌታ ሊጠራው

አልዓዛር አልዓዛር 
ውጣ ከመቃብር
ሞት ይደነግጣል ኢየሱስ ሲናገር
ያደርገዋል

አለቀ ወይኑ የሰርግ ቤቱ
እርሱን አድምጡት አለች እናቱ
ኢየሱስ አለ ቀድታችሁ ስጡ
መልካሙ ሞልቷል አትናወጡ

ጌታ ያለበት ቤት መች ይጎድልበታል
በጭንቀቱ ሰአት ክብሩን ያይበታል
ያደርገዋል

ብዙ ነው ሰልፉ የሰው ሕይወት
መጉደል መጎሰም የሞላበት 
ቢሆንም ያልፋል ከጌታ ጋር
አለ መሻገር በእጆቹ ስራ

እናም ይቻለዋል ልቡን ላበረታ
የሰው እንቆቅልሽ ቀላል ነው ለጌታ
ያደርገዋል
'''
                      }),
                  Song(
                      name: 'ለመዳን',
                      videoURL:
                          'https://youtu.be/xsvDRQUxIs8?si=mQFVb0WXd4llmPdP',
                      songLyrics: {
                        'lyrics': '''
ለመዳን ለመዳን ለመዳን አይደለም 
  ስላዳነኝ ነው የምከተለው
ለመፅደቅ ለመፅደቅ ለመፅደቅ አይደለም
  ደሙ አፅድቆኝ ነው ዳንኩኝ የምለው
ውለታ ላስቆጥር አይደለም ትጋቴ
ውለታው ማርኮኝ ነው ለእርሱ መለየቴ

ለተቋጨ መዳን ድካም አልገነባም
የራስ ፅድቄን ላቆም ወደ ሌላ አልገባም
የቆመ ፅድቅ አለኝ የተከናወነ
ለሁሉ የሚተርፍ በልጁ ላመነ

በደም የተፃፈ ደማቅ ነው መዳኔ
ንጉስ አልጠራኝም ለሞት ለኩነኔ
የተረጋገጠ ማህተም ይዣለሁ
ቢሆን ባይሆን የሚል ስጋቴን ትቻለሁ

ቢከፈለኝ እንኳን ከንቱ ዋጋ አልከፍልም
የተከፈለውን ደም አላጣጥልም
የዳነ ሰው ኑሮ መኖር ነው ናፍቆቴ
ላፀደቀኝ ጻድቅ ታምና እኔነቴ

ያዳነኝን ትቼ ወደ ኋላ አልሄድም
ቋንቋዬ የልጅ ነው በከንቱ አልነጉድም
እንድሞት አልሞትም ልቀር እንደ ዋዛ
ለእኔ ነው ያ ድካም ይህ ነው የእኔ ቤዛ
'''
                      }),
                  Song(
                      name: 'ታሪኬ',
                      videoURL:
                          'https://youtu.be/AJm6cYf_Lto?si=1tIRO6vduEMDrfq2',
                      songLyrics: {
                        'lyrics': '''
ታሪኬ ኢየሱስ ታሪኬ
ታሪኬ እግዚአብሔር ታሪኬ
እኔማ ምን አለኝ የሚወራ ነገር
አንተው ታወጅልኝ ብቻህን ተነገር

የኔ ታሪክማ የቱ ያምራልና
ምን በጎ ሰርቼ ሊወራልኝ ዝና
ፅድቄ አንተ ነህ እንጂ ምን ፅድቅ አለኝ እኔ
ማለዳዬ ኢየሱስ አዲሱ ኪዳኔ
  
ደምህ ሸፍኖልኝ የነፍሴን ገመና
ዛሬዬን ሰርተሀት ቃኘኸኝ ምስጋና

መዝገቤ ክፉ ነው ጠላቴ ቢገልጠው
ቀድመህ አግኝተኸኝ አንተ ባትለውጠው
ስላገኘሁህ ነው ታሪኬ የጀመረው
እንዲህ ተከብሬ በስምህ ምኖረው

አዲስ ያደረከኝ የሕይወቴ አርነት
ሰላሜ አማኑኤል ያወኩህ አንድነት

ትዝታዬ አያልቅም ስለሌለኝ መልካም
የኔ ትናንትና አንዱም አያስመካም
ምረኸኝ ነው እንጂ በፊትህ መቆሜ
በሚያኮራው ስምህ ተሰይሞ ስሜ

ላንተ ነው ስራዬ ቆሜያለሁ ላውጅ
አባቴ ታሪኬ ያደረከኝ ልጅ

ሰው ቢሆን የሚያውቀው የጓዳዬን ነገር
ባትሸፍነኝ ውዴ ምን እሆነው ነበር
ተነበህ ከፊቴ ጉዴን ሰረዝክልኝ
የኔን ሳታይብኝ ለኔ ታየህልኝ

ክብሬ ነው ማውራቴ ያንተን ያንተንማ
ጌታ ጌታ ስልህ ምድር ሁሉ ትስማ
'''
                      }),
                  Song(
                      name: 'ከእግዚአብሔር ሌላ',
                      videoURL:
                          'https://youtu.be/s_SfE7d-ndc?si=REqF5pwV1AXEI8Co',
                      songLyrics: {
                        'lyrics': '''
ከእግዚአብሔር ሌላ እግዚአብሔር ማነው
የሰማያት ሰማይ የክብሩ ዙፋን ነው
የቀረበ ወዳጅ ደግሞ የተሰወረ
ከጊዜ እንኳን በፊት ቀድሞ የነበረ

በውኆች መካከል ጠፈርን አኑሯል
የአለምን መጠን እጁ ላይ ወስኗል
እንደ ጥቅል መፅሀፍ ሰማዩን ጠቅላዩ
ለእርሱ ይታዘዛል ምድርና ቀላዩ

በሸለቆ መሀል ምንጮች የከፈተ
ነፋሳትን ከአዜብ በቃል የጎተተ
ሰረገላው እሳት መሄጃው ደመና
በነፋስ ክንፍ ላይ ይጓጓዛልና

እልፍኙን በውሃ በጥበብ የሰራ
ታላላቅ ብርሃናት ብቻውን ያበራ
ጊዜን ሰርቷል እንጂ በጊዜ አይለካም
የሁልጊዜ ልክ የሁልጊዜ መልካም

በአፍንጫው እስትንፋስ ውሆች ተከመሩ
ሲያከብር ሲሞላ አይጎድልም ከክብሩ
እኔ ነኝ ያለው ነው ዛሬም በላይ ያለው
ጥንታዊም አዲስም መሰልቸት የሌለው
'''
                      }),
                  Song(
                      name: 'ይሄ ሁሉ ፍቅር',
                      videoURL:
                          'https://youtu.be/2Fdh2xeSIj4?si=609slSm2QobvOGKx',
                      songLyrics: {
                        'lyrics': '''
ይሄ ሁሉ ፍቅር ያንተ ነው ለካ
አየውህ ባንድያህ በልጅህ ትረካ
እግዚአብሔር አብ ያንተ ነው ለካ

በእቅፍህ ያለው ሁሉን ነገረኝ
የፍቅርህን ልክ እያስተማረኝ
መግባት ሆኖልኝ ስገባ አንተ አለህ
በልጅህ በኩል ትታየኛለህ

እንዴት ታምራለህ ፍቅር ነው ገፅህ
አይቼሃለሁ ልጅህ ሲገልፅህ
እንዴት ታምራለህ ውብ ነህ አባቴ
እድለኛ ነኝ አንተን ማየቴ

የሰጠኸኝ በኩር ታላቅ መፍትሄ
የራስህን ፍቅር ያስረዳል ይሄ
ላንተ ቃልህ ነው ለእኔ ሕይወቴ
አንተን ያሳየኝ መልካሙ እውቀቴ

ለካ ያንተ ነው ይሄ ውሳኔ
የልጅህን መልክ እንድመስል እኔ
ፀጋህ ሲገለጥ ተገለጥክልኝ
ቀድመህ ልጅነት ስላየህልኝ

በሲቃህ መሃል ይታያል ፍቅርህ
ባንዱ ጨክነህ እኔን ማፍቀርህ
አሁን ስፍራዬ በደም ሲለካ
ያየሁህ አብ ሆይ ቅርቤ ነህ ለካ
'''
                      }),
                  Song(
                      name: 'ጸሎቴን ያልከለከለ',
                      videoURL:
                          'https://youtu.be/lWTyrBjvr2o?si=kyP2TmdFY54klHte',
                      songLyrics: {
                        'lyrics': '''
ምሕረቱን ከኔ ያላራቀ ጸሎቴን ያልከለከለ
ለነፍሴ ሰላም ያረገ እንደ ጌታዬ ማን አለ

ተመስገን ተመስገን ስለው አይደለምና በፊደል
ትዕግስቱን አይቼዋለሁ በቤቱ እኔን ሲቀበል
ያጠፋ ያባከነ ሰው ብድሩ ቅጣት ነበረ
ምህረቱ ማዳኑን ጠግቦ በቤቱ ይኸው አደረ

በአይኖቹ ሁሌ ወደኔ በፍቅር ይመለከታል
ጠላቴን እንዲያሳፍረው መጠምጠሚያዬን ቀይሯል
የለኝም ክፉ ትዝታ አንድም ቀን ሳድር በቤቱ
እንደ ፍም በራሴ አለ ፍቅሩና ታዳጊነቱ

ሆኛለሁ የተወደደ ማህተሙ የታተመበት
አልፋለሁ የገነትን በር በደሙ ተከልዬበት
አምላኬ ስለሆነልኝ ክብሬና ሁለመናዬ
ለክብሩ ትሁን ሕይወቴ ጎጆና ሁለንተናዬ
'''
                      }),
                  Song(
                      name: 'ክብር ለታረደው በግ',
                      videoURL:
                          'https://youtu.be/uPDAnIP1Oeg?si=F87hEySkkFh36Ze0',
                      songLyrics: {
                        'lyrics': '''
ክብር ለታረደው በግ ክብር
ክብር ለተሰዋው በግ ክብር
ሰባት ከዋክብት በእጆቹ ላሉ ክብር
ቅጥሩን ላጠረው በነበልባሉ ክብር

ማህተሙን መፍታት ተችሏል ለእርሱ
እውነት ነውና በጉ ቅዱሱ
ካህናቶቹ ይሰግዱለታል
ፅድቅ የለበሱ ፃድቅ ይሉታል

ሁሉን ጠቅልሎ ለአባቱ ማርኳል
ገዳዩን ገድሎ ሞትን አውኳል
አጥፍቶት አንዴ የምድርን ለቅሶ
በዙፋኑ ላይ ይኖራል ነግሶ

ቅዱስ መዓዛው ምድርን ላወደው
በባህሩ ላይ ለሚራመደው
ለነፍስ መልሕቅ ለአንዱ ዋስትና
ክብር ለአማኑኤል ይገባልና

አለው ቀጠሮ ቶሎ ሊመጣ
የዋጃቸውን ነፃ ሊያወጣ
የወጉት ሁሉ ገና ያዩታል
የሚጠብቁት ክበር ይሉታል

ሁሉን ለስሙ ላንበረከከ
ድል ለሚነሳው እየማረከ
ለቅዱሱ አለት ለነፍስ እርካታ
ክብር ለኢየሱስ ክብር ለጌታ
'''
                      }),
                ]),
            Albums(
                name: 'ነጠላ ዝማሬዎች',
                photo: awaj,
                realeasedDate: DateTime.now(),
                albumNumber: 03,
                songs: [
                  Song(
                      name: 'መሐል መሆን ሲያምርብህ',
                      videoURL:
                          'https://youtu.be/kRionfcs1R8?si=zFq33BKqxwGcDI8B',
                      songLyrics: {
                        'lyrics': '''
ያ ሠንበር ለኔ ነበር 
   ለኔ ነበር
እኔና ጅራፉ መሐል ባትገባ
ጀርባህ በግርፋት ደምን ባያነባ
ያ ሠንበር ለኔ ነበር
    ለኔ ነበር

እንደ አሮን ያይደለ ሞት የማያሰጋው ማይለወጥ ክህነት
ከፍርድ የሚያስመልጥ ለፍርደኛ ሚሆን መካከለኝነት
አንተስ ያምርብሀል ደግሞም ተችሎሀል ቤዛነት ለነፍሴ
በሚሻል ተስፋ ቃል ለተሻለው ኪዳን የተሻልከው ዋሴ

መሐል መሆን ተችሎሀል
መሐል መሆን ተገብቶሀል
      (x2)

ከሩቅ አልቀረሁም ከተራራው ግርጌ
አልተከለከልኩም በደምህ ቀርቤ
ማስታወስ ተስኖት አይደለም አባትህ መርሳቱ ጥፋቴን
አንተ መሐል ገብተህ ባንተ ታይቼ ነው የተወው ስህተቴን

 መሐል መሆን ሲያምርብህ(x4)
         ያ ሠንበር ለኔ ነበር
               ለኔ ነበር
ሙሴ መሐል ገብቶ ድንቅ ተከናውኗል መናንም መግቧል
የሚበላ መና መሆን ግን አይችልም መናውም ያስርባል
አንተ እኮ እንጀራ ነህ በልተው ሚድኑብህ የሕይወት እንጀራ
በልቼ ተተከልኩ ተተክዬ ፀደቅሁ ፀድቄ ላፈራ

መሐል መሆን ተችሎሀል
መሐል መሆን ተገብቶሀል
    (x2)

ከሩቅ አልቀረሁም.....

ተጋድሞ አነበብኩት ሠንበርህ ያወራል ሀተታው ፍቅር ነው
ሞትና እኔ መሐል ደምቆ የተሰመረ መለያ ድንበር ነው
እኔ ላይ በነበር ጅራፉ ያለፈው ያ ሁሉ መከራ
ህመም የሚያስታውስ ጠባሳ ነው እንጂ ምህረት አያወራ

መሐል መሆን ተችሎሀል
መሐል መሆን ተገብቶሀል
    (x2)

ከሩቅ አልቀረሁም.....

በኔና በሞቴ መካከል ገብተህ ነው ሞት ላይ የፎከርኩት
ስላለሁ አይደለም ስላለህልኝ ነው በሕይወት ነኝ ያልኩት
ሠማይ የቀረበኝ ዝቅ ብሎ አይደለም ዝቅታህ ነው እንጂ
ገባሁ መእምነት ያልኩት መካከለኛዬ ቀድመህ ነው ወዳጄ
  
መሐል መሆን ሲያምርብህ(x4)
     
ከሩቅ አልቀረሁም ከተራራው ግርጌ
 አልተከለከልኩም በደምህ ቀርቤ
መታዘዝ ለጣለኝ ታዘህ ባታስጥለኝ
መብላት ላስባረረኝ በልቼህ ባይምረኝ
ባትቤዠኝ ኖሮ ባትገባ ምትኬ 
የሞት ዜና ነበር የዛሬው ታሪኬ

መሐል መሆን ተችሎሀል 
መሐል መሆን ተገብቶሀል
      (x2)
'''
                      }),
                  Song(
                      name: 'አምልኮ',
                      videoURL:
                          'https://youtu.be/tNXwGlkJmPY?si=q79JMqv724E75I3N',
                      songLyrics: {
                        'lyrics': '''
አምልኮ ክብር ይብዛልህ
ወድጄ ለማዜምልህ
በነፍሴ ባርክሀለሁ
ኢየሱስ እወድሃለሁ 

የተገባኸኝ ነህ ለማልገባው ሰው
ያንተ መታመም ነው ቁስሌን የፈወሰው
ርቀቱ አይታይም ያስመለጥከኝ ሀገር
ሰማይ አደረስከኝ በደምህ ስሻገር

አማናዊው ሙሴ
መራሂ ለነፍሴ
የሕይወቴ ጥፍጥና
ላብዛልህ ምስጋና

የሚታየው ነገር ባያምር ቢያምር
የምር እያየሁህ ኖራለሁ የምር
ፍቅር አጠገብከኝ ከመስቀል ገበታ
ሰላም እያዜምኩኝ አለሁ በደስታ

ጦር አልባው ባለ ድል
ቁስልህ ጤና ሚያድል
የፍቅር ማዕዴ
ክብር ይግባህ ውዴ

አንተን ለማመስገን ምክንያቴ ብዙ
ለመዝሙሬ ውበት መንፈስህ ነው ወዙ
ባንተው አመስግኜ ባንተ እቀበላለሁ
ስጦታዬ ኢየሱስ አመሰግናለሁ 

ቅዱሱ ነፍስ አድን
የማትደክመው መድህን
የአሁኑ እድሌ
የነገም አክሊሌ
የሰጠኸኝና የተውክልኝ በዝቶ
በአይኔ ገነፈለ ምስጋናዬ ሞልቶ
መባረክ መማረክ መንበርከክ በፊትህ
የወዳጅ መባ ነው ለወዳጅነትህ

ለጥቅም አትጠጋ
ለጥቅሜ የተወጋህ
በቀን የማትቀየር
ቀን አውጪዬ ክበር

በደምህ መተንፈስ የተቻላት ነፍሴ
ባርኮት አትረሳም ለስምህ ውዳሴ
ነፍስ አይቀርልኝም ነፍስህ ፊቴ ትፍሰስ
መንፈሴ ሰማይ ነው ባንተ ህያው መንፈስ

ማትበረዝ እውነት
ምትገኝ በእምነት
ያገኘኝ ፍቅርህ ነው
ጥጋቤ ክብርህ ነው
'''
                      }),
                  Song(
                      name: 'ንጉሥ ሆይ',
                      videoURL:
                          'https://youtu.be/tA-sJSnIOck?si=S8PuQ26DeWuLdpQm',
                      songLyrics: {
                        'lyrics': '''
ንጉሥ ሆይ
ሺህ አመት ንገስ የሚልህ ማነው
ሺህ አመት በፊትህ እንደ አንድ ቀን ነው
  ንጉሥ ሆይ
ያነዋወርህ የስልጣን ዘመን 
ዘላለማዊ የማይተመን

ሀያል ነን ያሉ የአለም ነገስታት
  ዙፋናቸውን ስጋት ሲያርደው
የማይናወጥ ሀይል የከበበው
ያንተ ዙፋን ግን ክብርህ ጋረደው

ከፍ የሚል ማነው ወደ ማደሪያህ
  ከመሬት ስበት እግሩ ያልታገለ
ውረድ የሚልህ ሰማይ የገባ
  ካንተ ጋር ደፍሮ የተካከለ
    ንጉሥ ሆይ
ያለ አማካሪ
  በጥበብ ሰሪ
ያለ አንጋሽ ሿሚ
  ስልጣንህ ቋሚ
ያለ አንዳች ጭፍራ 
  ግርማህ ሚያስፈራ
ያለ ሁለተኛ
  ቀዳሚ አንደኛ
መንግስት ያንተ ናትና(x2)
ሀይል ክብር ምስጋና(x2)

የመበለቷ ዳኛ አይደለህ ወይ
  የማንም ፍትህ እዳ የለብህም
በትረ መንግስትህ አድሎ አያውቅም
ጥበብህ ድንገት ደርሶ አይከዳህም

በድንበር ግፊያ ማን ሊታገልህ
  ወሰን አልባ ነህ የምድር ወሳኙ
እንኳንስ አንተ ፍጥረትህ እንኳን
  ተጠንቶ እንዲያልቅ ማነው ተንታኙ
   ንጉሥ ሆይ
ያልተሸመነ ሞገስ ደርበህ
  ፍትህ ነው ግብርህ በእውነት ተውበህ
ዙሪያህ እሳት ነው ደግሞች ቸርነት
  ሲዳፈሩህ ሞት ሲፈሩህ ምህረት
መንግስት ያንተ ናትና(x2)
ሀይል ክብር ምስጋና(x2)

በሠሎሞን ክብር ሣባ ደነቃት
  የማስተዋሉ የጥበቡ አቅም
የእርሱ ይገደባል ሁሉን አይችልም
ያንተ ግን ጥበብ ብርታቱ አያልቅም

ያንተ ንግስና በሠልፍ ብዛት
  በብዙሀን ደም አልተገነባም
ሌላውን ገድለህ ስልጣን አልያዝክም
ነፃ አውጭነትህ ሠው አላስነባም
   ንጉሥ ሆይ
ወልደህ አውራሹ
  አጥበህ አንጋሹ
ምረህ ምትመራ
  ጠርተህ ምትሰራ
እንጀራው ንጉስ ቤተመንግስቱም
  የምትወረስ አንተ ነህ ርስቱም
መንግስት ያንተ ናትና(x2)
ሀይል ክብር ምስጋና(x2)

ሳትሰነዝር የዝምታህ ድምፅ
  ብቻ ያቀልጣል ቃል ሳትናገር
እልፍ የሚማርክ የመውደድህ ጥግ
  ወዶ ያዘምታል የፍቅርህ ነገር

ማነው የሚልህ ራሱ ማነው
የሰጠኸውን ሚተነፍሰው
እየተገዛ ላደራረግህ
  የለም ያለ እንደው የታለ ያሠው
   ንጉሥ ሆይ
በነማን ምርጫ ፀድቋል ሹመትህ
በየቱ በፍታ ደምቋል ውበትህ
ቀመር ይሠላ ለሚያልፈው መሪ
አንተማ አንተ ነህ ሞት አሻጋሪ
መንግስት ያንተ ናትና(x2)
ሀይል ክብር ምስጋና(x2)

መንግስት ያለህ ንጉስ ስልጣንህ የበዛ
በፍቅር የምታይ በፅድቅ የምትገዛ
  ሠራዊት ሳይከብህ ያለ ጋሻ ጃግሬ
  እግዚአብሔር ሀይለኛ ትናንትናም ዛሬ(x2)
መንግስት ያንተ ናትና(x2)
ሀይል ክብር ምስጋና(x2)
'''
                      }),
                ])
          ]),
      Singer(name: 'ዘማሪት ሀና መርዓዊ', photo: GSHana, singerId: '04', albums: [
        Albums(
            name: 'እነሆ',
            photo: eneho,
            realeasedDate: DateTime.now(),
            albumNumber: 01,
            songs: [
              Song(
                  name: 'እነሆ',
                  videoURL: 'https://youtu.be/NodNrYMcgxU?si=6au-yRHqgZbs3DcA',
                  songLyrics: {
                    'lyrics': '''
እነሆ የአለሙን ሀጢአት
እነሆ ሚያስወግድ መድሀኒት
የእግዚአብሔር ንፁህ በግ ኢየሱስ
ዋጅቶናል ክብሩ ሰማይ ይድረስ

ልንፈታ የጫማውን ጠፍር
የማንችል ስንሆን በፍቅር
አየነው ሲመጣ ወደኛ
ፈልጎን ያንን ደግ እረኛ

   ይህንን ያስተዋለ ማነው
   የገዛ ወገኑ እንደገፋው
   መዳፉን እስኪ ተመልከቱ
   ያወራል ቁስል እትራቱ

ከሰማይ ከተሰጠን በቀር
የለንም ምንሰብከው ከምድር
ትላንትም ዛሬም ነገም ህያው
ብቸኛ መዳኛ ኢየሱስ ነው

   ቃላችን ሚጠቁመው እርሱን
   ዜማችን ሚያከብረው ንጉሱን
   በፍቅር የሞተው በአላማ
   ኢየሱስ እርሱ ነው የኛ አርማ

እርቃኑን በራስቅል ኮረብታ
እንደ በግ ሆኖ በዝምታ
የታየው የደም ፈትል ለብሶ
አካሉ በደሙ ተነቅሶ

   ብቻውን ሁሉን ተሸክሞ
   በስቃይ አንገቱን አዝሞ
   በመስቀል የተመሳቀለው
   ኢየሱስ ሊሰበስበን ነው

ፍቅር ነው ፍፃሜ የህጉ
ጥላ ነው ዋኖስና በጉ
ነብያት የተነበዩለት
ተገልጧል ተወልዶ በበረት

   እነሆ እንዳለ መጥምቁ
   መድህኑን ቤዛውን እወቁ
   ማመንም መዳንም አሁን ነው
   ኋላማ ማይጠቅም ዋይታ ነው           
  '''
                  }),
              Song(
                  name: 'ራሴ ነህ',
                  videoURL: 'https://youtu.be/cO-jQXK1swk?si=6FwDbnkxsIPQ3s00',
                  songLyrics: {
                    'lyrics': '''
ራሴ ነህ ውብ ድብድማቴ
ጌታ ነህ ለእኔም ለቤቴ
ይውለብለብ ጉልላቴ ላይ 
ስም የለም ስምህን መሳይ

የይቅርታህ መርገፍ እልፍኜን አስጌጠው
ብርሃንህ ጎጆዬን እያንቆጠቆጠው
ዳሰስከኝ አከምከኝ ባርኮትህ በዛ
እረ እንደምን ሆኖ ለሌላ ልገዛ

መቅደስህ ካደረከኝ ካደርክብኝ በእኔ
ደምህ ካረፈበት ጉበኔ መቃኔ
በልቤ አደባባይ አይታይ ሌላ አርማ
አንተ ነህ መሪዬ ከፍ ያልከው በግርማ

በሁለንተናዬ አንተ ብቻ ጌታ 
ወርሶታል ሕይወቴን የደምህ ጠብታ
አንድ ነው ከእንግዲህ ምስክርነቴ
ኢየሱስ ጌታ ነህ መንገድም ሕይወቴ

ስም የለኝምና አትጥሩኝ በስሜ
ስሜ ክርስቶስ ነው መጠሪያዬ ዓለሜ
የልቤ ትክሻ መስቀሉን ይዞታል
የነፃነት ሰንደቅ ስሙ ታስሮበታል
'''
                  }),
              Song(
                  name: 'ያየህልኝን',
                  videoURL: 'https://youtu.be/VNTmdWIWGT4?si=FAoLzySTAm8fxNx4',
                  songLyrics: {
                    'lyrics': '''
ያየህልኝን አሜን  ያሰብክልኝን
እወርሰዋለሁ አሜን ያስረገጥከኝን
ባለ ራዕይ ነኝ በእኔ አለህ አላማ
የጠራኸኝን እንጂ ማንን ልሰማ

እስር ቤት ድረስ ክበር
ሆነኸኝ ሞገስ ክበር
ጭራሽ ለዙፋን ሾምከኝ
ለሸጡኝ አተረፍከኝ
  ብጣል ከባህር ክበር
  ለምክንያት ነበር ክበር
  ለንጉስ እልፍኝ ብዬ
  አልጎድልም ከራዕዬ

ቢሰበር መርከብ ክበር
ማምለጫው ቢጠብ ክበር
ወህኒውም ቢዘጋጋ
ማዜም ነው እስኪናጋ
  ናዝራዊ አርገኸኝ ክበር
  ስለለየኸኝ ክበር
  እንኳንስ በህይወት ቆሜ
  ማርከሀል በድካሜ

ወጥመድ ቢበዛ ክበር
ዘማች ቢበዛም ክበር
ከቀስቱ በላይ ሆነህ
ትታየኛለህ ደምቀህ
  በእኔ የጀመርከው ክበር
  ሁኔታ አይገታው ክበር
  ረግጬው እባብ ጊንጡን
  አውጃለሁ እውነቱን

ጩኸቱ ብዙ ክበር
መርገም ማውገዙ ክበር
ሁሉም ሲጨብጥ ድንጋይ
ያኔ ማየት ወደ ላይ
  በመንፈስ ሙላት ክበር
  በድፍረት መውጣት ክበር
  ከዚያማ ማብዛት ምርኮ
  በእውነተኛው አምልኮ                    
'''
                  }),
              Song(
                  name: 'ቅዱስ ዜናዬ',
                  videoURL: 'https://youtu.be/B5W_Vtur0h8?si=pUIRznO630ZR7oS1',
                  songLyrics: {
                    'lyrics': '''
ወንጌሌ ኢየሱስ ቅዱስ ዜናዬ
ለዓለም ማሳይህ ክቡር አርማዬ
በደምህ ዝናር ጠብቋል እምነቴ
በድል ላይ ድል ነው ላንተ መዝመቴ

ብስራት እያለኝ መርዶ አላወራ
ልፋጠን እንጂ ለክብርህ ስራ
ልበል እነሆ ልጠቁም አንተን
የመዳኔን ቀንድ የነፃነቴን 
ከተሰቀልከው ከሞትከው በቀር
እንዳላውቅ ሌላ ቆርጬ ነበር
ለዓለም ሞኝነት ለእኔ ጥበቤ
ልስበክህ ውዴ በእንባ ታጥቤ

እኔ ልሸሽግ አንተ ታይልኝ
እርቃን ተሰቅለህ ያላፈርክብኝ
ወዮልኝ ለእኔ ባልሰብክህ ጌታ
ነፍሴ በሞትህ ከሞት ተነስታ
እንደ ነፋሱ የለም ግራ ቀኝ
ነፃ ሚያወጣ እውነትህ አለኝ
ሁሉን ልቀበል ላውጅህና
የተጠራሁት ለዚህ ነውና

ከነገሬ ላይ የማይተያይ
ለመስቀል ዘንቦ የፍቅርህ ሲሳይ
በሆነ አልሆነ እንዴት ላባራ
ከፍቅርህ ሰማይ ከቃልህ ሥራ
ከማድጋዬ ከቤቴ ቀደመህ
ያልህ የነበርክ መኖሪያዬ ነህ
አልፋዬ ኢየሱስ የሕይወት ራሴ
ኦሜጋዬ ነህ ወደብ ለነፍሴ

አይደለም የዓሳ መረቤ ዛሬ
አስታጥቀኸኛል ስብከት ዝማሬ
ለክብርህ ወንጌል ለይተኸኛል
የሃሰት ሆታ እንደት ያመረኛል
ያሳወቅኸኝን እናገራለሁ
ያሳየኸኝን መሰክራለሁ
ከኃጢዓት ሁሉ ያነፃል ደምህ
ዜናዬ ይህ ነው ሁሉ ይመንህ           
              '''
                  }),
              Song(
                  name: 'ደረስኩኝ',
                  videoURL: 'https://youtu.be/OBkrvOTwMn4?si=qY_Fz9aHixHbBTh_',
                  songLyrics: {
                    'lyrics': '''
ደረስኩኝ ከፅዮን ተራራ
ፀድቄ በክርስቶስ ሰራ
ደረስኩኝ ከእግዚአብሔር ከተማ
ቀድሞልኝ ኢየሱስ በግርማ
አልመለስ አልዞር ወደኋላ
እኖራለሁ በዘላለም ተድላ

ወደ ኢየሩሳሌም ሰማያዊት 
አእላፋት መላዕክት ወዳሉባት
ወደ በኩራት ማህበር ደርሻለሁ
የሁሉንም ዳኛ አየዋለሁ
  የጻድቃን መንፈሶች ፍፁማኑ
  በታመነው ጌታ ወደ ፀኑ
  ከዘላለም ህብረት ደምሮኛል
  ታላቅ የደም ኪዳን ቆሞልኛል

ከአቤል ደም ይልቅ የሚሻለው
ይቅርታ ምህረትን ሚናገረው
ወደ መርጨት ደሙ ደርሻለሁ
ኢየሱስን በክብር አየዋለሁ
  የተስፋውን መልሕቅ ጨብጫለሁ
  ደመ ማህተሙን አንግቤያለሁ
  ይሄ ነው ሀገሬ ከተማዬ
  ድንኳኔ ናት ምድር መቆያዬ

ስሙን ተነቅሼ በግንባሬ
ከብቤው ዙፋኑን በዝማሬ
ድል ከነሱት ጋራ እንዳከብረው
በእውነት እና በጽድቅ እንዳመልከው
  የመንፈስ መያዣ ተሰጥቶኛል
  ሠረገላው ሰማይ አድርሶኛል
  ለታረደው ነፍሴን አፈሳለሁ
  ጠቅልሎኝ ከእርሱ ጋር እኖራለሁ 
              '''
                  }),
              Song(
                  name: 'መገረሜ',
                  videoURL: 'https://youtu.be/jN70-akZAJk?si=QuV9smMEgingywzK',
                  songLyrics: {
                    'lyrics': '''
መገረሜ ኢየሱስ ነህ መደነቄ
እልፍ ስል ያገኘሁህ ሁሉን ንቄ 
ሳጉረመርም ቁሜ አልቀርም ሳማርር
ጉዳይ አለኝ መቃብርን ሚሻገር

በሞቀበት ሁሉ አላጨበጭብም
አሰፋለሁ እንጂ እግሬን አላጠብም
የሚያልፈውን አልፎ መፍጠን ነው ወዳንተ
እግር ይዘገያል ልብ እስካልከተተ
  እጄን ባፌ ጭኜ ትንፋሼን እየሳብኩ
  አላዳንቅ እኔ አቤት አቤት እያልኩ
  ድንቅማ ጌታ ነህ ህያው ተአምሬ
  ነፍስ የዘራህብኝ አልፎብህ ችንካሬ

በፈረሰው ቅጥር አይኖቼን ተክዬ
እንዴት አነባለሁ ከበኸኝ ጌታዬ
አቁስሎኝ የሄደው ወንበዴ ትዝታ
አይሸፍንብኝም ሳምራዊውን ጌታ
  ይልቅ በዘይትህ ባፈሰስከው ፍቅር
  በቻለኝ ትከሻህ በእንባዬ ልነከር
  እውነተኛው ወዳጅ እየመታህ ደጄን
  አልቆዝም እያሰብኩ የከዳኝ ወዳጄን

ከፀሀዩ በታች ከሠማዩ ግርጌ
በምን ተማምኜ ማንን ተስፋ አድርጌ
ሁሉ አርጅቶብኛል አንተን አየሁና
ዙሪያዬ ማይደንቀኝ ለዚህ ነው ምል ቀና
  ሰበር ዜና የለም እኔ በህይወቴ
  ባዳንከኝ ተይዟል ልቤም አንደበቴ
  አዲስ በማለዳ ሁሌም እፁብ ድንቄ
  ሌላ አላስተጋባም ማዕረጌን ለቅቄ        
 '''
                  }),
            ]),
        Albums(
            name: 'አየሁህ ቀራንዮ',
            photo: ayehuh,
            realeasedDate: DateTime.now(),
            albumNumber: 02,
            songs: [
              Song(name: 'በመስቀል', videoURL: '', songLyrics: {
                'lyrics': '''
  በመስቀል አምጠህ የወለድከኝ
በመስቀል በስቃይ የወለድከኝ
አባት ሆይ ላንተማ ቃልም የለኝ
   እንባዬ ይፍሰስልኝ
ኢየሱስ ላንተማ ቃልም የለኝ
  እንባዬ ያውጅልኝ

 በእግዚአብሔር መልክ ስትኖር ካለህበት 
  በሰማያት ከፍታ 
በኪሩቤል ጀርባ ተቀምጠህ 
  በዝማሬ በእልልታ 
መተካከልህንም በክብር 
  ሳትቆጥር እንደ መቀማት
ራስህን ባዶ አድርገህልኝ 
  አነገስከኝ በሙላት

በመቃብር ማህፀን ተቀብሬ
  በእንባና በለቅሶ 
በመቃተት ስኖር በሞት ሲቃ
  ማንነቴ ማቅ ለብሶ
በኮረብታው እርቃን የታየኸው
  አገልድመህ ይቅርታ
ነፃ አውጭዬ ወርደህ ወደ ጥልቁ
  አኖርከኝ በከፍታ

ባንተ ሆኜ ተቆራርጫለሁ
  ከመርገም ከኩነኔ
አዲስ ፍጥረት አድርጎኛልና
  ቤዛነትህ መድህኔ
ትናንትናን ደምህ ቀብሮልኛል
  ሆኖልኛል መታደስ
ልትደምረኝ ከንጉስ ካህናት
  ዋጅተኸኛል ኢየሱስ

በዘላለም ኪዳን ታስሬአለሁ
  ከሙሽራዬ ጋራ
በአየር ሆኜ እቀበለዋለሁ 
  ሲገለጥ እያበራ
ባለቤቴ በደም የገዛኝ ነው
  የእኔ አይደለሁም እኔ
እስትንፋሴን ሞቶ ለቀጠለው
  ተሰውቷል ዘመኔ          
 '''
              }),
              Song(name: 'ሾምኩት በልቤ', videoURL: '', songLyrics: {
                'lyrics': '''
ሾምኩት በልቤ የሞተልኝን
ሾምኩት በልቤ ያነገሰኝን
በነፍሴ ዙፋን በክብር ያረፈው
ኢየሱስ ልዑል አሜን ጌታ ነው

በአይሁድ ቢናቅም ክብሬ ነው ለእኔ
መመላለሻ እርሱ ነው ቀኔ
መቃብር አይደል ዛሬ መገኛው
የክብሩ ዙፋን የኔ ልብ ነው

በነፍሴ መካን ተቀብሮ ፍቅሩ
የወይን ግንዴ ጥልቅ ነው ስሩ
ቅርንጫፍ አርጎ ካለመለመኝ
የትኛው ነፋስ ሊያጠወልገኝ

የእምነት ጎጆዬ ራስ ነው ጉልላት
ሕጉን የፃፈ በልቤ ፅላት
በደም ለገዛኝ ነው መገዛቴ
ሁለት ጌታ የላት ሕይወቴ

በሰማይ አለ መደምደሚያዬ 
እኔ መቅደሱ እርሱ ጌታዬ
ለቤዠኝ እንጂ አልሆን ለሌላ
ስላሳረፈኝ በፍቅሩ ጥላ           
              '''
              }),
              Song(name: 'አላማዬን', videoURL: '', songLyrics: {
                'lyrics': '''
አላማዬን እንዴት ልርሳው እንደዋዛ
የኔን ፍቅር የኔን ሕይወት የኔን ቤዛ
ያለ ድካም ቅዱስ ስሙን ተሸክሜ
እዞራለሁ ሀገር ለሀገር ይህ ነው ህልሜ

ይቀሰቅሰኛል እረፍት እየነሳ
የመስቀሉን ፍቅር እንዴት ብዬ ልርሳ
ያ ሁሉ ብድራት ያ ሁሉ መከራ
ስለ እኔ አይደለም ወይ መጋቱስ መራራ
መራብ መጠማቱን መወገዱ 
ይህ ነው የእኔ ስብከት
ይህ ነው የእኔ ዜማ

ያልተላክንበትን እንዴት እንሰብካለን
ሀሰቱን ከእውነት ጋር በድፍረት ቀላቅለን
መልዕክተኛው ካለ የታለ መልዕክቱ
ከጥንት የነበረው የአብ ቃል እውነቱ
እግዚአብሔር የላከው የእግዜርን ያወራል
እባብና ጊንጡን ሞትን መች ይፈራል

ከፍታና ጥልቁ ሸለቆ ተራራው
ባሕርና የብሱም በቃሉ የተሰራው
እግዚአብሔር ትልቅ ነው ይበል እንደገና
ሁሉን ውብ አድርጎት አምጥቶታልና
አቤት የእጁ ስራ እፁብ በፍጥረቱ
ሲታይ እንዴት ያምራል ጌታ ጌትነቱ           
              '''
              }),
              Song(name: 'አየሁህ ቀራኒዮ', videoURL: '', songLyrics: {
                'lyrics': '''
አየሁህ ቀራኒዮ  አየሁህ
አየሁህ በደም ደምቀህ አየሁህ
ለፍቅሬ ታመህ ለመዳኔ
አየሁ እኔ

በሲቃ ሳቄን መለስክ ኢየሱስ
እንባዬን በደም አበስክ
ፊት ያለህ ፊተኛዬ የኔ ውድ
ተስለህ በህሊናዬ

በአንዲት ቃል ገነት ሰዳጅ ኢየሱስ
የልቤ የልብ ወዳጅ
የማይህ መታያዬ የኔ ውድ
ስምህ ነው መለያዬ

ያን የሞት አገልግሎት ኢየሱስ
ተሻግሯል ልቤ ጥሎት
ባየሁህ ተለይቼ የኔ ውድ
ኖራለሁ ተደስቼ

ስወጋህ አይኔ በርታ ኢየሱስ
አየሁህ በደስታ
መዳፍህ ሞቴን ዘጋ የኔ ውድ
መስቀል ላይ ሲዘረጋ           
              '''
              }),
              Song(name: 'አዎን አሜን', videoURL: '', songLyrics: {
                'lyrics': '''
አዎን አሜን ነው ዝማሬዬ 
አዎን አሜን ነው
ማሕተሙን በደም 
አንበሳዬ ስለፈታኸው
ኪዳኑ አዲስ ነው ኑሮዬም አዲስ
ስለዋጀኸኝ በደምህ መፍሰስ
ከፅድቅህ ጋራ ስለተስማማሁ 
ማጉረምረም ትቼ አዎን እላለሁ
ያንተ ነፃ ነኝ ወድቆ ቀንበሬ
ባፈሰስከው ደም ድኜ ከብሬ
ከሕግ እርግማን ስለዋጀኸኝ
በፀጋ ሙላት ባለ ቅኔ ነኝ

በሰማይ ችሎት ሁኗል ይሁንታ
ከሞት ልመለስ በደም ጠብታ
አንተን እስኪሰጥ አብ ከወደደኝ
ባንዱ ልጁ ሞት ሕይወት ሊሰጠኝ
መቀበል እንጂ የለኝ እምቢታ
አምኖ መዳን ነው በክብር ጌታ
እሽ ለቃልህ እሽ ለፍቅርህ
ጋርዶኛልና ቅዱስ መንፈስህ

አሉት ፈርሶ የሞት ፍርሃት
በፀጋው ወድቆ የሕግ እስራት
በክርስቶስ ልብ በፍቅር ሆኖ
አለማድረግን በማድረግ ከድኖ
ከወዳጅ አልፎ መውደድ ጥላትን
ግራ ሲመታ መጨመር ቀኝን
ይህ ነው ትምህርቴ 
ይህ ነው አዎኔ
እርሱም ኢየሱስ እውነት አሜኔ

ከደመና ጋር ያኔ ስትመጣ 
የምድር ወገኖች ሲያበዙ ዋይታ
ቀበርንህ ያሉ የወጉህ ሲያዩ 
በክብር ሆነህ ደምቀህ በልዩ
ከኅጢአት በደም ያነፃሃቸው
ለአባትህ ካህናት ያደረካቸው
አዎን እያሉ እጅ ሲነሱ
አቤት ዝማሬ እፁብ መንፈሱ           
              '''
              }),
              Song(name: 'ያምራል', videoURL: '', songLyrics: {
                'lyrics': '''
ያምራል ውብ ነው መልክህ
ያምራል ደም ግባትህ
በደም ቀለም አጊጠህ 
ልዩ ነህ ላስተዋለህ

       እንደሚታረድ 
እንደ በግ በፍቅር ተነዳህ
ጺላጦስ ደነቀው ዝምታህ
ንጹሁ ቆመሃል በሸንጎ
ሃሰት በእውነት ላይ አድማ አርጎ
 
    መስቀሉን ይዘህ
በጀርባህ ጅራፍ እያረፈ
ከአካልህ ደም እየጎረፈ 
ተዳፋህ በዛ በተራራ
አርፈናል ጌታ ባንተ ስራ

    በደም አጊጠህ
በእሾህ አክሊል የነገስከው
በመስቀል ዙፋንህ የታየኸው
አየነው ቁንጅናህን ጌታ
መዳፍህ በችንካር ሲመታ

    እያልክ ኤሎሄ
ጩኸቴን ጮክልኝ ጌታዬ
በደምህ ታጠበ እንባዬ
ሆነኸኝ መስዋት ካህኔ
ተማርኩኝ ሆነልኝ መዳኔ           
              '''
              }),
              Song(name: 'ቅዱስ ቅዱስ ነህ', videoURL: '', songLyrics: {
                'lyrics': '''
ቅዱስ ቅዱስ ቅዱስ ነህ ዘላለም
የኔ ጌታ የሚመስልህ የለም
በማደሪያህ ክብር ለታረድከው
ዘላለሜን በእጅህ ለጨበጥከው

በብዙ ክብር በብዙ ደስታ
ወደ ማደሪያው ወደ ከፍታ
ይዤ ልገስግስ ቅኔና ዜማ
የልቤን መስዋዕት ላንተ ልሰዋ

አመልክሀለሁ
የልቤ መሻት ቢሞላም ባይሞላ
አመልክሀለሁ
አልሻም ጭራሽ ጌታ ካንተ ሌላ
አመልክሀለሁ
ከሚፈሩህ ግር በጉባኤው መሀል
አመልክሀለሁ
እልልታ መዝሙር ላንተ ይገባሀል

ሽማግሌዎች የወርቁን ፅና
ሲወዘውዙት ጉልበቴ ፀና
ለታረደው በግ ክብር እያሉ
በታላቅ ሀሴት ይዘምራሉ

አመልክሀለሁ
ከነገድና ከቋንቋ ዋጅተሀል
አመልክሀለሁ
አምልኮ ስግደት አዎን ይገባሀል
አመልክሀለሁ
ባለፀጋ ነህ የአለም ሁሉ ጌታ
አመልክሀለሁ
ሰባቱን ማህተም በፅድቅህ የፈታህ

ምድር አበራች ሸሸ ጨለማ
አከተመለት የሲኦል ግርማ
ስምህ እንደ ዘይት ፈሷል በላዬ
አንተን አንግሶ ሁለንተናዬ

አመልክሀለሁ
መዳን ባንተ ነው ሌላ አዳኝ የለም
አመልክሀለሁ
እንደ ዋጀኸኝ ይታወቅ ለአለም
አመልክሀለሁ
ደጆች ተዘግተው አንተ ነህ ጌታዬ
አመልክሀለሁ
በአደባባዩም የመጀመሪያዬ            
              '''
              }),
              Song(name: 'ስምህ መልካም መአዛ', videoURL: '', songLyrics: {
                'lyrics': '''
ስምህ መልካም መአዛ 
ደምህ  የሚምር ቤዛ 
ኢየሱስ አሜን ተቀደስ
ኢየሱስ ዘላለም ንገስ

ከጠላቴ ወረዳ
ጭንቅ ሆኗል ከእርሱ ዘንዳ
በኢየሱስ ስም ብዬበት
ተቃጥሏል እሳት ወርዶበት

ደናግል የወደዱህ
በፍቅር የለመዱህ
ማር ነህ የማር ወለላ
ስምህ ጣፋጭ ነው ሚበላ

በረፍት ላይ ነኝ ዛሬ
ስምህ ቃኝቶኝ ዝማሬ
በለምለሙ ነው መስኬ
ባንተ ታድሶ ታሪኬ

ነፍሴ ለባለቤቷ
ተሰጥቷል ሰገነቷ
ማንንም አላነግስም
ታትሟል በኢየሱስ ስም           
              '''
              }),
              Song(name: 'ሰማይ', videoURL: '', songLyrics: {
                'lyrics': '''
ሰማይ ሰማይ እያየሁ ደጅህን ሳንኳኳ በእንባ
እቅፍ ድግፍ አረገኝ ፍቅርህ ክንድህ አባባ
ሁሉን በሚችል እጅህ ራሴን ጥያለሁ
መኖሪያዬ ጌታ ነህ አምኜሀለሁ

እልፍኝን ጥሎ ስደት መምረጥ ቢከብድም
በረሀውን ማቋረጥ በረሀብ በጥም
አንተ ነህ ከነአኔ ማሬ ወተቴ
ቀምሼህ ትዝ አይለኝ ስለ ትናንቴ

በዙፋንህ ስላለህ ሰምተህ መላሹ
ጉዳዬን ልዘርጋልህ እንባን አባሹ
በምህረት በዘይትህ ታከመ ልቤ
መነንኩኝ በመውደድህ ሆንከኝ ወደቤ

አላይ ግራና ቀኜን ኋላና ፊቴን
ይልቅ ወደ ላይኛው ላሳርፍ አይኔን
ነገሬን የጨበጥከው በዙፋንህ ነህ
አለምን አሸንፈህ በክብር ያለህ

የማይዳስሱህ ፀሀይ ማጠልቀው  ጀንበር
የሕይወቴ ወገግታ የነፍሴ ክብር
ልይህ የኔ ብርሃን መሪ ኮከቤ
በዘላለም ክንዶችህ አረፈ ልቤ           
              '''
              }),
              Song(name: 'የእንደገና', videoURL: '', songLyrics: {
                'lyrics': '''
የእንደገና አምላክ ነው ይመጣል ተመልሶ
ገና እናየዋለን እንባችን ታብሶ
አንጠረጥረውም እግዚአብሔር ታማኝ ነው
አይዋሽም ጌታዬ እውነት ነው እውነት ነው

ማርታ ሆይ እመኝ ወንድምሽ ይነሳል
ከሁኔታ በላይ ኢየሱስ ይደርሳል
ተዘጋ ብላችሁ እንዳትመለሱ
መክፈትና መዝጋት ስለሚችል እርሱ

ከሁኔታ በላይ ከብርታት ከፍታ
ከሰው ጥበብ በላይ የሚችል ነው ጌታ
እንዳትመዝኑት በስጋ ሚዛን 
ሁሉን ቻይ ነውና ጌታ ብቻውን

ደመና ሳይታይ ይሞላል ሸለቆ
ማነው የጎደለ ጌታውን ጠብቆ
በጥቂት በብዙ ማዳን የሚችል 
እጅግ ማትረፊያ ነው ጌታን መከተል

ተፈፀመ ስንል እግዚአብሔር ደረሰ
ጉልበታችን ሲዝል ቅጥሩ ፈራረሰ
ቢከበን ሰራዊት ተስፋን የሚዋጋ
እግዚአብሔር አለ ሌቱን የሚያነጋ           
              '''
              }),
              Song(name: 'ወይኔ ነህ', videoURL: '', songLyrics: {
                'lyrics': '''
ወይኔ ነህ(x2) ለምልሜብሀለሁ
ኢየሱስ ፀሀዬ ፈክቼብሀለሁ

ገበሬው አባትህ አንተ የወይን ግንዴ
ማፈራብህ ፅድቄ መሄጃ መንገዴ
እኖራለሁ በአንተ ትኖራለህ በእኔ
ታላቅ ወንድሜ ነህ መመኪያ ተገኔ

አብ እንደወደደህ እንዲሁ ወደድከኝ
በፍቅርህ ከመኖር ሌላ ምርጫም የለኝ
በመናኛው አለም ቀርቷል መገረሜ
የዘላለም ሐሴት ቀምሼህ አለሜ

ስለኔ ካኖርካት ነፍስህን በፍቅር
ሀሞቴን ወስደኸው በወይንህ ብሰክር
አንተን ያሳደደ ለኔ ላይመለስ
አለም ጠላኝ ብዬ እውነቴን አልቀንስ

ዙሪያው ምድረበዳ ጭው ያለ በረሃ 
ነፍሴን ያቆየሀት ቅዱስ የህይወት ውሃ 
እንደተጣበኩህ እንዳፈራሁ ልኑር
ሠላም እርካታዬ ለፍቅርህ ስዘምር           
              '''
              }),
              Song(name: 'በልቤ ወገብ', videoURL: '', songLyrics: {
                'lyrics': '''
በልቤ ወገብ አጎንብሼ
ከምስጋና ጋር በእንባ ርሼ
ምልጃና ፀሎት አቀርባለሁ
ጌታ ቅርብ ነው አምነዋለሁ

  በአንድ ልብ ሆኜ እንደቃሉ
  እማልዳለሁ ስለ ሁሉ
  አንዳች አይነጥፍም መሰዋዕቴ   
  ቃል አለው በእኔ መድሀኒቴ

መማፀኛ ስም ስላለኝ
በፊትህ ስቆም ሙሉ ነኝ
ቀን መሽቶ ሌቱ እስኪነጋ
ሙላት ሆኖኛል ያንተ ፀጋ

አሜን በሆነው አሜን አልኩኝ
አስፈሪውን ቀን ስላለፍኩኝ
ፊትህ ተነጥፎ ፆም ፀሎቴ
በአብርሆትህ በርቷል ፊቴ

መንፈስህ ይሙላ በመቅደስህ
ዘመኔን ሙሉ እንዳነግስህ
በቁንዳላዬ መሐል ይፍሰስ
በዘይትህ ጠል ነፍሴ ይራስ

አይኔ ተነቅሎ መኖሪያህ
ገስግሶ መጥቷል ማደሪያህ
እንባን ሲያረግፍ ሽፋሽፍቴ
አየኸኝ ፍቅሬ ከነ ሀጢአቴ

የልጁን መንፈስ ተቀብዬ
አልፈራም አባ አባት ብዬ
ተወስዶልኛል የጋረደኝ
ተጣብቄአለሁ ከወደደኝ

ደመናን ጠቅሶ ልመናዬ
ዙፋንህን ነክቷል ውብ ዜማዬ
አንዳችም ከእኔ ላልሰውር
ኪዳን ተክለሀል የፍቅር

ላትለቀኝ ነው የያዝከኝ
ላትተወኝ ነው ያየኸኝ
ምስጢረኛዬ የኔ ያልኩህ
የችግሬ ቁልፍ አንተ እኮ ነህ
'''
              }),
              Song(name: 'ደሙ ነው', videoURL: '', songLyrics: {
                'lyrics': '''
ደሙ ነው ክብሬ ደሙ ነው ቅጥሬ
ንጉሴ ኢየሱስ ሠማይ ሀገሬ
እውነቴን አልተው ለድንኳን ኑሮ
መሻገር እንጂ ጌታን መስክሮ

ያሻገረኝን ትከሻህን አስብና
ፅኑ መከራህ ህሊናዬን ይይዝና
አንደበቴ ቃል አይኖቼ እንባ ያጎርፋሉ
ለልቤ ንጉስ ለነፍሴ ጌጥ ነህ ልዑሉ

አላይም ነበር ወደ ሰማይ በነፃነት
መካከለኛ ባትሆነኝ ፅኑ ጉልበት
መስዋዕትነትህ የኔን ተግሳፅ ተሸከመ
በመስቀል ስራ ባርነቴ አከተመ

በደም ክፍያ በሞት ዋጋ ተገዝቼ
እንዴት ልሸቅጥ ለመዳኔ ስፍራ አጥቼ
የተዋጀሁት በእግዚአብሔር በግ በአንድ ልጁ
ፈፅሞ አልሰንፍም ለወንጌሉ ለአዋጁ

ሞቴን ሊሽረው ስልጣን ያለው ማን ነበረ
ሁሉም በድሎ ከሀጢአት በታች ዝግ ነበረ
ንፁህ ኢየሱስ ካህንና መስዋዕቴ
ነፍሱን አኑሮ ሆኖልኛል መፈታቴ
'''
              }),
            ]),
      ]),
      Singer(name: 'ዘማሪት ዘርፌ ከበደ', photo: GSZerfe, singerId: '05', albums: [
        Albums(
            albumNumber: 01,
            name: 'ሩሃማ',
            photo: ruhama,
            realeasedDate: DateTime.now(),
            songs: [
              Song(
                  name: 'ማመስገኔ',
                  videoURL: 'https://youtu.be/OcW9U0x-aH8?si=KKMxhrKFffuhY5ks',
                  songLyrics: {
                    'lyrics': '''
ማመስገኔ ዝማሬዬ ለበጎ ሆነልኝ
በኢያሪኮ በግንቡ ፊት በሕይወት አቆመኝ
ጉልበት አለው እልልታዬ ቅጥሩን ለመደርመስ
ልዩ ነበር በኢያሪኮ በዝማሬው መንፈስ

የጠራኸኝ አንተ አበርታኝ አደራ
አብረኸኝ ተሰለፍ ዝመት ከእኔ ጋራ
ማዳንህን ሰምቶ ይሸበር ዲያቢሎስ
እኔም እልል ልበል ግንቡ ሲደረመስ

ከዮርዳኖስ ማዶ አለችኝ ከተማ
የአብርሃም ርስቱ የስንዴው አውድማ
ልወርሳት ወጣለሁ የአባቶቼን ሀገር
ነግሮኛል ንጉሱ ባህሩን ስሻገር

ዱሩን መች እፈራለሁ ጨለማውን እኔ
የነ ዳዊት አምላክ ካለልኝ ከጎኔ
በገባኦን ሰማይ ፀሀይ አቁሜአለሁ
በኢያሱ አብራክ ውስጥ እኔ ልጁም አለሁ

ተንሸራቷል የለም ወድቋል ሰንሰለቱ
የዝማሬ መንደር ሆኗል ወህኒ ቤቱ
የሮማ ወታደር አሸብሽቧል ፊቴ
በዝማሬው ብቻ ማርኮታል አባቴ
'''
                  }),
              Song(
                  name: 'እንባን አልሰፍርም',
                  videoURL: 'https://youtu.be/s5CtkH5ocqs?si=kIJwzUYrwkicWsDl',
                  songLyrics: {
                    'lyrics': '''
እንባን አልሰፍርም በመዳፌ
የክብርህ ዜማ ሞልቶ በአፌ
ሰልፍ አስተምረህ ለእጆቼ
አመሰገኑህ ከንፈሮቼ

ቀራንዮ ሆነህ ባይህ አሻግሬ
ከቄዳር ተነቅሎ ተከተለህ እግሬ
ሰገነት አይደለም የልቤ ናፍቆቱ
እንደ ምድረበዳ አንተ ነህ ጥማቱ

ታሪኬን ቀያሪ ውበት ማንነቴ
የጠራኸኝ ጌታ አንተ ነህ እረፍቴ

በማዕበል መካከል ልትሆነኝ ከፍታ
ጭንቄን እየረገጥክ ደረስክልኝ ጌታ
መች ያቆየኝ ነበር የሰው ትከሻማ
ቀኝህ ባትደግፈኝ መገፋቴን ቀድማ

ታሪኬን ቀያሪ ውበት ማንነቴ
የጠራኸኝ ጌታ አንተ ነህ እረፍቴ

የተረዳኝ ማነው የረዳኝስ ቀርቦ
ከመናገር በቀር ቃላትን አስውቦ
ያመንኩት ጥሎኛል ያመለኩህ ያዘኝ
ከጠላት መንጋጋ በደም የገዛኸኝ

ታሪኬን ቀያሪ ውበት ማንነቴ
የጠራኸኝ ጌታ አንተ ነህ እረፍቴ

የነ አፍኒንን ድንኳን ተፀየፈች ነፍሴ
ውስጤ ባያርፍ ነው በፊትህ ማልቀሴ
ከስደት መልሰህ የሾምከኝ በፀጋ
አበርታው አምላኬ ልቤ እንዳይሰጋ

ታሪኬን ቀያሪ ውበት ማንነቴ
የጠራኸኝ ጌታ አንተ ነህ እረፍቴ
'''
                  }),
              Song(
                  name: 'ለአይኔ እንቅልፍ',
                  videoURL: 'https://youtu.be/zf7b2G9Belo?si=n2aIexUK-2tzyWlG',
                  songLyrics: {
                    'lyrics': '''
ለአይኔ እንቅልፍ የለውም ለጉንጮቼም ረፍት
ዘውትር አነባለሁ ከልካይ በሌለበት
ሀጢአት ሰላም ነስቶኝ እያዘነ ልቤ
በማይቆም የእንባ ዶፍ ርሷል መሀረቤ

ከወይኑ ግንድ ካንተ ኮብልዬ መች ተመቸኝ የኔ ጌታ
ኖርኩን እንጂ በዚች አለም ሁሌ ሳለቅስ ጠዋት ማታ
ልጅ ያጠፋል እንደ ዘበት ያበላሻል ብዙ ነገር
ግን ይምራል ይቅር ይላል ይታገሳል የአባት ፍቅር

ተሰቅለህ ያዳንከኝ
እየሞትክ ያኖርከኝ
መድሀኒቴ ሆይ እንዳትተወኝ
መፅናኛዬ ሆይ እንዳትተወኝ

ሰው በራሱ ምን ይችላል ካላኖረው ቸርነቱ
እስትንፋሱ በአፍንጫው ነው በትንታ የሚሞቱ
ባለጠጋ ዝናም ያለው ሀይለኛ ሰው አንድም የለ
ታስሮ ወርዷል ከመቃብር በሞት መዳፍ እየዛለ

ተሰቅለህ ያዳንከኝ
እየሞትክ ያኖርከኝ
መድሀኒቴ ሆይ እንዳትተወኝ
መፅናኛዬ ሆይ እንዳትተወኝ

በኔ ሕይወት ላይ ያለፈው ጥሩ አይደለም ትናንትና
ፅኑ እምነቴ ስብራቴ ቢዘረዘር መች ያልቅና
መንገድህን ያሳየኸው ያስተማርከው ሰው ምስጉን ነው
አንተን ማወቅ የኔ ጌታ የሰው ሁሉ ፍፃሜ ነው

ተሰቅለህ ያዳንከኝ
እየሞትክ ያኖርከኝ
መድሀኒቴ ሆይ እንዳትተወኝ
መፅናኛዬ ሆይ እንዳትተወኝ
'''
                  }),
              Song(
                  name: 'ሩሃማ',
                  videoURL: 'https://youtu.be/OIX35pq2SUc?si=y3hs5bF3867lJqLN',
                  songLyrics: {
                    'lyrics': '''
ምህረት የሚገባት ካላችሁማ(x2)
እኔ ነኝ ሰዎች ሩሃማ(x2)

እባክህ ወዳጄ ለምፃሙ ሰው
ስለማረኝ ውዴን አትውቀሰው
ስለ ሀጢአተኞች መጥቷልና
ብዙ ፍቅር አለው የሚያፅናና(x2)

ያልተማረች ሲሉኝ ሰምቻለሁ
ስድብና ንቀትን ጠግቤአለሁ
አሁን ይገባኛል ብዙ ነገር
ግን ሁሉን ቀይሯል የእርሱ ፍቅር

ከሳሾቼ ቁመው በጌታ ፊት
አመነዘረች አሉት ይቺ ሴት
ግን አገዘኝ እርሱ ልጄ እያለ
እንደ እግዚአብሔር ያለ ማንም የለ(x2)

በነበር የቀረ ታሪክ አለኝ
አሁን ግን ይመስገን የጌታ ነኝ
ምህረት የተገባት ተብያለሁ
አልዘፍንም ለክብሩ ዘምራለሁ
'''
                  }),
              Song(
                  name: 'እንደምወድህ',
                  videoURL: 'https://youtu.be/ZkMniTU_v9Q?si=ewOvrJlzmE-L7xgL',
                  songLyrics: {
                    'lyrics': '''
እንደምወድህ ጌታ ታውቃለህ
እንደማከብርህ አንተ ታውቃለህ
ለሞት አትስጠኝ ነፍሴን ለአለም
እንዳንተ ያለ ማንም የለም

እንደ አንተ ያለ ወዳጅ የለም በአለም ላይ
ያውሩ ቸርነትህን ምድርና ሰማይ
ያንን የሞት ጎዳና ሁሉንም ትቼ
ወደ አንተ መጣሁ እጄን አንስቼ(x2)

ሞት እጁን ሲዘረጋ አስጥለኸኛል
ክንድና ክንዴን ይዘህ አሻግረኸኛል
ማን አሁን ይሄን ያምናል ይሄን ይቅርታ
ንገስ በልቤ የጌቶች ጌታ(x2)

ዝምታህ ያስፈራኛል ድምፅህን ልስማ
መብራቴን እንዳይዘጋው የአለም ጨለማ
የማምለጫ አለቴ እጅህን ዘርጋ
መባዘን ይብቃኝ ልቤ በአንተ ይርጋ(x2)
'''
                  }),
              Song(
                  name: 'ታምኛለሁ',
                  videoURL: 'https://youtu.be/GgqrGzT6QLg?si=okk7t1W7bRnyTwXL',
                  songLyrics: {
                    'lyrics': '''
ታምኛለሁ ላንተ ጌታ
ፍፁም ማርኮኝ ያ ውለታ
ስትሞትልኝ አይቻለሁ
ያንተስ ፍቅር ለብቻው ነው

ጉልበተኛው ደከምክልኝ
ተናጋሪው ዝም አልክልኝ
ምን ፍቅር ነው ምን ደግነት
አልረሳውም ያንን እለት

የደም ሀውልት የደም ህንፃ
መተላለፌን ሊያነፃ
ልክ እንደ በግ ተቆጠረ
አላማውም ይህ ነበረ

ሳታቆስል ማርከኸኛል
ሳትታገል ጥለኸኛል
ልቤ ላንተ ተሸነፈ
መከራዬም በአንተ አለፈ

አዛኝ ወዳጅ ቸር እረኛ
ሌትና ቀን የማተኛ
እጄን ይዘህ አሻገርከኝ
አናት አባት አንተ ሆንከኝ
'''
                  }),
              Song(
                  name: 'ያድናል እግዚአብሔር',
                  videoURL: 'https://youtu.be/JG5JrYYu-1Q?si=0Yt3g7DJNMznm4tC',
                  songLyrics: {
                    'lyrics': '''
ያድናል እግዚአብሔር በመከራ
ጨለማውን ባይኑ እያበራ
የገዳዩን ቀስቶች የሰበረ
ማነው እንደ እግዚአብሔር የከበረ

ሌሊቱን ለድል ብርሃን እያረገ
በምድረበዳ ሕዝቡን የታደገ
በሙሴ በትር ታምራት የሰራ
አሸናፊ ነው ክብሩ የሚያስፈራ

ሞቱ ፈጠነ ጠላት ፍፃሜው
ከተራራ ላይ ጌታ ሲመታው
ላይመጣ ማለ ዳግመኛ ወደ ሕዝቡ 
ሽንፈት ለበሰ ሳይሞላ ሀሳቡ

ወጣ እያቆመ ግንቡን እየናደ
ከመንገዳቸው ሞት እያስወገደ
አለት ሰንጥቆ ውሃ እያጠጣቸው
ቀድል አሻግሮ ምድሪቱን ሰጣቸው

የሚወድቅ የለም በሰፊው መዳፉ
የሚሞት የለም ቢበረታም ሰልፉ
ሀይል የጌታ ነው ማዳን የንጉሱ
ለስሙ ክብር እጃችሁን አንሱ
'''
                  }),
              Song(
                  name: 'አለልኝ አባቴ',
                  videoURL: 'https://youtu.be/rwtjUF62xx8?si=t7LiCKlO-jD-DILZ',
                  songLyrics: {
                    'lyrics': '''
አለልኝ አባቴ አለልኝ ጌታዬ
ዘመን የማይሽረው ባለውለታዬ
ዛሬ ሌላ ሆኖ ቢከፋም ዘመኑ
አልተለየም ከእኔ ጌታ በማዳኑ

ምድርና ሰማዩ ቢጋጠም በላዬ
ሕይወት ብትመረኝ በዝቶ መከራዬ
አባት አለኝ በሰማይ ሀገሩ
አይዞሽ ልጄ ሚለኝ ሚያፅናናኝ በፍቅሩ

የሚሟገትልኝ ባይቆምም ከጎኔ
ለሞት ቢሰጠኝም ስህተቴን ማመኔ
የእኔ ተቆርቋሪ የእኔ ፈራጅ ዳኛ
እንባዬን ያብሳል አልሆንም ብቸኛ

አልጋዬን አንጥፎ የሚያስታምመኝ
ስወጣ ስገባ በፍቅር የሚያየኝ
ጎኔን ለማሳረፍ ባርኬው ስተኛ
እርሱ እንቅልፍ የለውም የነፍሴ እረኛ

ገና ሳልናገር የልቤን መሻት
ፈጥኖ ያደርግልኛል ሊሞላኝ በሐሴት
እመካለሁ ዛሬም እተማመናለሁ 
ዘላለም በክብር ከእርሱ ጋር እኖራለሁ
'''
                  }),
            ]),
        Albums(
            name: 'ማልደራደርበት',
            photo: malderaderbet,
            realeasedDate: DateTime.now(),
            albumNumber: 02,
            songs: [
              Song(
                  name: 'ማልደራደርበት',
                  videoURL: 'https://youtu.be/CHAI_qzhH1s?si=I2JgxL9y5i5N4AxF',
                  songLyrics: {
                    'lyrics': '''
ማልደራደርበት ማልቀብረው እውነት
አንገት የማያስደፋኝ የማላፍርበት
ኢየሱስ የሚለው ስም እስትንፋሴ ነው
እውነቱ ይሄ ነው

በሰባቱ መቅረዞች ተገልጠህ ያየንህ
የሞትና የሕይወት መክፈቻ ጨብጠህ
ያለና የምትኖር የትውልድ ሁሉ ቤዛ
ኢየሱስ የሚለው ስም ስንቱን በፍቅር ገዛ

አሜን የሆነው እንዲህ ይላል
አሜን የሆነው አሜን
አልፋ ኦሜጋ ለዘላለም
እንደ እኔ ሚያድን የለም


አምነው የጠሩት ሁሉ በግፍ እየተገፉ
ስንቶች በሚነድ እሳት በቀስቱ ፊት አለፉ
አንገታቸውን ለሰይፍ ለስለት እየሰጡ
ቤት ሀብታቸውን ጥለው ከሀገር ተሰደው ወጡ

አሜን የሆነው እንዲህ ይላል
አሜን የሆነው አሜን
አልፋ ኦሜጋ ለዘላለም
እንደ እኔ ሚያድን የለም

አይሁድ አትቃወሙ አትሟገቱ ስሙን
በደሙ ፈሳሽነት ቀድሶታል አለሙን
እንደ በግ አንገት ደፍቶ ኮረብታው ላይ ያየነው
ኢየሱስ የእግዚአብሔር ልጅ በእርግጥ የአለም ጌታ ነው

አሜን የሆነው እንዲህ ይላል
አሜን የሆነው አሜን
አልፋ ኦሜጋ ለዘላለም
እንደ እኔ ሚያድን የለም

ስሙ ነው ሰው ያረገን ስሙ ነው ስማችን
እኛማ ምን ስም አለን ቆሽሿል ልብሳችን
ዘላለም እያፅናና ትናንትን ባያስረሳን
እንደ ጠላት ውጊያማ በጠፋን በተረሳን

አሜን የሆነው እንዲህ ይላል
አሜን የሆነው አሜን
አልፋ ኦሜጋ ለዘላለም
እንደ እኔ ሚያድን የለም
'''
                  }),
              Song(
                  name: 'የኔ ናርዶስ',
                  videoURL: 'https://youtu.be/P53xq95BxHg?si=7fb9FafVM_KW070q',
                  songLyrics: {
                    'lyrics': '''
የኔ ናርዶስ የኔ ቤዛ
በመዓዛው ልቤን ገዛ
ያንን መዳፍ ተመልክቼ
ተከተልኩት ሁሉን ትቼ

እንቅልፍ የለኝ በአልጋዬ
ፊቴ ታጥቧል በእንባዬ
በውድቅቱ ነቅቻለሁ
ውዴን ብዬ ወጥቻለሁ

የሳሮኑ ፅጌሬዳ 
ያገኘሁህ ምድረበዳ
ስለፍቅርህ ታምሜአለሁ
በመስቀልህ ታክሜአለሁ

ተራሮችን የዘለለ
አድማሳትን ያካለለ
ጥላው ሲሸሽ ወደ ማታ
ፍቅርህ ጠራኝ የኔ ጌታ

ግራው ሰላም አንተራሰኝ
ከሞት ነጥቆ ቀኙ አቀፈኝ
ውዴ የእኔ እኔም የእርሱ
ማን ሊለየኝ ከንጉሱ
'''
                  }),
              Song(
                  name: 'ታሪክ ያደረከው',
                  videoURL: 'https://youtu.be/z54vCjM-S10?si=gOTP_k34p7I4JESj',
                  songLyrics: {
                    'lyrics': '''
ታሪክ ያደረከው የሞቴን አዋጅ
ተባረክ ኢየሱስ የእግዚአብሔር ልጅ

ሲኦል ባዶ ቀረ ሞትሞ ድል ተነሳ
በናዝሬቱ መልካም በይሁዳ አንበሳ
ሰባሪዬ ከፊት ስለቀደምክልኝ
ዘመኔ የካሳ የዜማ ሆነልኝ

አባ አባት ብዬ የምጮህበትን
አቀብለኸኛል ቅዱስ መንፈስህን
የባርነት አመት ተወግዷል ከኔ
ከእንግዲህስ ልጅ ነኝ ባንተ በመድህኔ

ጠላት በዙሪያዬ ሊውጠኝ ሲያገሳ
መዳኔ በዛልኝ ከአንተ የተነሳ
በስራዬ እንዳይሆን ወደ አብ መግባቴ
በፀጋህ ሸፈንከኝ ኢየሱስ አባቴ

የዘላለም ካህን እንደ መልከፄዴቅ 
በህያው መሀላ የተሾምከው በፅድቅ
አዘጋጅተህልኝ በሰማያት ስፍራ
ማምለጥ ሆኖልኛል በሰራኸው ስራ

ብሞትም ህያው ነኝ አንተን በማመኔ
አንዳች የሌለብኝ እርግማን ኩነኔ
በእባብ ጊንጡ ላይ አረማመድከኝ
በስጋም በነፍሴም ተባረክልኝ
'''
                  }),
              Song(
                  name: 'ትናንትናም ቅዱስ',
                  videoURL: 'https://youtu.be/jCRAcW12vhE?si=ln8yPI9tsWClKp5d',
                  songLyrics: {
                    'lyrics': '''
ትናንትናም ቅዱስ ዛሬም ቅዱስ ነህ
በመምሬ አድባር ስር ጌታዬ አየሁህ
እጄን አነሳለሁ አትለፈኝ ብዬ
የአባቶቼ አምላክ ግባ ከጎጆዬ

ሰባራው ልቤ 
    ሸሸ እያነከሰ (x2)
ጌታዬ ጥራው 
    ሰምቶ ከተመለሰ (x2)
በዚያ ሞት አለ
    በዚያ ብዙ መከራ (x2)
እንዴት ይሞታል 
    አምኖ አንተን የጠራ (x2)

የተጣለ ሰው 
      ወጥቶ የተሰደደ (x2)
ምን ተስፋ አለው
       በአንተ ካልተወደደ (x2)
አባብለኝና ልምጣ
     ልግባ ከእቅፍህ (x2)
አስረህ አኑረኝ ሁሌ ከማስነቅፍህ (x2)

የክረምቱ ዶፍ 
     ውሃው ሳይሞላ (x2)
ልውጣ ልሻገር 
      ልሩጥ ካንተ በኋላ (x2)
ካራን ምኔ ናት 
        አንተ ካልተቀበልካት (x2)
ምድሪቱን ልውረስ
      ልዳን ሕይወቴን ባርካት (x2)

ድንኳኔን ልትከል
      ቤቴን መንገድ ላይ ልስራ (x2)
እንግዳ አለብኝ 
    ልቡ አንተን ሚፈራ (x2)
ጠላት አውርቷል 
      ክፉ የአመፃ ወሬ (x2)
ወዳጄ ሆነህ ግባ
    ይከፈት በሬ (x2)
'''
                  }),
              Song(
                  name: 'በከበረው ሠረገላ',
                  videoURL: 'https://youtu.be/oQOH6KWgOt0?si=-RGjK8hBuom4wEip',
                  songLyrics: {
                    'lyrics': '''
በከበረው ሠረገላ 
ማን አኖረኝ ከአንተ ሌላ
ትዝታዬ ነህ እላለሁ 
ስባርክህ እኖራለሁ

ይፈሳል እንደ ዘይት   ይወርዳል እንደ ጅረት
በበረሃው ልቤ ላይ   ደምህ ከጎንህ ክፋይ
በአፍህ መሳም የሳምከኝ   ፍቅርህን ያጠጣኸኝ
አይለካህ እስትንፋሴ   ህይወቷ ነህ ለነፍሴ

ሰው ያለኝን በምሽት  ባላገኘው በንጋት
ነፍሴ የወደደችህ   አንተ ንገረኝ አልኩህ
ማን አስነሳኝ ለዜማ   መውደዱን እያሰማ
አሳልፈህ ክረምቱን   አጠገብከኝ ውበቱን

ይሸበራል ከተማው   እያለ ውድሽ ማነው
እኔም አዜመዋለሁ   በቅኔ እመልሳለሁ
የቀላው ደም ተነክሮ   ነጭ አጥንቱ ተቆጥሮ
ሞቶ ነፍሴን ያኖረው   ውዴ መድህኔ ይህ ነው

ከተማውን አስሼ   ሁሉንም አዳርሼ
እልፍ ስል አየሁህ   ናፍቆቴን አገኘሁህ
ሳላገባህ ከእልፍኜ   አልተውህም ጨክኜ
መልከ መልካሙ ንጉስ   ስስቴ ነህ ኢየሱስ
'''
                  }),
              Song(
                  name: 'ማራናታ',
                  videoURL: 'https://youtu.be/VIV_KPBgO60?si=UFwUPXK1ThkscyQY',
                  songLyrics: {
                    'lyrics': '''
ማራናታ ናልኝ ጌታ(x2)
ናፍቆቴ ነህ ጠዋት ማታ
አሜን ክበር የድል ጌታ

ልጠጣ ከእጅህ ወለላ
ተጠማሁ ናፈቅሁ እንደ ዋላ
እረፍቴ ሰላሜ እንዲመለስ
ዘይትህ በቁስሌ ላይ ይፍሰስ

በያቦቅ ስታገልህ ባድርም
መውደድህ እኔ አይወጣልኝም
በጥልቁ በከፍታም ሆኜ
ናፈቅሁህ ኢየሱስ አዳኜ

ከፍቅርህ ውቅያኖስ ጠልቄ
ካንተ ጋር ልኖር መናፈቄ
በነፍሴ ተወራርጄ ነው
ክርስቶስ አንተን የማመልከው

በብሉይ ትናፈቅ ነበረ
ልደትህ እየተቆጠረ 
መጥተህም ፍጥረት አልጠገበህ
ይኖራል ማራናታ እያለህ
'''
                  }),
              Song(
                  name: 'አለው ነገር',
                  videoURL: 'https://youtu.be/BcGnJIvFFBY?si=gVBeEOV7WsK4tCDT',
                  songLyrics: {
                    'lyrics': '''

አለው ነገር እግዚአብሔር  እንዲህ አብዝቶ ዝም ካለ
ጠላቴ ሆይ ደስ አይበልህ ቢመሽም ለኔ ቀን አለ

አንዳንዴ እንደዚህ እኮ ነው በተለይ ሊነጋጋ ሲል
በከንቱ መጨነቅ ማልቀስ ሰው አይኑ ጉም እስኪመስል
ግድየለም እስኪ ልቻለው ይቻላል ሁሉ በጌታ
እንባዬን ከአይኔ ያብሰዋል ይመጣል የማታ ማታ

ህመሜ ሲበረታብኝ ምንጣፌን በእንባዬ አጥባለሁ
ጠብቄ ጠብቄ ሳጣ አንዳንዴ በአፌ እስታለሁ
የለኝም ሰው እኮ የለኝም ማለቴ በከንቱ ነበር
አምላኬ ለካስ ቀን አለው የሞቴን ቀንበር ለመስበር

ኤልዛቤል ብትነሳብኝ የሐሰት ምስክር ቆጥራ
ሌሊቱ እጅግ ቢረዝም ሰነፉ በአፉ ቢያወራ
አምናለሁ አለ በሰማይ ዳኛዬ አያንቀላፋም
ለጊዜው ይመስላል እንጂ እመኑኝ እውነት አይጠፋም

ደመና ነፋስም ባይኖር ቃዴስን ያረሰርሳል
በፍርዱ ድንቅ ነው ሁሌም ከንፈሩ ሞገስ ያፈሳል
ዝም አለ ዝም ከለ አትበሉ ዝምታ ውበት ነው ጌጡ
ተራሮች ፊቱ ዘለዋል ሰማያት ቃልን ሲሰጡ
'''
                  }),
              Song(
                  name: 'ተከትዬሀለሁ',
                  videoURL: 'https://youtu.be/-EfIwn3AH_Y?si=I83IoC_PuomrpTdq',
                  songLyrics: {
                    'lyrics': '''
ተከትዬሀለሁ 
አንተን አምኛለሁ
አትተወኝ ጌታዬ
እለምንሃለሁ (x2)

ተከፍሎ አልቋል የእኔ ዘመን
ንፋስ መከተል ሆኖብኝ ቀን
መሽቷል ተመለሽ አላልከኝም
እንደ አገልጋይህ ቆጠርከኝ(x2)

ኑሃሚን ነፍሴ ተመለሺ
የሞተልሽን እንዳትረሺ
ስሙን መርጬ ብሰደድ
በእሾህ ታጠርኩኝ ከመንገድ

ከተውከኝማ ከጣልከኝ
ማን ዘመድ ሆኖ ሊያኖረኝ
አንፃኝ ጌታዬ ከበረዶ
ማን ጎድሎ ያውቃል አንተን ወዶ(x2)

በሩቅ የማውቅህ አይደለህም
ሲቀርቡህ ማር ነህ ለዘላለም
ናታኒም አርገኝ በትሕትና 
ፍቅርህ አለሜን ሽሯልና(x2)
'''
                  }),
              Song(
                  name: 'በሂሶጵ እርጨኝ',
                  videoURL: 'https://youtu.be/r65HEHdzNGU?si=wn_ipcbfgJobBVFR',
                  songLyrics: {
                    'lyrics': '''
በሂሶጵ እርጨኝ እነፃማለሁ
ውዴ በደሌን እኔ አምኛለሁ
የልብስህን ዘርፍ በእምነት ይዣለሁ
ሊቀ ካህኔ ማረኝ እላለሁ

በእንባ ነበር የጠበኩህ ደጆቼን ከፍቼ
ለእግሮችህም መራመጃ ምንጣፌን ዘርግቼ
አትለፈኝ መድሀኒቴ ቤቴን ሳትጎበኘው
ከፃድቃኑ መች ሆነና ጉዳይህ ከኔ ነው
አሜን እላለሁ አሜን(x2)
አሜን እላለሁ አሜን ኢየሱስ ተመስገን

ልቤ እርቃኑን ዳር ላይ ቆሞ አንተን አንተን ይላል
ባንተ መዳፍ ካልታጠበ እንደምን ይነፃል
መንበርከኬን ለይቅርታ ወደሀል ጌታዬ
በሰላም ሂጂ ብለኸኛል ጠላት አይኑ እያየ
አሜን እላለሁ አሜን (x2)
አሜን እላለሁ አሜን ኢየሱስ ተመስገን

ልታነፃኝ ከበረዶ ውዴ ደም ለብሰሀል
ዳግም በግፍ እንድቆሽሽ ልብህ መች ይፈቅዳል
የቱም ዋጋ በማይከፍለው በታላቅ ውለታ
የገዛኸኝ ቤዛዬ ሆይ አንፃኝ በይቅርታ
አሜን እላለሁ አሜን (x2)
አሜን እላለሁ አሜን ኢየሱስ ተመስገን

ፍቅርህ ጠርቶኝ እንደመጣሁ አጥራኝ የኔ ጌታ
በትናንቱ ግብር እንዳልኖር ዛሬ እንድበረታ
አርፎብኛል የተረጨው ከጎንህ ላይ ደሙ
ከሞተ እምነት ለይተኸኝ ስራኝ ለመልካሙ
አሜን እላለሁ አሜን (x2)
አሜን እላለሁ አሜን ኢየሱስ ተመስገን
'''
                  }),
              Song(
                  name: 'ከአእምሮ በላይ',
                  videoURL: 'https://youtu.be/lk_p72d5jLc?si=RH6iKYPuW0AZ4-09',
                  songLyrics: {
                    'lyrics': '''
ከአእምሮ በላይ ከሕሊና በላይ
ከጥበብ በላይ ከእውቀት በላይ
የኛ ጌታ ሁሉን ቻይ
የኛ ንጉስ ኤልሻዳይ አለ በሰማይ

ክብሩ ልክ የለውም ለልብ ያስደንቃል
ሁሉም ለፈራጁ ቦታውን ይለቃል
ብቻውን የሚፈጥር ብቻውን የሚገዛ
ገናና ነው ጌታ የአለም ሁሉ ቤዛ

ይሾማል ይሽራል ይገድላል ያድናል
የገነት የሲኦል መክፈቻ ጨብጧል
መካሪ አያሻውም ለእጆቹ ስራ
መንግስቱ ዘላለም ግርማው የሚያስፈራ

በግሩም አይኖቹ ጥልቁን ይፈትሻል
ለስሙ የሞቱትን አጥንት ይጠብቃል
ኪዳኑን የሚያከብር ቃሉን የማይረሳ
ሁሉን ይፈፅማል ለፍርድ ሲነሳ

ደመናን ተጫምቶ በነፋስ በረረ
ማንንም አልተወም ግብፅን በረበረ
ለልጆቹ ብሎ ምን ያልሆነው አለ
ያንን ሁሉ ፍዳ መከራውን ቻለ
'''
                  }),
            ]),
        Albums(
            name: 'ባማዬ',
            photo: bamaye,
            realeasedDate: DateTime.now(),
            albumNumber: 03,
            songs: [
              Song(
                  name: 'ማርዳዬ ነህ',
                  videoURL: 'https://youtu.be/X8TbOlyPl4E?si=eMiT4wXFJn9vCKe_',
                  songLyrics: {
                    'lyrics': '''
ማርዳዬ ነህ ማጌጫዬ
ውበቴ ነህ መታያዬ
ምን ስም አለኝ ያላንተማ
ባታለብሰኝ ውቡን ዜማ

ያማርኩብህ ነጭ ልብሴ   የኖርኩብህ እስትንፋሴ
የልቤ ላይ ሰናፊል ነህ    ነበልባሉ የማይደፍርህ
ታሪኬን የትናንቱ    አልፎልኛል በአንተ ስንቱ
እልሀለሁ ማዕረጌ   ዛሬም ስምክን ከፍ አድርጌ

የተጣለች የተረሳች    ያችን ምስኪን ማን አነሳት
ብለው ምድሩን ሲያሸብሩት   ኢየሱስ ነው ብዬ አረፍኩት
በዚህ ሰው ስም አትመስክሪ   ስለ ውድሽ አትዘምሪ
ቢሉኝ ልቤን አያስችለው    ያልተውከኝን እንዴት ልተው

አክሊል ሆነህ ያነገስከኝ   ማማዬ ነህ ከፍ ያረከኝ
ትከሻህ ነው ሰገነቴ   ጉስቁልናህ ደም ግባቴ
ውዴ ጌጤ የሚያሰኘኝ  ሌትና ቀን በእንባ ሚያጥበኝ
ያ ፍቅርህ ነው የመስቀሉ   በልቤ አርፎ ገፅ ምስሉ

ሸለቆዬን የሞላልኝ   ድልድይ ሆኖ ያሻገረኝ
ሸክሜን ጥሎ ያንሳፈፈኝ   ከሞት ባህር ያተረፈኝ
የእግዚአብሔር ልጅ በአንተ ደም ነው   የነፍሴ አይኗ የተኳለው
ታይተህልኝ ታይቻለሁ   በመከራህ ተውቤአለሁ           
              '''
                  }),
              Song(
                  name: 'የአልባስጥሮስ ሽቱ',
                  videoURL: 'https://youtu.be/8cx4gk0iUVI?si=6xHPcPMQeNKWLKzp',
                  songLyrics: {
                    'lyrics': '''
የአልባስጥሮስ ሽቱ
 የእንባዬ ጅረቱ
ያንስብሀል ውዴ
ገና ነው መውደዴ

ከምኑም ላይጎድል ሰው ደጁን ቢከልል
ልትሰጠኝ ይቅርታ   ታማህ የኔ ጌታ
ብልቃጤን ሰብሬ  አብሼህ በፀጉሬ
እግሮችህን ስሜ   ተነሳሁ ታክሜ

ስገፋህ ችለህ ደግፈህ
ስርቅህ በፍቅር ቀርበህ
ስራዬን የሰራህልኝ
ወዳጄ ተመስገንልኝ

ጠላት ይዞ ድንጋይ   ልወገር ልሰቃይ
ሲቆጠር መሞቴ   ደርሰሀል አባቴ
ከሳሽ ወዴት አለ   ጥሎኝ ኮበለለ
ከኔ ጋር የቀረህ   የዘላለሜ ነህ

ስገፋህ ችለህ ደግፈህ
ስርቅህ በፍቅር ቀርበህ
ስራዬን የሰራህልኝ
ወዳጄ ተመስገንልኝ

ሲረግሙኝ መመረቅ   ስቃይህን መስበክ
ግብሬ ነው ለኔማ   ለዳንኩት ስትደማ
ቀኑን ቢገደሉም   ስቃይ ቢቀበሉም
አይወጣም ያንተ ፍቅር    ያልፋል ከመቃብር

ስገፋህ ችለህ ደግፈህ
ስርቅህ በፍቅር ቀርበህ
ስራዬን የሰራህልኝ
ወዳጄ ተመስገንልኝ

የአይሁድ ተረታቸው   ስድብ ነቀፋቸው
ባይኖረውም ማብቂያ   የማህፀኑ ግፊያ
ከአንተ ጋር ነው ትግሌ   ፍቅር ነው በቀሌ
ቢሹም እንድርቅህ   ማልኩኝ እንዳለቅህ

ስገፋህ ችለህ ደግፈህ
ስርቅህ በፍቅር ቀርበህ
ስራዬን የሰራህልኝ
ወዳጄ ተመስገንልኝ           
              '''
                  }),
              Song(
                  name: 'ያላንተ ሁሉ',
                  videoURL: 'https://youtu.be/n5HHf1wK3MA?si=lBJBK-IrO0ROLgRi',
                  songLyrics: {
                    'lyrics': '''
ያላንተ ሁሉ ቢኖረኝ
እርካታ ሰላም ላይሆነኝ
በልቤ ዙፋን ልሹምህ
አኑረኝ በፍቅር አቅፈህ

ስብና ወይን አልጎደለኝ
ክብር ንዋይ አልተለየኝ
በጥጋብ ውስጥ የምራበው
የህሊና ሰላምን ነው
እንበረከካለሁ የምሻውን እስካየው
እንባዬን ወዳንተ እረጫለሁ
ጥማቴን አስታግሰው በፍቅርህ ጠብታ
መልሰው የነፍሴን ፀጥታ

አያምርብኝ ቀጭን ልብሴ
አንተን ሳትለብስ እርቃን ነፍሴ
ሰገነቱ ሸለቆ ነው
ጌታ ኢየሱስ ከሌለኸው
ይመቸኝ አልልም ክንድህን ገፍቼ
ከጠባቡ መንገድ ወጥቼ
የሰፋው ጎዳና የተደላደለው
ፍፃሜው የማይቆም ለቅሶ ነው

ካለህልኝ ሁሉም አለኝ
ከሌለኸኝ አንድ አይኖረኝ
የመጣሁት ራቁቴን ነው
እኔም የኔም የራስህ ነው
ነፋስን መከተሌ አይሁን ህይወቴ
ሰብስበኝ በፍቅርህ አባቴ
ለዛሬው ስደክም ለሚያልፈው ስለፋ
ከዘላለም መዝገብ አልጥፋ           
              '''
                  }),
              Song(
                  name: 'ዛሬስ ለየት ይላል',
                  videoURL: 'https://youtu.be/C81J5mf_t_E?si=tY499f0QE1613vw7',
                  songLyrics: {
                    'lyrics': '''
ዛሬስ ለየት ይላል አጀቡ ብዙ ነው
እንደ ሰው ሚቆጥረኝ ሚራራልኝ ማነው
ዘማዊ ነው ስሜ በዓለም የረከሰ
ባገኘሁትና ውስጤ በታደሰ

ወረተኛዋ ዓለም ፈጥና ምትሰለቸው
እንዲሁ እንደዘበት ስንቱን ጉድ ሰራችው
አልሞትም በክንዷ የሞተልኝ አለ
ልጄ ሆይ የሚለኝ እየተከተለ

የተከፈተ በር ከሰጠኝ ወዳጄ
ምህረትን ልቀበል ልገስግስ ማልጄ
የአልባስጥሮስ ብልቃጥ ከምሀዬን ይዤ
ልፈልገው እንጂ በእንባዬ ተጉዤ

እራት አለው ዛሬ ሲባል ሰምቻለሁ
ከፈሪሳዊው ቤት በምኔ እገባለሁ
ረክሳለች እያሉ ሰዎች ያገሉኛል
ጌታዬ ግን ቸር ነው ያገለግለኛል
አባቴ ግን ቸር ነው ያገለግለኛል
ኢየሱስ ግን ቸር ነው ያገለግለኛል           
              '''
                  }),
              Song(
                  name: 'ባማዬ',
                  videoURL: 'https://youtu.be/h9mQ9NYdz7k?si=7FAfu1tmApnJOMJt',
                  songLyrics: {
                    'lyrics': '''
ባማዬ እልሀለሁ የሕይወቴ ከፍታ
ይዞኛል ትከሻህ ችሎኛል የኔ ጌታ
አለሁኝ ስላለህ በዙፋንህ
በስስት እያየኝ ሁሌም የፍቅር አይንህ

አንተ ባታስበኝ ማን ያስበኝ ነበረ
ለዚህ ነው ማነባው አንደበቴ እያጠረ
በተዘለዘልኩበት እያቃሰትኩኝ ደርሰህ
እቅፍ ድግፍ አርገህ ያባበልከኝ አንተ ነህ
እንባዬን ከአይኔ አብሰህ

ስለቀደምክልኝ ጠላቴን ቀድሜአለሁ
አይኔን ይዘህልኝ ስንቱን ተሻግሬአለሁ
አንተ በባህሩ እኔን በጀርባህ አዝለህ
ሰጠኸኝ ዜማህን ሁሉንም አሳልፈህ
ፀጋህን አትረፍርፈህ

ካየሁት መከራ ያላየሁት ይበዛል
ክንድህ ጣልቃ ገብቶ ስንቱን መክቶልኛል
ዛሬ በሰገነት እንዲህ የምዘምረው
አንተ በመስቀል ላይ እንዲያ ሆነህልኝ ነው
ስንቱን ችለህልኝ ነው

ሳትዝል ተሸክመህ ስገፋህም ደግፈህ
እንደ አባትነትህ ልጅነቴን ታግሰህ
እኔ የዛሬውን አንተ ለዘላለሜ
ተራቁተህልኝ ነው በፍቅርህ መሸለሜ
በፍቅርህ መታመሜ           
              '''
                  }),
              Song(
                  name: 'አላፍርበትም',
                  videoURL: 'https://youtu.be/ZnoHCY8Z674?si=JFmXFBymS2CAMJCJ',
                  songLyrics: {
                    'lyrics': '''
አላፍርበትም
ያመንኩትን አውቀዋለሁ
አላፍርበትም 
ለታመነው ታምኛለሁ

ማዕረጌ ነው እስራቴ
ኅብሌ ነው ሰንሰለቴ
እመካለሁ በመከራ
አምኛለሁ እንዳልፈራ
ምን ቢደከም ምን ቢመከር
የእግዚአብሔር ቃል አይታሰር
ፍቅሩ ሰብሯል ዝምታዬን
ማን ሊቀማኝ እልልታዬን

ከእርሱ ጋር ሞት ትንሳኤ አለው
ያለ እርሱ ግን ሕይወት ሞት ነው
ባናምነውም ታምኖ ይኖራል
ራሱን ሊክድ መች ይችላል
ያምናል ልቤ በዚህ ጌታ
አላዜምም ለሰው ደስታ
የታዘዝኩት በቃሉ ነው
በኢየሱስ ስም እንዳደርገው

በእምነት እንቢ የሚያሰኘኝ
ከእልፍኝ ስደት ያስመረጠኝ
ውለታው ነው ብድራቱ
መዳፋ ነው እትራቱ
መነቀፌ ብልጥግና
መከራዬ ድል ነውና
በሸንጎ ፊት ቃሌ አንድ ነው
የተቤዠኝ ኢየሱስ ነው           
              '''
                  }),
              Song(
                  name: 'እግዚአብሔርን ወድጄዋለሁ',
                  videoURL: 'https://youtu.be/YQz5JEnfIVU?si=Ja9pNSiLcrQhBfzO',
                  songLyrics: {
                    'lyrics': '''
እግዚአብሔርን ወድጄዋለሁ
ያዳነኝን ወድጄዋለሁ
ኢየሱስን ወድጄዋለሁ
መድሀኒቴን ወድጄዋለሁ 
አሜን ተማርኬያለሁ
አሜን የርሱ ሆኛለሁ

ከአእላፍ የተመረጠ
በልቤ እልፍኝ የተቀመጠ
የቆላ አበባዬ ውዴ ነው
ዝርግፍ ጌጤ ለኔ ኢየሱስ ነው

ዝሎ ታስሮ ህልሜን የፈታ
ደም ተነክሮ ጭንቄን የገታ
እንደ ማህተም ቀርፆኝ በልቡ
ያኖረኛል ውዴ እንደ ሀሳቡ

እስከ ሞዓብ በፍለጋዬ
ተንከራቷል ፍቅር ጌታዬ
ይኸው ሰልፌን ተሰልፎልኝ
በርሱ ድካም ባለማዕረግ ነኝ            
              '''
                  }),
              Song(
                  name: 'አሳጣኸኝ ሰበብ',
                  videoURL: 'https://youtu.be/ya8GzbOJyS8?si=EKvxVfGKZXc_J7Ox',
                  songLyrics: {
                    'lyrics': '''
እኮ በምን በምን በምን ምክንያት አንተን
ኧረ በምን ሰበብ ከፊትህ እሸሻለሁ
ሁሉን ሙሉ አድርገህ ምክንያቴን ቀብረኸው
አሳጣኸኝ ሰበብ እንግዲህ ዝም ነው

ከምናገርለት ከማወራው በላይ
ያስተዳድረኛል የሰው መሶብ ሳላይ
የማለዳ ፀሀይ እያወጣህ ለኔ
አልደከመም ክንዴ አልጨለመም ቀኔ

መርከቤ ሲሲበር ቀዝፌያለሁ ባንተ
ድል በድል ሆኛለሁ ከኔ ጋራ ዘምተህ
ስትመክር ስታድን ማን ይቃወምሀል
ጠላቴን እልሁን አስጨርሰኸዋል

ገና ሳልናገር የማስበውን
እንዲህ ነው ዘመኑ ባንተ ሚታመን
ከሰናፍጭ ቅንጣት መዘነች ሕይወቴ
ጌታ ታውቃለህ ስል እየሞላ ቤቴ            
              '''
                  }),
              Song(
                  name: 'ቦኤዜ',
                  videoURL: 'https://youtu.be/fOlbL-mKjhk?si=hL037Fh4QxP0nwhf',
                  songLyrics: {
                    'lyrics': '''
ለሕዝቤ መዳን እንዲመጣ
ኑሀሚን ተከትዬሽ ልውጣ
ሙሉ ነው ፍፁም ነው ደመወዜ
ዋርሳዬ ካለልኝ ቦኤዜ
ኢየሱስ ካለልኝ ቦኤዜ
ወዳጄ ካለልኝ ቦኤዜ
ሚቤዠኝ ካለልኝ ቦኤዜ

ልነሳ ልከተልሽ እንጂ በእምነት
እግሮቼ ፈጥነው ይጀምሩ ስግደት
በሞዓብ ምን አለኝ ከእንግዲህ የቀረ
እልልታ ደስታዬም ቆየ ከቀረ

ምስኪኗ በፊቱ ካገሁ ሞገስ
ጉልበቴ በሌላ እርሻ ለምን ይፍሰስ
ቀለቤን ሰፍሮልኝ ካኖረኝ እጁ
ከሞዓብ እኔስ በልጦብኛል ደጁ

በደሙ ታጥቤ ከበደል ነፃሁ
የፀጋ ዘይቱ ፈስሶብኝ ወዛሁ
ነጋልኝ ከሙሽራዬ ጋር ሌቱ
በእቅፉ ሆኜ አልፎልኛል ስንቱ

ከአብራኬ ኢዮቤድን ስጠኝ ጌታ
ተቆጠርኩ ከታላላቆቹ ተርታ
የቤዠኝ ቦኤዜ ኢየሱስ ነው ክብሬ
እንግዲህ የኋላዬን አላይ ዛሬ            
              '''
                  }),
            ]),
        Albums(
            name: 'መንፈስ ቅዱስ',
            photo: menfesKidus,
            realeasedDate: DateTime.now(),
            albumNumber: 04,
            songs: [
              Song(
                  name: 'በሞት ሀገር',
                  videoURL: 'https://youtu.be/kBIJmJohv5Q?si=MlSVuX6hq80kC0X7',
                  songLyrics: {
                    'lyrics': '''
በሞት ሀገር የተሰማ
የነፃነት የድል ዜማ
አማኑኤል ኢየሱስ ነው
የምስራች ቃል የሆነው

አለም በግፍ በደም ቀልማ
ሞት የሰው ነፍስ እየቀማ
የሲኦልን መውጊያ ሰብሮ
ነፃ ወጣን አዋጅ ሽሮ(x2)

ቤተልሔም ያስተጋባው
የጌታ ድምፅ የተቀባው
ቀራንዮን እያማጠ
ሞታችንን በሞት ዋጠ(x2)

ለቅሷችንን ሳቅ አርጎታል
እንባችንን አብሶታል
መሰንቋችን ይውረድና
እናምልከው በምስጋና(x2)

የአጥቢያ ኮከብ የንጋት
የአዲስ ዘመን መሠረት
ፈርቶ ሸሽቷል ሞት ጨለማ
በኢየሱስ ልዩ ግርማ(x2)            
              '''
                  }),
              Song(
                  name: 'ኧረ እንዳንተ ያለ',
                  videoURL: 'https://youtu.be/RzMqbnYL03A?si=NGsxb-jv7jvWFNFg',
                  songLyrics: {
                    'lyrics': '''
ኧረ እንዳንተ ያለ ከወዴት አለ 
የበደሌን ሸክም ያንከባለለ
ውዴ እንዳንተ ያለ ከወዴት አለ

ፃድቅ ጠፍቶ አንድ ሰው እንኳን
  በህጉ ፊት ሲመዘን(x2)
አይደለም በደላችን 
  ፅድቃችን መርገም ሲሆን(x2)
የእግዚአብሔር ልጅ ተገልጠህ
  የጠላት ምክሩ ፈርሷል(x2)
ኢየሱስ እርቃን ሆነህ
  ትውልዱ ምህረት ለብሷል(x2)

ባሪያዋን እንድታነግስ
  የባሪያን መልክ ይዘሀል(x2)
እንባዬን የአይኔን ጅረት
  በደምህ ገድበሀል(x2)
የልቤ ልብ አንተ ነህ
  ነፍሷ አኮ ነህ የነፍሴ(x2)
መኖሬ ህልም ነበር 
  ባትሆነኝ እስትንፋሴ#2)

ለፃድቅ ነፍሱን ሚሰጥ 
  በጭንቅ ይገኝ ይሆናል(x2)
ገና ደካማ ሳለሁ
  አንተ ግን ወደኸኛል(x2)
በሞትህ እንደታረቅሁ
  በሕይወትህ ድናለሁ(x2)
የዘላለም መስዋዕቴ
  ዘላለም አምንሀለሁ(x2)

በኪዳን ነው ሕይወቴ
  በኪዳን ነው ኑሮዬ(x2)
ደምህ ነው ማህተቤ
  ያጌጥኩበት ድሪዬ(x2)
ሞትክን በሚመስል ሞት 
  ካንተ ጋር ብተባበር(x2)
በትንሳኤ ታድሼ
  በረራለሁ እንደ ንስር(x2)            
              '''
                  }),
              Song(
                  name: 'መንፈስ ቅዱስ',
                  videoURL: 'https://youtu.be/xC-TvXHkZ00?si=D-RzU-x8eiQc8YDL',
                  songLyrics: {
                    'lyrics': '''
መንፈስ ቅዱስ አገዘኝ 
ዘምሪ ዘምሪ አለኝ
በእሳት ልሳን አጠበኝ
እንዳልፈራ አደረገኝ

መንፈስ ቅዱስ ሁሉን ያውቃል  ከሕሊና ይረቃል
ይቅር ይላል ሀጢአትን   ያስተምራል ምህረትን
ከአብና ከወልድ ጋር  በእኩልነት የሚኖር
ከሶስቱ አካል አንዱ ነው   አለሙን የሸፈነው

በማርያም ቤት ተቀምጠው   በሞት ፍርሀት ተውጠው
አይተንሀል ተገልጠህ   ስታፀና ለውጠህ
ፈሪዎችም ደፈሩ   በመንፈስህ ሲከብሩ
ሙሉ ሆነው ሲወጡ   ለሞት እንኳን ቆረጡ

ስውሩን የሚገልጠው   ልቤን የሚያሳርፈው
አፅናኜ ነው መካሪዬ   መሪዬ ነው መምህሬ
ሲናገረኝ ሰማለሁ  ሲያበረታኝ ሰማለሁ
አባ አባት ሚያሰኘኝ  እርሱ ነው ሀይል የሆነኝ

ሰይጣንን ተቃወምነው   አግዘኸን መታነው
በዚህ ክፉ ዘመን   ድል ነው ያንተ መሆን
ሲዝልብኝ መንፈሴ    ማረፊያ ነህ ለነፍሴ
ደምቆ ታየኝ አውነቱ   ሲዳስሰኝ እሳቱ            
              '''
                  }),
              Song(
                  name: 'ቀን ያስጎነብሳል',
                  videoURL: 'https://youtu.be/ZIRrJ-NbGLc?si=2WGFkcRbmDOCSEuV',
                  songLyrics: {
                    'lyrics': '''
ቀን ያስጎነብሳል
እግዚአብሔር ያነሳል(x2)
የሰው ፍቅር ያልቃል
ያንተ ግን ይዘልቃል(x2)

ተጥሎ ነበረ መርዶክዮስ በአደባባይ
መርሳት በማይችሉት በጌታ አይኖች እስከሚታይ
የጌታ ቀን መጣ የንግስና አዋጅ ታወጀ
ለካስ ቤተ መንግስት ዙፋን ነበር የተዘጋጀ

የሚያነግሰው ይመጣል የሚያነግሰው
ሹመትና መወደድ የለም ከሰው
ዋጋ ከፍሎ ያኖረን በልዕልና
ጌታ እኮ ነው አክብሩት በምስጋና

ከእናቱ ማህፀን እውር ሆኖ የተወለደው
ከሰዎች መካከል በጉድለቱ የተወገደው
ኢየሱስ አገኘው በምራቁ አይኑን አበራ
በደስታ ዘለለ እኩል ሆኖ ከሰዎች ጋራ

የሚያነግሰው ይመጣል የሚያነግሰው
ሹመትና መወደድ የለም ከሰው
ዋጋ ከፍሎ ያኖረን በልዕልና
ጌታ እኮ ነው አክብሩት በምስጋና

አባቱ የረሳው ለንግስና ያላሰበው
ከበጎቹ ጋራ በበረሃ የሚኖረው
የተናቀው ዳዊት ተቀብቶ ይኸው ነገሰ
ከምስጋና ጋራ ነፍሱን ላንተ ስላፈሰሰ

የሚያነግሰው ይመጣል የሚያነግሰው
ሹመትና መወደድ የለም ከሰው
ዋጋ ከፍሎ ያኖረን በልዕልና
ጌታ እኮ ነው አክብሩት በምስጋና

ይጠብቃል እንጂ እስኪወጣ ዳግም ፀሀይ
ዮሴፍ ንጉስ ሆኗል ጊዜው ሲደርስ በግብፅ ላይ
አብረኸው ተሽጠህ ክብርና መንገዱ ሰፋ
ለሸጡት ጨካኞች አደረከው መድሀኒት ተስፋ

የሚያነግሰው ይመጣል የሚያነግሰው
ሹመትና መወደድ የለም ከሰው
ዋጋ ከፍሎ ያኖረን በልዕልና
ጌታ እኮ ነው አክብሩት በምስጋና

ቀን እጅግ ቢከፋም የሚወዱን ፍቅራቸው ቢያልቅም
የዚህ አለም ኑሮ ቢያስመርረን ብንጨነቅም
ብርሃንን ለብሰን ሰማያትን እንወርሳለን
ሁሉን እናልፍና ከጌታ ጋር እንነግሳለን

የሚያነግሰው ይመጣል የሚያነግሰው
ሹመትና መወደድ የለም ከሰው
ዋጋ ከፍሎ ያኖረን በልዕልና
ጌታ እኮ ነው አክብሩት በምስጋና           
              '''
                  }),
              Song(
                  name: 'ባርኮትህ',
                  videoURL: 'https://youtu.be/xyW3VEdNvFg?si=lFG3GLlWMzJOsQww',
                  songLyrics: {
                    'lyrics': '''
ባርኮትህ ባረከልኝ ሕይወቴን
በመዳፍህ ዳሰህልኝ እልፍኜን
ትናንትናን ትናንት ያልኩት ባንተ ነው
ካንተ በቀር ነገስ ተስፋዬ ማነው

አንተው ማልቀሻዬ አንተው ነህ መፅናኛዬ
ትከሻህ ሆኖ እንጂ እኔማ ምኑን ችዬ
በፈረሰው ባትቆም በጎደለው ባትሞላ
ሕይወት ከንቱ ነበር የማይጨበጥ ጥላ

አላማህ እኔ ነኝ አንተው ነህ አላማዬ
ታይልኝ ኢየሱስ ታይልኝ ውብ አርማዬ
ውድቀቴን ወድቀኸው ሆነኸኛል ከፍታ
ምስክርነቴን አይዳኘውም ሁኔታ

መንግስትህንና ፅድቅህን አስቀድሜ
ሳገለግል ስሮጥ ስዘምርልህ ቆሜ
አንዳች የሌለኝን ሁሉን ጨምረህልኝ
ሞሸርከኝ በፍቅርህ ጎጆዬን ሰርተህልኝ

አያልፍም ባልኩት ላይ አልፈህበት ወዳጄ
ባረኩህ በእንባዬ ከመስቀሌ ወርጄ
ምን ዜማ አለኝና ዜማዬን ልቀይረው
እንደ ሰው አይደለም ያለሁት እንዳንተ ነው 
'''
                  }),
              Song(
                  name: 'እኔስ ለአምላኬ',
                  videoURL: 'https://youtu.be/0lLJHr3ouOs?si=hSXcOxjvDd18nmSQ',
                  songLyrics: {
                    'lyrics': '''
እኔስ ለአምላኬ እኔስ ለእግዚአብሔር 
ምስጋና አለኝ ምስጋና አለኘኝ
ዉለታው ስለበዛብኝ ውለታው ስለበዛብኝ

አሳዳሪዬ መጋቢዬ    የነፍሴን ጩኸት የምትሰማኝ
ካንተ ጋር ስኖር በዘመኔ   ክፉ ትዝታ የለኝ እኔ

ስለእርሱ ማወራው ብዙ ነገር አለኝ
ዘመንና እድሜ ጤና ከተሰጠኝ
ስለ እርሱ ማወራው ብዙ ነገር አለኝ
ዘመንና እድሜ ጥበብ ከተሰጠኝ

ከግብፅ ያወጣኝ ከባርነት    ባሕርን ከፍሎ በታምራት
መንገዴን በእሾህ ያሳለፈኝ  ከመስቀሉ ስር ያሳረፈኝ

ስለእርሱ ማወራው ብዙ ነገር አለኝ
ዘመንና እድሜ ጤና ከተሰጠኝ
ስለ እርሱ ማወራው ብዙ ነገር አለኝ
ዘመንና እድሜ ጥበብ ከተሰጠኝ

አለ ቅባቱ በላዬ ላይ  ከፍ የሚያደርገኝ እስከ ሰማይ
ለታረደው በግ ምስክር ነኝ   ቅኔ በገና ያስታጠቀኝ

ስለእርሱ ማወራው ብዙ ነገር አለኝ
ዘመንና እድሜ ጤና ከተሰጠኝ
ስለ እርሱ ማወራው ብዙ ነገር አለኝ
ዘመንና እድሜ ጥበብ ከተሰጠኝ

እየባረኩህ ልኑርልህ   እየዘመርኩኝ ልሙትልህ
የማልጠቅመውን ከጠራኸኝ   ላንተ ብቻ ነው የሰራኸኝ

ስለእርሱ ማወራው ብዙ ነገር አለኝ
ዘመንና እድሜ ጤና ከተሰጠኝ
ስለ እርሱ ማወራው ብዙ ነገር አለኝ
ዘመንና እድሜ ጥበብ ከተሰጠኝ
'''
                  }),
              Song(
                  name: 'ሊቀ ካህናት',
                  videoURL: 'https://youtu.be/5XW1VmjsCKo?si=sqeIFxWapvfdwJZu',
                  songLyrics: {
                    'lyrics': '''
ሊቀ ካህናት ኢየሱስ ሊቀ ካህናት
የአዲስ ኪዳን በግ ንፁህ መስዋዕት 
መስዋዕትም አቅራቢም ተቀባይም ሆነ
በደሙ ቤዛነት ፍጥረት ሁሉ ዳነ

የበግ የዋኖሱ    ብዙ ደም ቢያፈሱ
የብሉይ ካህናት    ቢቆሙም በእርሱ ፊት
የሞት አገልግሎት   ሆኖባቸው ድግምት
መሲሁን ናፈቁ    አዳኙን አወቁ(x2)

ክርክር የለኝም    አላጉረመርምም
አመሰግናለሁ    በደሙ ድኛለሁ
እንደ መልከ ፄዴቅ    የነገሰው በፅድቅ
ታላቅ ናት ክህነቱ    ዘላለም መንግስቱ(x2)

መድሀኒት ተገልጧል    እኛም አይተነዋል
ሞታችን ተገድሏል   በፀጋው ድነናል
በይስሐቅ ፈንታ   የተሰዋው ጌታ
እንደ በግ ታረደ   ሁሉንም ወደደ(x2)

ስንሰቃይ አይቶ   ክብሩን ሁሉ ትቶ
በስቃይ ደቀቀ   ሊያነሳን ወደቀ
ሲዖል ተበዝብዟል   ስልጣኑ ተይዟል
ለተቤዠን ንጉስ   ምስጋናችን ይፍሰስ(x2)
'''
                  }),
              Song(
                  name: 'ዋላ',
                  videoURL: 'https://youtu.be/HwwiB-IInBw?si=RMazJ1pPFZ2Vws2Y',
                  songLyrics: {
                    'lyrics': '''
ዋላ ወደ ውሃ ምንጭ 
እንደሚናፍቀው
ነፍሴ አንተን ተጠምታለች 
ወዴት ነህ እያለች

ወዴት ነው ሲሉኝ አምላክሽ የታለ
እንባ በአይኔ ሞላ ልቤ አልፀናም አለ
ነፍሴ ፈሰሰች እንደ ክረምት ውሃ
ክብርህን አሳየኝ ልኑር በፍሰሐ 

ውዴ ልበልህ መታመኛዬ
የክብሬ ብቃት ሁለንተናዬ
እቃትታለሁ አንተን ፍለጋ
አንተ ነህ ትርፌ የላቤ ዋጋ

መደምደሚያዬ ነህ የሕይወቴ ፍፃሜ
ደምህን ስቀበል ተፈውሷል ደሜ
አታውኪኝ ነፍሴ እመኝ በጌታ
ወዳጅሽ እርሱ ነው የክብርሽ ከፍታ

ውዴ ልበልህ መታመኛዬ
የክብሬ ብቃት ሁለንተናዬ
እቃትታለሁ አንተን ፍለጋ
አንተ ነህ ትርፌ የላቤ ዋጋ

ማዕበል ሞገድ አለፈ በላዬ
ከእንቅልፌ ነቃሁኝ ሲበዛ ስቃዬ
ከአንተ ተለይቼ የለኝም በረከት
አሻግሬ ልይህ በሰማዩ መስኮት

ውዴ ልበልህ መታመኛዬ
የክብሬ ብቃት ሁለንተናዬ
እቃትታለሁ አንተን ፍለጋ
አንተ ነህ ትርፌ የላቤ ዋጋ
'''
                  }),
              Song(
                  name: 'የአለም ቤዛ',
                  videoURL: 'https://youtu.be/UBagVaZGU2Y?si=IFBtvrJP1N2Uwe-o',
                  songLyrics: {
                    'lyrics': '''
የአለም ቤዛ ኢየሱስ ነው
የፈወሰኝ ጌታ ነው
መዳን በሌላ የለም
እኔ አምናለሁ ዘላለም

በሞግዚቱ ስርዓት ፍጥረት ስላልዳነ
ለሚሻለው ኪዳን ኢየሱስ ዋስ ሆነ
ከባርነት ቀንበር የቤዠኝ በደሙ
ያዳነኝ እርሱ ነው ይስማልኝ አለሙ

አንዴ ለዘላለም ደሙ ፈሶልኛል
አሁን ያለ ሀጢአት ውዴ ይታይልኛል
ነፍሴን እንዲያነፃት ታርዷል ፋሲካዬ
በር ሆኖኝ ወደ ክብር አስገባኝ ጌታዬ

የዘላለም እርስትን የተናዘዘልኝ
መቃብሬን ቀብሮ በሰማይ ያለልኝ
ሞቶ በመስቀሉ ሰላም ያደረገው
እርሱ የአዲስ ኪዳን መካከለኛው ነው

እንድንበት ዘንድ ተሰጥቶናል ስሙ
አማራጭ የሌለው መዳኛ ነው ደሙ
ሞትን በሞት እንጂ መግደል የተቻለው
ከኢየሱስ በቀር ሌላ ጌታ ማን ነው

የመቅደስ አዛዦች እጅ ቢጫንብኝ
ከክርስቶስ ፍቅር መቼም ላይበልጥብኝ
በልቤ ያመንኩትን ልመስክረው በአፌ
አልችልም ዝምታ በሞቱ ተርፌ
'''
                  }),
              Song(
                  name: 'አንድ ጌታ',
                  videoURL: 'https://youtu.be/tA-sJSnIOck?si=S8PuQ26DeWuLdpQm',
                  songLyrics: {
                    'lyrics': '''
አንድ ጌታ ኢየሱስ አለኝ 
ክርስቶስ አለኝ
ሰልፌን ሰልፉ ያደረገልኝ
የሚዋጋልኝ
ማይፈታ ማህተቤ ነው ደሙ
ከፍ ላርገው አርማዬ ነው ስሙ

በኤሽታኦል ምድር ያነቃቃኝ መንፈስ
ጉልበቴን ያፀናው በዘይቱ መፍሰስ
ራዕይ አሸክሞ ልኮኛል ጌታዬ
ግንቡን ሳያፈርሰው አይቆምም ዜማዬ

አይኖቼን ከካራን ያነሳልኝ ፍቅሩ
ፅናት ያስተማረኝ ፅፎ በችንካሩ
ምድሪቱን ቢሰጠኝ ይሄ ምን ይገርማል
የሚያወርሰኝ ሰማይ ከዚህም ይሰፋል

አንድ ቀንድ እንዳለው ሀይሌን ያበረታ
በቃሌ መሽጎ ጠላቴን የመታ
ያዘመተኝ ንጉስ ተዋጊ ነው ጌታ
ሳይሰነዝር ሚጥል ትጥቅን የሚያስፈታ

አይደለም የነገን ያውቃል ዘላለሜን
ከማህፀን በፊት ያወጣልኝ ስሜን
የጠራኝ ታማኝ ነው ቀርፆኛል መዳፉ
የአሳዳጄ ትግል መሸነፍ ነው ትርፉ
'''
                  }),
            ]),
        Albums(
            name: 'ስለኔ ሚማልደው',
            photo: slene,
            realeasedDate: DateTime.now(),
            albumNumber: 05,
            songs: [
              Song(
                  name: 'እግዚአብሔር የፍጥረት መነሻ',
                  videoURL: 'https://youtu.be/At2FxidhvCk?si=Sc9_Ynp5Poqm9Th6',
                  songLyrics: {
                    'lyrics': '''
እግዚአብሔር የፍጥረት መነሻ እግዚአብሔር 
እግዚአብሔር የፍጥረት መድረሻ እግዚአብሔር 
እግዚአብሔር 

ፍጥረት ከመፍጠሩ በፊት ያለ የነበረ
ፀሀይ ከዋክብት ሳይኖሩ ከዘላለም ያለ
ሰማይና ምድር ገና ሳይፀኑ
እግዚአብሔር ግን ነው በዙፋኑ

ካለመኖር ወደ መኖር ሁሉንም ያወጣ
በቃል ብቻ ይሁን ብሎ ፍጥረትን ያመጣ
በየብስ ያሉትን በየወገኑ
ይሁን ስላለ ወጡ እንደቃሉ

ሁሉን በቃሉ የሚሰራ ሕይወትን የሚሰጥ
ጉምን ነፋሳት አየርን በእጁ የሚጨብጥ
ውሃን በልብሱ ማነው ሚቋጥር
እንደ ያህዌ እንደ እግዚአብሔር 

ማነው በደመናው መሐል ውኆችን ያሰረ
ባሕር ውቅያኖስን ሰፍሮ በእፍኙ ያኖረ
ከወዴት አለ የሚመስልህ
አንተ እኮ ጌታ ያው አንተ ነህ
'''
                  }),
              Song(
                  name: 'አለብኝ ውለታ',
                  videoURL: 'https://youtu.be/LCWZhX7vOIw?si=lygoSro_DMuPvIUd',
                  songLyrics: {
                    'lyrics': '''
ተናግሬ አመስግኜ ቆጥሬ
ማልጨርሰው
አለብኝ ውለታ በእንባዬ ምገልፀው

አክትሟል እያለ የእሷማ ነገር
ክፉ በአደባባይ መርዶ ሲያስነግር
አላማ ስላለህ አባቴ በእኔ ላይ
ሰው ሆንክልኝ ውዴ የሰውን እንዳላይ

እታመናለሁ እተማመናለሁ
ከፊቴ ቀድመህ ስንቱን አልፌያለሁ(x2)

ማረፊያዬ ነህ ውዴ መታመኛዬ
ማምለጫዬ ነህ ፍቅሬ መማፀኛዬ(x2)

በዚያ በጭንቁ ቀን አንተ ባትመጣ
እንደ ጠላት ሀሳብ ሞት ነበር የኔ እጣ
በአስጨናቂው ወጀብ መጠጊያ ከለላ
በምድረበዳው ላይ ሆነኸኛል ጥላ

አንተ ባትኖር ባትራራልኝ
በተሰበረው ባትቆምልኝ
ባትደግፈኝ ውዴ ማን ሊያግዘኝ
ባትቆምልኝ ፍቅሬ ማን ሊያቆመኝ
ባትኖርልኝ ውዴ ማን ሊያኖረኝ
ባትወደኝ ፍቅሬ ማን ሊያቀርበኝ

ከእሳት መሐል ብሄድ አያቃጥለኝም
ውሃ ላይ ብራመድ ከቶ አያሰጥመኝም
ለአይኖችህ ስስት ብርቅዬ ስለሆንኩ
ይሄው እኖራለሁ ማዕበሉን እያለፍኩ

እታመናለሁ እተማመናለሁ
ከፊቴ ቀድመህ ስንቱን አልፌያለሁ(x2)

ማረፊያዬ ነህ ውዴ መማፀኛዬ
ማምለጫዬ ነህ ፍቅሬ መታመኛዬ
መፅናኛዬ ነህ ውዴ ሁለንተናዬ
ከለላዬ ነህ ፍቅሬ ሁሉን መርሻዬ

ተናግሬ አመስግኜ ዘርዝሬ ማልጨርሰው
ትናትን ያለፍኩት በቸርነትህ ነው
'''
                  }),
              Song(
                  name: 'ለዘላለም እንጂ',
                  videoURL: 'https://youtu.be/mNyROU2YEJI?si=3JAkvjfBQOQGic-b',
                  songLyrics: {
                    'lyrics': '''
ለዘላለም እንጂ ለዛሬ አልሰራም
ስለ ሕይወት እንጂ ለመብል አልሰራም
ኢየሱስ እውነቴን መቼም አላስነካም

ለሰው እሺታ ለሚያልፈው ክብር ሆታ ተንበርክኬ
ከፀጋው ማማ ከፍቅርህ እቅፍ አልወጣ አፈትልኬ
አብ አትሞሀል በእውነት በፅድቁ ሕይወት ልታበዛ
ዘምቷል ዜማዬ ስምህን ይዞ ምርኮህን ሊያበዛ

ድንኳን በሚሆን ነገ በሚፈርስ የለኝ መተማመን
ቤቴን በደምህ የሰራኸውን ስራዬ አንተን ማምለክ
ለየቱ ኑሮ ለየቱ ደስታ አንተን እተዋለሁ
እውነትን ረግጠው ከፍ አልን ያሉት ሲወርዱ አይቻለሁ

እውነት እውነት ናት የላትም አድማ አድማቂ አጨብጫቢ
እንደ ሀሰት ማእድ የሚተራመስ ከብቦ ተመጋቢ
ከእግዚአብሔር የተቀበልኩህ እውነተኛ እንጀራ
ሳልጨምርብህ ሳልቀንስብህ መግለጥ የኔ ስራ

ስለ ዲናሩ ጦር አስከትቶ በእውነት ላይ መዝመቱ
ሶስት ቀን አይዘልም እውነትን ቀብሮ በሽልል ማሳቱ
ሰማይ ሚያሻግር የሚያዛልቀው አንተን መጣበቅ ነው
የዛሬ ድሎት መሸቃቀጡ የነገ ጅራፍ ነው
'''
                  }),
              Song(
                  name: 'የእግዚአብሔር መንፈስ ',
                  videoURL: 'https://youtu.be/kRj9mEor9Lo?si=Ka_2o99TP0vCZDEB',
                  songLyrics: {
                    'lyrics': '''
የእግዚአብሔር መንፈስ ወደ እውነት እኔን የመራህ
አለህ ከኔ ጋር መፅናናቴ ረዳቴ ነህ

የርስቴ መያዣ ህያው ማህተሜ
በልቤ ምትቃትት እስከነ ድካሜ
ኢየሱስ ጌታ ነው እንድል ሀይል የሆንከኝ
መምህሬ አንተ ነህ ሁሉን ያስተማርከኝ

ማራናታ እያልክ ከሙሽሪት ጋራ
ወንጌል ያስታጠቅሀት ፍሬ እንድታፈራ
በእውነት ቃል የኳልካት የአይኖቿን ሽፋሽፍት
አብረህ ትኖራለህ እስከ ጌታ መምጣት

የህይወት መንፈስ ነህ ህይወት የሆንክልኝ
ለአብና ለወልድ መኖሪያ ያረከኝ
አሁንም አበርታኝ በውስጤ ልጠንክር
ክርስቶስ በልቤ በእምነት እንዲኖር

እስኪሰማኝ ዘልቆ ህልውናህ ክብርህ
ከመታወቅ እስኪያልፍ መገኘት መኖርህ
ድካሜን ልታግዝ በውስጤ እየቃተትህ
አለህ በእኔ አፅናኙ ስለኔ እየማለድህ
'''
                  }),
              Song(
                  name: 'ሞቶ ለተነሳው',
                  videoURL: 'https://youtu.be/BBUWCdkLzyg?si=rKjTm28B6HahaXLn',
                  songLyrics: {
                    'lyrics': '''
ሞቶ ለተነሳው ለእርሱ እንድገዛለት
ለስጋዬ እንዳልኖር ፈፅሞ እንድሞት
በእኔ ውስጥ ሆኖ ልጁ ደስ ሊያሰኘው
የአብ አባታችን ፈቃዱ ይሄ ነው

በህግጋቶችህ እጅግ ደስ ይለኛል
መፈፀም ስሞክር ውድቀት ይከበኛል
ስጋዬን ልጎስም በጣሙን ደከምኩኝ
ፈቃዴን ስጠቀም የሀጢአት ባሪያ ሆንኩኝ

   አንተን ደስ ላሰኝ በታገልኩኝ መጠን
   ድካሜ ፀናብኝ የሀጢአት ባሪያ ሆንኩኝ
   በኔ በስጋዬ መልካም ነገር የለም
   ፅድቅህን ላረካ ከቶ አይቻለኝም

ለሞት ከተሰጠ ጎስቋላ ማንነት
ማነው የሚያድነኝ ከህሊና ጩኸት
እያልኩኝ ተጨነቅሁ ተስፋን ስለቆረጥኩ
የሚያድነኝን ሀይል አጥብቄ እየፈለኩ

   በጌታ በኢየሱስ ምስጋና ለእርሱ ይሁን
   ከሞትና ሀጢአት እርግማን ለዋጀን
   በመስቀሉ ስራ እንደ አዲስ ሊፈጥረን
   መልካሙን ለማድረግ አምጦ ወለደን

እየተገዛሁኝ በሀጢአት በሞት ህግ 
መልካሙን ለማድረግ ስሸሽ ሳፈገፍግ
ጌታዬ ኢየሱስ አዲስ ህግ አበጀ
በህይወት መንፈስ ህግ አርነት ታወጀ

   በመስቀሉ ስራ የራሱ አድርጎኛል
   በኔ ውስጥ ሆኖ አብን ደስ ያሰኛል
   በመንፈስ ነውና የምመላለሰው
   ከህጉ እርግማን ነፃ ወጥቻለሁ

መሞትንስ አንዴ ስለሀጢአት ሞቷል 
ከእንግዲህ ወዲህ ግን ለአባቱ ይኖራል
የእኔም ህይወት ይህ ነው በእርሱ ከብሬአለሁ
በክርስቶስ ሆኜ ለአብ እኖራለሁ

   ለሀጢአት ሞቻለሁ ለፅድቅ ህያው ሆኜ
   በመስቀል በሞትህ ከአንተ ጋር አንድ ሆኜ
   ይህንን በጥምቀት ደግሞ መስክሬአለሁ
   በትንሳኤው ህይወት እመላለሳለሁ
'''
                  }),
              Song(
                  name: 'ስለኔ ሚማልደው',
                  videoURL: 'https://youtu.be/CHuKCQzAqNM?si=_7OTKxyeEfCqWFeS',
                  songLyrics: {
                    'lyrics': '''
በሰማይ አለኝ እኔን ሚወድ
የኔ የምለው ዘዳጅ ዘመድ
የአዲስ ኪዳን በግ አስታራቂዬ
ኢየሱስ ውዴ ቀድሟል ቤዛዬ

ስለ አመፃዬ እየማለደ
በክፉዎች ፍርድ የተወገደ
በሸላቶች ፊት ዝምታን መርጦ
በግርማው አለ ሞትን ገልብጦ

በፈሰሰው ደም በመጋረጃው
መግባት ሆነልኝ ቀንቶኝ መሄጃው
በደምህ ጉልቀት ሆኛለሁ ደህና
መታረቂያዬ ህያው ነህና

ስለኔ ራሱን የሰጠው ጌታ ኢየሱስ ነው(x2)
ሕይወቱን ሰጠ መስቀል ላይ ሞትን እንዳላይ(x2)

እንደ መርገም ጨርቅ ፅድቄ ተቆጥሮ ሳለ በጌታዬ ዘንድ
ማን ያድነኛል ይታደገኛል እያልኩ ስፈልግ ዘመድ
አንድ እንኳ ጠፍቶ ፃድቅ በምድር ሁሉ ተጠርቆ በሀጢአት ቀንበር
ዘመኑ ሲደርስ የእግዚአብሔር ክንድ ከሴት ተወልዶ ሆነኝ ዘመድ

መሰማሪያዬ አንድያ በሬ
ፅኑ መሸሻ አለቴ ቅጥሬ
ያላንተ ቤዛነት አትድንም አለም
ደም ካልፈሰሰ ስርየት የለም

ስለኔ ራሱን የሰጠው ጌታ ኢየሱስ ነው(x2)
ሕይወቱን ሰጠ መስቀል ላይ ሞትን እንዳላይ(x2)

በእግዚአብሔር ፊት ስለኔ በፅድቅ ሊታይ ጣልቃ የገባ
መተማመኛ ከለላ ወገን አለኝ የሚያብስ እንባ
አቻ የሌለው ብቸኛ ምርጫ
ጌታ ኢየሱስ ነው ከሞት ማምለጫ
በስጋው በኩል በመጋረጃው በኢየሱስ ሆኜ ወደ አብ ገባሁ

ይህ ነው እውነቱ ስማኝ ወገኔ 
አንዱ ሞቶልኝ ፀንቷል መዳኔ
ስለኔ ዛሬም የሚማልደው
ሰው የሆነው ነው በአብ ቀኝ ያለው

ስለኔ ዛሬ የሚማልደው ጌታ ኢየሱስ ነው(x2)
አለኝ ጠበቃ በሰማይ ድካም እንዳላይ(x2)
'''
                  }),
              Song(
                  name: 'እግዚአብሔር በሁኔታ ',
                  videoURL: 'https://youtu.be/Cqbta8fUwvM?si=JlsiYTM5nR8PMwjb',
                  songLyrics: {
                    'lyrics': '''
እግዚአብሔር በሁኔታ አለውጥህ እኔ
በሚታየው አለካህም እኔ
አምባዬ ሆይ በሁኔታ አልመዝንህ እኔ
አንተን ትቼ አልደገፍ በአይኔ
ስራህ ትክክል ነው ፍፁም ነህ ሰሪዬ
እንደ ሸክላነቴ አሜን ነው ድርሻዬ

መከራው ዛሬ እንደጀመረ
ይህ አይኔ በእንባ ተነከረ
ዞር ስል ትናንትም ያው ነበር
መንገዴ ዙሪያዬ እሾህ አጥር
 ምን አዲስ ነገር ኖሮ ዛሬ
 እንዲያውም ልዝብ ነው ቀንበሬ
 ዋናውን መስቀሌን ወስደሀል
 እርጥቡን ተሸክመኸዋል

ጥበብም አንተ ጥበበኛ
ፍትሀዊ እውነተኛ ዳኛ
ነገሬን በፊትህ ልዘርጋ
ምክር የለኝ ከሚፈርሰው ስጋ
 በእንብርክክ እግርህን አቅፌ
 በእንባዬ ጥያቄዬን ፅፌ
 ያለ መልስ አላስቀረኸኝም
 በሀዘኔ ድንኳን አልተውከኝም

ቢጎድልም በለስ ባታፈራ
ማን ሊያርም ገብቶ ባንተ ስራ
እኔ ግን ባንተ ነው ደስታዬ
እያዜምኩ በመጠበቂያዬ
 ስትሰጥም አንተ ትክክል ነህ
 ስትነሳም አንተ ትክክል ነህ
 ቢጎድልም ጌታዬ አዋቂ ነህ
 ቢሞላም ጌታዬ አዋቂ ነህ
 ቢሆንም ኢየሱስ ጌታ ነህ
 ባይሆንም ኢየሱስ ጌታ ነህ
 ቢሆንም ኢየሱስ ጌታ ነህ
 ባይሆንም ኢየሱስ ጌታ ነህ
'''
                  }),
              Song(
                  name: 'ካንተ ተለይቼ',
                  videoURL: 'https://youtu.be/FEt6dc2DvQs?si=v3W-F0o7SeFNQa6f',
                  songLyrics: {
                    'lyrics': '''
ካንተ ተለይቼ አልችልም እኔ መኖር
ፍቅርህ በርትቶብኛል ውዴ ካንተ ጋር ልኑር

ውበትህ ያማረ መልከመልካም ነህ
መውደዴን ወደድኩት ታመምኩ በፍቅርህ
በአፍህ መሳም ሳመኝ ውድዬ አትልቀቀኝ
በፍቅር ካንተ ጋር መፍሰስ ነው ያማረኝ

ውዴ ፍቅረኛዬ ነው
አልጋችንም ለምለም ነው
የቤታችንም ሰረገላ የዝግባ ዛፍ ነው

ውዴ ፍቅረኛዬ ነው
አልጋችንም ለምለም ነው
የጣሪያችን ማዋቀሪያ የጥዱ ዛፍ ነው

በጡቶቼ መሐል ያኖርኩህ ከርቤዬ
ሁሌ ምታውደኝ ሆነህ በገላዬ
እንደ ወይኑ ቦታ በአይንጋዲ እንዳለው
ጣፍጦኛል መውደድህ እኔ ምን ልሁነው

ውዴ ፍቅረኛዬ ነው
አልጋችንም ለምለም ነው
የጣሪያችን ማዋቀሪያ የጥዱ ዛፍ ነው

ውዴ ፍቅረኛዬ ነው
አልጋችንም ለምለም ነው
የቤታችንም ሰረገላ የዝግባ ዛፍ ነው

በፍቅርህ ታምሜ ተነድፌአለሁ
ከጥላህም በታች ውዴ አርፌአለሁ
እንደ ከረመ ወይን ፍቅርህ አስክሮኛል
በአንተ ውስጥ ጠፍቼ ተድላ ሆኖልኛል

ውዴ ፍቅረኛዬ ነው
አልጋችንም ለምለም ነው
የጣሪያችን ማዋቀሪያ የጥዱ ዛፍ ነው

ውዴ ፍቅረኛዬ ነው
አልጋችንም ለምለም ነው
የቤታችንም ሰረገላ የዝግባ ዛፍ ነው

ታድሼ በፍቅርህ እንደ ህፃንነቴ
ዘመርኩኝ ለክብርህ በልጅ አንደበቴ
ለራስህ ያጨኸኝ ፍቅሬ የኔ መልካም
ከእንግዲህ ባሌ እንጂ በዓሌ አልልህም

ውዴ ፍቅረኛዬ ነው
አልጋችንም ለምለም ነው
የጣሪያችን ማዋቀሪያ የጥዱ ዛፍ ነው

ውዴ ፍቅረኛዬ ነው
አልጋችንም ለምለም ነው
የቤታችንም ሰረገላ የዝግባ ዛፍ ነው

እድፍና ነውር ሳይኖርባት ከብራ
ለራስህ ልታቀርብ ውቢቱን ሙሽራ
በፍቅርህ ራስህን ሰጥተሀታልና
ሌላ ቃል የለኝም ሙሽራዬ ሆይ ና

ውዴ ፍቅረኛዬ ነው
አልጋችንም ለምለም ነው
የቤታችንም ሰረገላ የዝግባ ዛፍ ነው

ውዴ ፍቅረኛዬ ነው
አልጋችንም ለምለም ነው
የጣሪያችን ማዋቀሪያ የጥዱ ዛፍ ነው
'''
                  }),
              Song(
                  name: 'ዘወር ዘወር ስል',
                  videoURL: 'https://youtu.be/BioQ7WqPgiE?si=lrnoG8Ujm2JYS40d',
                  songLyrics: {
                    'lyrics': '''
ዘወር ዘወር ስል
    የሚናገረኝን ድምፁን እንድሰማ
ዘወር ዘወር ስል
   የታረደውን በግ አየሁት በግርማ

ፍጥም በተዘጋው ደሴት
ዙሪያው መውጫው በሌለበት
በእስር ስሆን ለብቻዬ
ታየኝ ብቻውን ጌታዬ

   አይኑ የእሳት ነበልባል
   እግሩ ከነሀስ ያበራል
   ድምፁ እንደ ብዙ ውሃ
   ሸፋኝ የነፍስን በረሃ

ቀኙ ሰባቱ ከዋክብት
ከአፉ ሰይፍ ይወጣል ስለት
ፊቱ እንደ ፀሀይ ነበር
ግርማው አፍዝዞ የሚያስቀር

   እኔም ይሄንን አይቼ 
   ቆምኩኝ እንደ ሞተ ሆኜ
   እርሱም ቀኙን በኔ ጫነው
   ድምፁ ትንፋሼን መለሰው

የወርቅ መቅረዞቹ መሀል 
ያለው የሰው ልጅ ይመስላል
ታጥቋል በወርቅ ደረቱ
ራሱ በረዶ ንጣቱ

   ታርዶ የቆመ እርሱ ብቻ
   ዋስ ነው ሞትን መመከቻ
   በአየር ሆኜ ምቀበለው
    አሜን ኢየሱስ ጌታ ነው

ዛሬም ድምፁ ውስጤ አለ
አለሁ እንዳትፈሪ እያለ
አይዞሽ መክፈቻው በእጄ ነው
መሞት መዘጋት ታሪክ ነው

   ያለ የነበረ እኔ ነኝ
   ብሎ ልቤን ካረጋልኝ
   ኩሎኝ በደሙ ጠብታ
   ክብሬ ማለት ማራናታ
'''
                  }),
              Song(
                  name: 'ጌታ በወደደኝ',
                  videoURL: 'https://youtu.be/rKxSniVffsk?si=SG6afx9f-cCyD3DK',
                  songLyrics: {
                    'lyrics': '''
ጌታ በወደደኝ በዚያ ፍቅር ወንድሜን እወዳለሁ
ጌታ በወደደኝ በዚያ ፍቅር እህቴን እወዳለሁ
ጌታ በወደደኝ በዚያ ፍቅር ለሌላ እኖራለሁ
ጌታ በወደደኝ በዚያ ፍቅር ሁሉን እወዳለሁ

ዘላለም ስትካፈለው
የኖርከውን ፍጹም ፍቅርህን
በቅዱስ መንፈስህ ኃይል
በልቤ ላይ ማፍሰስህን
ተረዳው ልቤ አስተዋለ እኔን እንዳፈቀርከኝ
የሚወደደ ነገር ሳይኖረኝ ከዘላለም ፍቅር አካፈልከኝ

ፍቅርም እንደ ኢየሱስ ነው
ነፍስን እስከ መስጠት ነው

አብና እኔ አንድ አንደሆንን
እነሱም አንድ እንዲሆኑ
አባት ሆይ በእኔ እንዳለህ
እነርሱም በእኛ እንዲኖሩ
እኔንም በወደድክባት ፍጹምም በሆነች ፍቅርህ
በእነርሱ ደግሞ እንድትሆን
አባት ሆይ ይህን ለመንኩህ

ከሰማይ አውርደኸው የባሪያን መልክ ያስይዘኸው
ንግስናህን እንደመቀማት ሳትቆጥር ሰው መሆንህን
ፍቅር ነው መውደዴ ይዞህ
ገረመኝ እኔን መሆንህ
በተግባር ፍቅርን ያሳየህ
ውድዬ ኢየሱስ አንተ ነህ

እኔም ይህን ከአንተ ተማርኩኝ
ሁሉንም መውደድ ጀመርኩኝ
ምልክቴ አርማዬ ፍቅር ነው
ሰውን ሁሉ ባንተ እወዳለሁ
ቅዱሱን ቃልህን አንብቤ
የገባኝ እውነት ይሄ ነው
በፍቅር ብቻ ካልሆነ እግዚአብሔርን ያየው ማነው
'''
                  }),
              Song(
                  name: 'ደሙ ነው',
                  videoURL: 'https://youtu.be/0kdsFDuoTg4?si=R8Byd87OZZhnJHGa',
                  songLyrics: {
                    'lyrics': '''
ከእግዚአብሔር ጋር የታረቅሁበት
ወደ ቅድስት የገባሁበት
ደሙ ነው ደሙ ነው ደሙ ነው
ደሙ ነው ስለኔ ሚጮኸው

ከሚገለጠው ፅኑ ቁጣ
የሚያድን ነፃም የሚያወጣ
በቀራንዮ የፈሰሰው
ኢየሱስ ያንተ ቅዱስ ደም ነው

ከመርገም ሁሉ የሚያነፃ
የሚከልለኝ ከአመፃ
ዋጅቶ ያኖረኝ ማራኪዬ
ደሙ ነው ክብሬ ማረፊያዬ

መታያዬ ነው ደሙ
መፅደቂያዬ ነው ደሙ
መቅረቢያዬ ነው ደሙ
ጠበቃዬ ነው ደሙ

በስጋህ በኩል ወደ ቅድስት
ደርሻለሁኝ ባንተ ምህረት
ደምህን አዝርተህ ስለ ሀጢአቴ
ይዘኸኝ ገባህ ወደ እረፍቴ

አዲስ ፍጥረት ነኝ ስላመንኩኝ
በመስቀልህ ሞት የታረቅሁኝ
ስለቀደምክ መታያዬ
በአብ ቀኝ ሆኗል አድራሻዬ

ማምለጫዬ ነው ደሙ
መድረሻዬ ነው ደሙ
ከለላዬ ነው ደሙ
ውበት ጌጤ ነው ደሙ

የሀጢአትን ሀይል የሚሰብር
ከምርጦቹ ጋር የሚደምር
ስለ በደሌ ፈስሶ ደሙ ደምህ
ተቀብሎኛል አብ አባትህ

የእግዚአብሔር ፍርድ በእኔ እንዳይወርድ
ማስተስረያ ሆነህ ምታበርድ
በአዲሱ ኪዳን መታረቂያ 
ነፃ ሆኛለሁ ሀሌሉያ

አርነቴ ነው ደሙ
መታረቂያ ነው ደሙ
ይታይልኛል ነው ደሙ
መቅረቢያዬ ነው ደሙ
'''
                  }),
            ]),
        Albums(
            name: 'የፍቅርህ ምርኮኛ',
            photo: yefkrh,
            realeasedDate: DateTime.now(),
            albumNumber: 06,
            songs: [
              Song(
                  name: 'የፍቅርህ ምርኮኛ',
                  videoURL: 'https://youtu.be/Cw_RO1cqW-o?si=ZfgbnSgUhlOHxOnh',
                  songLyrics: {
                    'lyrics': '''
የፍቅርህ ምርኮኛ እኔ ሆኛለሁ
ደግሜ ደግሜ ወድሀለሁ
የፍቅርህ ምርኮኛ በአንተ ዘንድ ያለሁ
ደግሜ ደግሜ ወድሀለሁ
ወድሀለሁ ወድሀለሁ(x2)

በበደሌ ሞቼ ሳለሁ
ለሰይጣን እየተገዛሁ
የቁጣ ልጅ ሆኜ ነበረ
ያ ሁሉ ታሪክ ሆኖ ቀረ

በቀራንዮ ውዴ ተሰቅሎ
ፃድቅ አረገኝ ኢየሱስ በእኔ ቦታ ሆኖ

እንደ ባሪያ ስኖር ሳለሁ
ለሀጢአት እያጎበደድኩ
ቀንበር በላዬ ተጭኖብኝ
የእግዚአብሔር ጠላቱ ነበርኩኝ

አሁን ግን ልጅ ነኝ የእግዚአብሔር ወራሽ
ተወልጃለሁ ከመንፈሱ ሆንኩኝ አዲስ ፍጥረት

ጠፍቼ ስኖር ካንተ ርቄ
ኮብልዬ ያንተን ፍቅር ንቄ
የስጋ ምኞቴን ስከተል
ከእግዚአብሔር ተጣልቼ ነበር

ደግሞ እንደገና የእንደገናዬ
በትንሳኤ ሀይል አዲስ ሰው አረከኝ ጌታዬ

ኢየሱስ ገና እወድሃለው
በሞትህ ሞቴን ስለሻርከው
ሞቴን ስለሻርከው

ኢየሱስ ገና አፈቅርሃለሁ
በአብ ቀኝ ባንተ ውስጥ ስላለሁ
ባንተ ውስጥ ስላለሁ

ወድሀለው ወድሀለው
'''
                  }),
            ]),
      ]),
      Singer(name: 'ዘማሪ ትዝታው ሳሙኤል ', photo: GSTiztaw, singerId: '06', albums: [
        Albums(
            albumNumber: 01,
            name: 'ኤልሮኢ',
            photo: MELogo,
            realeasedDate: DateTime.now(),
            songs: [
              Song(name: 'ኤልሻዳይ ነህ', videoURL: '', songLyrics: {
                'lyrics': '''
ኤልሻዳይ ነህ ኤልሻዳይ
ትዕግስትህ ብዙ ሁሉን ቻይ
በኃጢአት ብወድቅ ብቆሽሽ
ጌታ ሆይ ከእኔ አትሽሽ

ልጆች ሊያደርገን ሁሉን ችሎ
መራራ ሞትን ተቀብሎ
ገነትን ሰጠን በክንዱ አቅፎ
ትንሣኤ አወጀ ሞትን ዘልፎ

ራቁቴን ነኝ በኃጢአቴ
ልብሴ ነህ አንተ መድኃኒቴ
ምሕረትን ስጠኝ እጠበኝ
የቤቴም ራስ ሁንልኝ

ምሕረት ቸርነትህ ጥልቅ ነው
ውቅያኖስ ባሕር ማይመጥነው
ይህንን አውቀን እንቀኛለን
በዙፋንህ ፊት እንሰግዳለን

ፍቅርህ ልዩ ነው መሰጠኝ
ከዓለም ትቢያ አነሳኝ
ይህን ላረገ ቅዱስ ጌታ
ሰዎች እንዘምር በዕልልታ
'''
              }),
              Song(
                  name: 'መላእክቱ',
                  videoURL: 'https://youtu.be/32k08kJNgRs?si=P0a3H6SsFKQPkXxT',
                  songLyrics: {
                    'lyrics': '''
መላእክቱ በፊቱ ይቆማሉ
ሠራዊቱ በፊቱ ይሰግዳሉ
ኃያል አምላክ እግዚአብሔር እያሉ(X2)

በክብረ መንግሥቱ በነጭ ዙፋን ላይ
ዘለዓለም ይኖራል ከሰማያት በላይ
ለሚታዘዙለት እጁን ይዘረጋል
ጨለማውን በሰላም ያነጋል

መብረቅ ነጎድጓዱ የምስጋናው ጅረት
ዘወትር ይፈሳል በቀንና ሌሊት
የእሳት መጋረጃው ይነዳል ከፊቱ
ተቀኙለት ሊቀ መላእክቱ

ትናንትናም ዛሬም እርሱ ያው ነው
ሞትን አሸንፎ በአባቱ ቀኝ ያለው
ዳግመኛ ሲመጣ እርሱን ለመቀበል
በደመና እንነጠቃለን

በወርቅ ፅና ላይ ብዙ ዕጣን ጨምረው
ዙፋኑን ያጥናሉ በበጉ ፊት ቆመው
አዲሱን ምስጋና አዲሱን ውዳሴ
ያቀርባሉ ለቅድስት ሥላሴ
'''
                  }),
              Song(
                  name: 'ማን አለን',
                  videoURL: 'https://youtu.be/VODDlvRtVso?si=wggY0ZcIe10fqT4O',
                  songLyrics: {
                    'lyrics': '''
ማን አለን ጌታ ሆይ ካንተ በቀር (X2)
በሰማይ ሆነ በዚህ ምድር 
ማን አለን ካንተ በቀር

ዛሬ ወዳጅ ነገ ጠላት
ይለወጣል የሰው ሕይወት
ያመናቸው ገፍተው ጣሉን
አንተ ብቻ አትተወን

ባይደላንም የምድር ኑሮ
ብናሰማ ለቅሶና ሮሮ
ባይሳካ ውጥናችን
ባንተ ያምራል ፍጻሜአችን

ሕይወታችን መልኩ ወይቦ
መንገዳችን በእሾህ ተከቦ
ጠላት መቶ ስንሰቃይ
ታገልክልን ነህ ኤልሻዳይ

እንኳን ጮኸን ሣንለምን
አፍሮ አይገባም መረባችን
ስቦ ማውጣት እስኪያቅተን
በዓሳ ይሞላል መረባችን
'''
                  }),
              Song(
                  name: 'ኤልሮኢ',
                  videoURL: 'https://youtu.be/bJwLLXpEF2A?si=VqQnTEZyHQFxwzyQ',
                  songLyrics: {
                    'lyrics': '''
ኤልሮኢ እላለሁ እኔ (X2)
የሚያየኝን አምላክ ስላየሁኝ ባይኔ

የቁርጥ ቀን ወዳጅ ቢሆናት ወገን
ኤልሮኢ አለችው አጋር አምላኳን
የደሃዋን ጩኸት ለቅሶ የሚሰማ
እግዚአብሔር መልካም ነው በቀን በጨለማ

ሜዳና ኮረብታ ዳገት ቁልቁለት
በአንተ ተሻገርኩት ሁለን አለፍኩት
መልዓክህን ልከህ ስላፅናናኸኝ
እኔስ ከአንተ ሌላ ዘመድም የለኝ

ጉድጓድ ውስጥ ተጥዬ ድንጋይ ተጭኖኝ
የአናብስቱ ጩኸት ጨለማው ከብዶኝ
የተዘጋን መክፈት የሚቻለው ጌታ
ከጎኔ ቆመልኝ ልቤን ሊያበረታ

ከሰማነው በላይ እጅጉን ድንቅ ነው
ካየነውም በላይ አምላክ ከሃሊ ነው
ሰምቶኛል በጆሮው ምላሽ አግኝቻለሁ
አይቶኛል በዐይኖቹ ኤልሮኢ እላለሁ
'''
                  }),
              Song(
                  name: 'እግዚአብሔር ይመስገን',
                  videoURL: 'https://youtu.be/zmiVMebkR0o?si=LTyqfS4iwjEiXN1o',
                  songLyrics: {
                    'lyrics': '''
እግዚአብሔር ይመስገን ለዚህ ያበቃን
ካቀረቀርንበት ቀና ላደረገን
ስንደነቃቀፍ ጨለማ ውጦን
ጭጋጉን ገላልጦ ብርሃን ላሳየን

የግብፅ ከተሞች የገነባናቸው
የእኛ አይደለም ወጣና ትተናቸው
ደካሞች ብንሆንም አንተ ቀደምክልን
የመከራን ቋጥኝ አንከባለልክልን

ብትዘገይ እንኳ የሚቀድምህ የለም
ትደርስልናለህ አታሳፍረንም
ቃልህን ስታሰማን እንበረታለን
አስፈሪውን ባህር በአንተ እንቀዝፋለን

ጠፍተዋል ተብሎ መዝገቡ ሲዘጋ
ታሪካችን መክኖ ስንፈራ ስንሰጋ
እርሱ ግን መች ተወን ቀንበሩን አነሳ
ከወጥመዱ ተርፈን ዘለልን እንደ እንቦሳ

ሹመት አክሊላችን ማዕረጋችን ነህ
ህይወት አድሎናል መስቀልህ ሞትህ
ያንተ መንገላታት ማለት ደፋ ቀና
እኛን አቁሞናል ይድረስህ ምስጋና
'''
                  }),
              Song(
                  name: 'እፁብ ድንቅ ነው',
                  videoURL: 'https://youtu.be/Jyi8E-BIgNQ?si=IUt--79FUg8F8J25',
                  songLyrics: {
                    'lyrics': '''
እፁብ ድንቅ ነው ውለታው
እግዚአብሔር ለኛ ያረገው
ከቶ አይጥለንም ለዘላለም
እንደ አምላካችን ማንም የለም

ወድቀን ነበር ተነስተናል
ባሕር አቁሞ አሻግሮናል
ድንቅ አደረገ ታምር ሰራ
እያንሳፈፈ ያን ተራራ

የጠፋውን በግ የፈለገ
ራሱን ባዶ አደረገ
መስቀል ታቅፎ ክንዱ ዛለ
ምን ያልሆነልን ነገር አለ

ከአባትም በላይ አባት ነው
የልጆቹ እንባ ሚገደው
የጭንቀታችን ተካፋይ
አዛኝ ጌታ ነው ሁሉን ቻይ

ዳግም እንድንቆም በሕይወት
ጨክኖ ወደደን እስከ ሞት
ከእንግዲህ አንፈራም እንጸናለን
ለክፉ የማይሰጥ አባት አለን
'''
                  }),
              Song(
                  name: 'ከብሯል እግዚአብሔር',
                  videoURL: 'https://youtu.be/_SPGzSWwRFk?si=h6AwEKUelJn2EQxL',
                  songLyrics: {
                    'lyrics': '''
ከብሯል እግዚአብሔር ከብሯል
ስሙ በክብር ገኗል
ውዳሴ መዝሙር ለርሱ ይገባል

በአምሳልህ ፈጥረህ ፍፁም ወደኸናል
የመለኮት ባህርይ ተካፋይ ሆነናል
የልባችን ዙፋን ፈቅዶ ተዘርግቷል

የጅረት የወንዙ የፏፏቴው ግርማ
የፀሃይዋ ቀመር ቀንና ጨለማ
በሁሉ ላይ አንተ ሰልጥነሃልና
እንሰዋልሃለን ውዳሴ ምስጋና

ሲኦልና ገነት ምድርና ሰማይ
በእጅህ መካከል በመዳፍህ ላይ
በእነዚህ ውስጥ ያሉት ሁሉም ካንተ ናቸው
ለፍትሃዊነት ያዘጋጃሃቸው

ፍጥረትህን ስትፈጥር ማንም አልመከረህ
ሁሉን አድርገሃል በገዛ ፈቃድህ
እጣ ፈንታቸውም ባንተ ይወስናል
የእጅህ ስራ ናቸው ማንስ ምን ይልሃል
'''
                  }),
              Song(
                  name: 'ያስከበርከኝ',
                  videoURL: 'https://youtu.be/R9HD6MHh5qY?si=IjpKkt_0QPR4u9G_',
                  songLyrics: {
                    'lyrics': '''
ያስከበርከኝ ክበርልኝ
ከፍ ያረከኝ ከፍ በልልኝ
ልቤ አቅንቷል ወደ ዙፋንህ
ጠዋት ማታ ሊያገለግልህ

ሞገስ ስለሆንከኝ ጉልበትና ክብሬ
ባንተ ያገኘሁትን አልዘልቀው ዘርዝሬ
ቤትህ አድጌያለሁ ስጠይቅ ስሰማ
ከፍ ብያለሁ ስምህ ሆኖኝ ማማ

ሳትሰስት ሳትቆጥብ ፀጋን ሰጥተኸኛል
የቀረብኝ የሇም ፍቅርህ በዝቶልኛል
የልቤ ማኅደር ፅፎታል ስራህን
መቼም አትጥልም ያገለገለህን

እድፍ የሌለብህ ስህተት የማያውቅህ
እውነት የከበበው ፍርድና ችሎትህ
መልክና ቁመና በአንተ ፊት ባዶ ነው
ልቡናን አይተህ ነው የምትሾመው ምትሽረው

በኔ ሥራ ሳይሆን ጌታ በአንተ ፀጋ
ስለወደድከኝ ነው እንዲሁ ያለዋጋ
መቆሜ መኖሬ በፍቅርህ ነውና
ታሪኬ ነህ አንተ የኔ ሁለንተና
'''
                  }),
            ]),
        Albums(
            albumNumber: 01,
            name: 'የፈራ ይመለስ',
            photo: MELogo,
            realeasedDate: DateTime.now(),
            songs: [
              Song(
                  name: 'መርከቤ',
                  videoURL: 'https://youtu.be/nJM0V5z1kGk?si=1BNUapUMGXEdGpFu',
                  songLyrics: {
                    'lyrics': '''
መርከቤ መጠለያዬ
ሞገደን መሻገሪያዬ
ፀጥታ ሰላምም ሰፍኗል
ከእንግዲህ ማን ያስፈራናል

ሲነደል ታላቁ ቀላይ
ተንሳፈፍን በሞት ጀርባ ላይ
መርከብ ሆኖን አምላካችን
ማምለጫ መሸሸጊያችን(X2)

በሲና ሕግን የሰራ
ሕዝቡንም በፅድቅ የመራ
የሰላም የምህረት ጌታ
ሕይወት ነው ማረፊያ ቦታ(X2)

ርግቧ ተመልሳለች
ጥፋቱ ቆሟል እያለች
ቀጤማው ከእጃችን ገብቶአል
በረከት ሰላም ከቦናል(X2)

ማዕበል ወጀብ ቢበዛ
አንተ ነህ የህይወቴ ቤዛ
በሞት መካከል ብሄድም
ከእንግዲህ አልታወክም(X2)
'''
                  }),
              Song(
                  name: 'አናቋርጥም ውዳሴ',
                  videoURL: 'https://youtu.be/MmJ2yRCCdos?si=sg9FQo0k4TpfX5Nq',
                  songLyrics: {
                    'lyrics': '''
አናቋርጥም ውዳሴ አናሳንስም ምስጋና (X2)
እግዚአብሔር ለኛ ያለውን ፈፅሟልና
እግዚአብሔር ርስታችንን አብዝቷልና

ተቀጣጠለ የምስጋናው ችቦ
መቅደሱ ደምቋል በእልልታ ታጅቦ
የደረሰለት ጸሎት ልመናው
ልቦናው ያርፋል ሲያመሰግነው

ዛሬን ላሳየን ውሎልን ውለታ
እየደገፈን በቀንም በማታ
በእድሜያችን ሙሉ ብንዘምርለት
ቢያንስበት እንጂ ለእርሱ አይበዛበት

ዛሬ ያልዘመሩ ነገ ይዘምራሉ
ፍቅሩን ሲቀምሱ ፊቱ ይዘላሉ
የሜልኮል ልጆች ከደርቡ ውረዱ
ትምክህት ትታችሁ ለእግዚአብሔር ስገዱ

ድምጹን ሰምተናል ከፀፍፀፍ ሰማይ
ሕዝቡን ሲያፅናና ሲያወጣ ፀሐይ
መንፈሱ ቃኝቶን ፋነነ ልባችን
ቅጥሩን አፍርሷል መዝሙር ዕልልታችን
'''
                  }),
              Song(
                  name: 'ወረት የሌለው',
                  videoURL: 'https://youtu.be/VpwdhMKLo8I?si=x-guOo_IB1BliaW3',
                  songLyrics: {
                    'lyrics': '''
ወረት የሌለው ወረት
አዛኝ የድሆች አባት
በሰማይ ሆነ በምድር
የለም እንደ እግዚአብሔር

እንደወደደን ትናንትና
ዛሬም ፍቅር ነው እንደገና
እርሱ አይለወጥ እንደ ሰው
ፍቅር ነው ወረት የሌለው

ከስኬታችን በስተጀርባ
ተከፍሎልናል የደም እንባ
አቻ በሌለው ፍቅሩ ገዝቶ
ሕይወትን ሰጠን እርሱ ሞቶ

ሰንሰለት የለም በእርሱ ዘንድ
ፍጹም አያውቅም ማስገደድ
በፍቅር ስቦ ይማርካል
መልካምነቱ ይለውጣል

ሲጨክኑበት ወደዳቸው
እየገደሉት አዳናቸው
በክፉ ፈንታ መልካም ሆነ
አንዱ ተሰቅሎ ሁሉ ዳነ

ከኃጢአታችን የወደደን
ከነውራችን ጋር ያቀረበን
ሳይበቀለን ሳያጠፋን
ይኸው ይኖራል እያሰፋን
'''
                  }),
              Song(name: 'የፈራ ይመለስ', videoURL: '', songLyrics: {
                'lyrics': '''
የፈራ ይመለስ ከገልዓድ ተራራ
እኛ ግን ቆመናል በፅናት ከጌድዮን ጋራ
በሦስት መቶ እንስራ ማይጠፋ ችቦ ለኩሰናል
የእግዚአብሔር እሳት ኃይላችን ጉልበታችን ሆኗል

ወደፊት እንጂ አንልም ወደ ኋላ
ሞፈር ተይዞ አይጠበቅም ጥላ
እንሮጣለን ስሙን ተሸክመን
ቃል ኪዳን አለን ሽንፈት ላያገኘን
የእግዚአብሔር እሳት ኃይላችን ጉልበታችን ሆኗል

ለድል ፍጠኑ ለወሬ ጊዜ የለም
መኸሩ በዝቷል ሠራተኞች ቢያንሱንም
ነፍስ አልቀረለት ጠላታችን ደንግጧል
ቀፎው ተነክቶ ንቡ ክዳን ገልብጧል

ከማታ ተኩላ ጭካኔያቸው ቢገን
ከነብር ዝላይ ፈረሳቸው ቢፈጥን
እሣት እንዳየው የሸማኔ ፈትል
የአሕዛብ ጉልበት በስሙ ይቀልጣል

ብዛት አይሠራም የሚያስፈልገው ጥራት ነው
አንገቱን ደፍቶ የሚጠጣ ውሻ ነው
ቀና ብለናል ነጋሪቱ ሲመታ
በግራችን ኮቴ ጅማታቸው ተፈታ

ባሕር ሰልፍ ይዞ አጨበጨበልን
በውሃ መዝሙር በመካከል አለፍን
ገና ይሆናል ያልታየ ያልተሰማ
ሥለ ነገሠ አምላካችን በግርማ
'''
              }),
              Song(
                  name: 'ይዲዲያ',
                  videoURL: 'https://youtu.be/4LnjRyreJz8?si=WeQJjrNfgeSVHjnG',
                  songLyrics: {
                    'lyrics': '''
ይዲዲያ ነው ምስጋናችን
አምልኮታችን ዕልልታችን
ይቀበለዋል አምላካችን

ከተሻገርነው ኤርትራን በክንዱ
ማለፍ ከቻልን ቀንቶልን መንገዱ
ከበሮ አንስተን መዘመር ብቻ ነው
ለእሥራኤል ቅዱስ ሁሉ ለሚቻለው

የግብጽን ጭቃ ሽንኩርቱን ጥለናል
በገና ክራር መሰንቆም ይዘናል
በዙፋኑ ፊት እንጓደዳለን
ምስጋናችንን ስለ ወደደልን

ቅርፊቱ ሰጥሞ ብረቱ ተንሳፏል
የማይሞተው ሞቶ ፍጥረት ነጻ ወቷል
ነጻነት አለን በደም የታተመ
እንዴት ይወድቃል ከእርሱ ጋር የቆመ

መንፈስ ያሸሸው የዳዊት በገና
ወህኒ ያፈረሰው የጳውሎስ ምስጋና
በኃይል ይሰራል ዛሬም እንደጥንቱ
ነክቶናልና የጸጋ እሳቱ
'''
                  }),
              Song(
                  name: 'መኳንንት',
                  videoURL: 'https://youtu.be/eMQ82bL4tXU?si=iwREfvFgVZTPsy5o',
                  songLyrics: {
                    'lyrics': '''
መኳንንት ደጁን ክፈቱ
የጌታ ቀን ነው ዕለቱ (X2)
የክብር ንጉሥ ይግባ ከቤቱ
በምድር በሰማይ ጸንቷል መንግስቱ (X2)

ናርዶሱ ይርከፍከፍ ይሰበር ብልቃጡ
አምልኮ ቅኔ ውዳሴውን አምጡ
ምንጣፍ ይዘርጋ መጎናፀፊያው
አንዳች የለንም ምንከለክለው

በራሱ ላይ ጠል በእጆቹ ዘይት
ከአፉ ይፈሳል ማርና ወተት
አዝኖ ሲመለስ እንዳትታመሙ
ዛሬ ክፈቱ ውዳችሁን ስሙ

ውረዱ ይላል ከሾላዋ ላይ
እንደ ዘኬዎስ ቤታችንን ሊያይ
መዳን እንዲሆን ዛሬ ለቤታችን
እልፍኙ ይገለጥ ይግባ ንጉሣችን

ከደጅህ ቆሟል ያንኳኳል በሩን
እራት ሊበላ ዘርግቷል እጁን
የልባችሁ ቤት ዙፋኑ ይዘርጋ
ይጥለቀለቃል ነፍሳችሁ በጸጋ
'''
                  }),
              Song(
                  name: 'ያንተን ያንተን',
                  videoURL: 'https://youtu.be/74IhUsII3ao?si=kJn_OzfWDtHCh4sj',
                  songLyrics: {
                    'lyrics': '''
ያንተን ያንተን ብናወራ ብንናገር
ችሎታህን ቸርነትህን ብንዘረዝር
አንጠግብም አንረካም እግዚአብሔር

ተጠምተህ አጠጣኸን ተርበህ አበላኸን
ተወግተህ ተገርፈህ ከቁስል ፈወስከን
መቃብር ስትወርድ ገነትን ወርሰናል
አቤት ያንተ ውለታ ማንስ ይከፍለዋል

ስምክን ተሸክመን ዞረን አገር ለአገር
ዝናህን ክብርህን ለዓለም ልንመሰክር
ዘወትር ጉንጭ ይፀፋል ፍቅርህ ጉልበተኛ
ሳንጠራህ ሳንወድህ ውለንም አንተኛ

ቅዳሴው ቢቀደስ ቢቆም ማኅሌቱ
ኪዳኑ ቢሰማ ቢደርስ ሰዓታቱ
ቢሰበክ ቢዘመር ቢገለጥ አንድምታ
ሁሉም ለክብርህ ነው ስለአንተ ውለታ

ስንቱን እንቁጠረው ስንቱን እንናገር
ቃላት አይገልጸውም የፍቅርህን ምስጢር
ያልረታኸው የለም ያላሸነፍከው
ሁሉም ተማርኮ ነው እጁን ያነሳው
'''
                  }),
              Song(
                  name: 'በምህረት በይቅርታ',
                  videoURL: 'https://youtu.be/fvKnrkCkI-4?si=F7_5HPM3tj09LDB2',
                  songLyrics: {
                    'lyrics': '''
በምህረት በይቅርታ
ያሰባሰበን ጌታ
ፍቅር ነው ለዘላለም
እንደ አምላካችን የለም

የጠላትን ክንድ ሰብር
ባህር ከፍሎ አሻግሮ
ምድረ ርስትን ሰጥቶናል
በማዕረግ አቁሞናል
  ሰይጣን አንገቱን ደፋ
  ርስታችንም ሰፋ
  አስገባን ክንፋ ስር
  ሰበሰበን በፍቅር

ሰርክ አዲስ ነው አዋቂ 
ማለዳ ተናፋቂ
ነጋ ጠባ ስለኛ 
የማይደክም የማይተኛ
  ስንወድቅ እያነሳ
  በደልን እየረሳ
  አባት ሆኖናል በግልጥ
  ሳይከፋ ሳይለወጥ

የሲና ንዳድ ግለት
ከቶ አልሰጠንም ለሞት
ዝለትና ቸነፈር
አላስቀረንም ከዱር
  መዓልቱን በደመና
  ሌሊት በብርሃን ፋና
  ወደ እቅፉ ሳበን
  እየመገበን መና

ከሰፈር አውጥቶናል
ድንኳኑን ተክሎልናል
በመንፈስ እንሰግዳለን
በስሙ እንገዛለን
  ለሞት እንዳንተኛ
  አይናችንን አበራ
  ይኸው ተሰብስበናል
  ወደ ህይወት ተራራ

'''
                  }),
            ]),
        Albums(
            albumNumber: 01,
            name: 'አኪያ',
            photo: MELogo,
            realeasedDate: DateTime.now(),
            songs: [
              Song(
                  name: 'ሞቴ በሞቱ ሽሮ',
                  videoURL: 'https://youtu.be/visLYRVmCMA?si=G5SdisZAeQq0Hmrd',
                  songLyrics: {
                    'lyrics': '''
ሞቴ በሞቱ ሽሮ ኢየሱስ አዳነኝ
መቃብሬን ገልብጦ በህይወት አቆመኝ
አብዝቷል ምህረቱን ለኔ
ልዘምር በእድሜ ዘመኔ
ጠላት ትጥቁ ተፈታ
ድኛለሁ በእርሱ ውለታ

በቀለበት አትሞ ሞቴን ሲጽፍብኝ
የቀደመው ጠላቴ ጉድጓድ ሲምስብኝ
እያበራ መጣልኝ ህይወት ይዞ ጌታዬ
ይኸው ዛሬም እኖራለሁ ተቀጥላ እድሜዬ
ይድረስ እልልታዬ

የህማም ሰው ነውና ደዌን የሚያውቅ እረኛ
ለመስቀል ሞት ታዘዘ ካሳ ሆነ ስለኛ
ቅዱስ ስጋው ተቆርሶ ክቡር ደሞ ፈሰሰ
ሠማያትን ሠንጥቆ ሳንጠፋ ደረሰ
ሕይወት ተመለሰ

በውድቀቴ ሊሳለቅ ያንዣበበው ጠላቴ
ተመልሷል ተዋርዶ አሳፍሮት አባቴ
ተገላግሏል መንፈሴ የሞት ጽንሱ ጨንግፏል
ለኔ ያረገው ውለታ በሰማይ ላይ ተፅፏል
ሁለም በጊዜ አልፏል

ቀና ብዬ እሄዳለው አሰፋለሁ እግሬን
ደሙን ሚያልፍ ኃይልየለም እከፍታለው በሬን
የሞት መውጊያው ተሰብሯል ሾተልና ጅራፍ
እቦርቃለሁ በሀሴት በአባቴ ደጃፍ
አብርቼለት ጧፍ
'''
                  }),
              Song(
                  name: 'ስመሰክር',
                  videoURL: 'https://youtu.be/eFj2UE3viAk?si=queFSFNE2jcJywHn',
                  songLyrics: {
                    'lyrics': '''
ስመሰክር ዓይኔን እንዳበራ
ከለከሉኝ ስሙን እንዳልጠራ
ሙለ ሰው ነኝ መቼም ዝም አልልም
ያለኝ ኢየሱስ ነው ለዘላለም

በራሳቸው ፈቃድ ጠይቀው መዳኔን
ማመን ተስኗቸው የበራው ዓይኔን
ማዳኑን አውጄ ከምኩራብ ቢያስወጡኝ
የማይጥለው ንጉሥ ኢየሱስ አቀፈኝ

ኃጢአተኛ ቢሉት በሙሉ ልባችው
ክብሩን ባይቀበል ጎዶሎ እምነታቸው
ለእኔ ግን አምላክ ነው ፈዋሽ መድኃኒት
ጨለማ ማይረታው የሌሊት መብራት

የዋህ ወላጆቼን ከቶ አታስጨንቁ
ሙሉ ሰው ነኝና እኔኑ ጠይቁ
ለመሆን ካሻችሁ ደቀመዛሙርቱ
የልባችሁን በር ለጌታ ክፈቱ

ይጣፍጣል መኖር ከክርስቶስ ጋራ
መፍትሄ ስላለው ለሃዘን ለመከራ
ሞትም ጥቅም ሆኗል በጌታ ከሆነ
ሁለተኛ አይሞትም አንዴ እርሱን ያመነ
'''
                  }),
              Song(name: 'አንተ እኮ ለኔ', videoURL: '', songLyrics: {
                'lyrics': '''
አንተ እኮ ለኔ (X2)
ግርማ ሞገሴ ነህ በእድሜ ዘመኔ
አንተ እኮ ጌታ(X2)
ውበት ናፍቆቴ ነህ በቀን በማታ

ብዕሬ ላንተ ነው ቀንድና ቀለሜ
ሥራህን ካልፃፍኩኝ ይብሳል ህመሜ
መጮኽ ልምዴ ሆኗል ስምህን በዜማ
ዘመናት ነጎዱ ነፍሴ ለአንተ ቆማ
የኔ ጌታ

ውበቴ ክብሬ ነህ መተማመኛዬ
ማዕረግ ሆነህልኝ ከብዷል ትከሻዬ
ሲታገለኝያድራል ፍቅርህ እንደ ጎልማሳ
ምንም ስኬት የለኝ አንተን የሚያስረሳ
የኔ ጌታ

እንድፈራህ እርዳኝ በፍቅር እንዳከብርህ
በእምነት በመንፈስ እንዳገለግልህ
አለልኝ እያልኩኝ ለዓለም የማወራው
በሰው ፊት መውጫዬ ልዑል ያንተ ስም ነው
የኔ ጌታ

ተነጥቋል መንፈሴ ከሠማያት ማዶ
ፊትህን ፍለጋ በናፍቆት ተሰዶ
የእቅፍህን ሙቀት ተመኘ ገላዬ
ጊዜ አይተህ ማትጥል አንተ ነህ ጌታዬ
የኔ ጌታ
'''
              }),
              Song(
                  name: 'አኪያ እላለሁ',
                  videoURL: 'https://youtu.be/mPvyOD573F4?si=_XynL5tTfMKYI6xo',
                  songLyrics: {
                    'lyrics': '''
አኪያ እላለሁ ወንድሜ ነህ
ስለደገፈኝ ፍጹም ፍቅርህ
በምኖርበት ትኖራለህ
የትም አትሄድም እኔን ጥለህ

እንደ ታላቅ ወንድም ታግለህልኝ
ጠላቴን በፊቴ ጥለህልኝ
ታባብለኛለህ እቅፍ አርገህ
ያሳምነኛለህ አሳይተህ 

ወንድሞቼ ብሎ ሲጠራን
ፍፁም አላፈረም ጌታችን (X2)

የአባቴን ፈቃድ የሚፈጽሙ
የመንግሥቴን ወንጌል የሚሰሙ
ወንድሜም እህቴም ናቸው ብለህ
አዛመድከን በፍቅር አስተካክለህ

ወንድሞቼ ብሎ ሲጠራን
ፍፁም አላፈረም ጌታችን (X2)

ከዮሴፍ ጋር ታስረህ ተሽጠሃል
የባርነት ፍርደን ገልብጠሃል
ወንድሞቹን ሲያጣ በጥላቻ
ወንድም አንተ ሆንከው መመከቻ

ወንድሞቼ ብሎ ሲጠራን

ፍፁም አላፈረም ጌታችን (X2)
ትከሻዬ ኃይሌ ቀኜ ነህ
ከፍቅር አቅም በላይ የምወድህ
የኔን ውድቀት ሞቴን የማትሻ
ወዳጄ ነህ እስከ መጨረሻ

ወንድሞቼ ብሎ ሲጠራን
ፍፁም አላፈረም ጌታችን (X2)
'''
                  }),
              Song(
                  name: 'እንደኔ የረዳኸው የለም',
                  videoURL: 'https://youtu.be/AzsiI9fhzVQ?si=iUgoqx2Po5QcXVLJ',
                  songLyrics: {
                    'lyrics': '''
እንደኔ የረዳኸው የለም
እነደኔ ያነሳኸው የለም
የፍቅርህ ውለታ በዝቶብኝ
አልጠግብም ለአንተ እየዘመርኩኝ

የኃጢአት ጠባሳዬን ሽሮ
ዘመኔ በአዲስ ተጀምሮ
በሞገስ አልኩኝ ቀና ቀና
ለአንተማ ዘምራለሁ ገና
ከቃሌ ይቀድማል እንባዬ
ያንን ቀን ሳየው ዞር ብዬ
ስንቱ ሌት ስንቱ ማታ አለፈ
የእኔን ሰልፍ ጌታ እያሸነፈ

ፍቅር ነህ ወዳጄ ፍቅር ነህ
ፍቅር ነህ አንድዬ ፍቅር ነህ
ሰው አይረሳም ይራራል ውብ ዐይንህ (X2)

ሳይመታኝ የጨበጡት ድንጋይ
እጃቸው ተያዘ ከሰማይ
ሳለቅስ ለብቻዬ ቆሜ
መጣልኝ ኢየሱስ ሰላሜ
    በልብስህ ከደንከው በደሌን
    መስቀልህ ጥሎታል መስቀሌን
    የሞቴ ጦማር ተቀደደ
    አያፍርም አንተን የወደደ

ፍቅር ነህ ወዳጄ ፍቅር ነህ
ፍቅር ነህ አንድዬ ፍቅር ነህ
ሰው አይረሳም ይራራል ውብ ዐይንህ (X2)

የሞት ቃል ተሰዷል ከቅጥሬ
ሰጥተኸኝ የሕይወትን ፍሬ
በአጥንትህ ግራ ጎኔ ሞላ
ከአንተ ነው ትዳርና ተድላ
    አየሁህ በመምሬ አድባር
    ስትመጣ ቤቴን ልታከብር
    ግባልኝ የማቀርበው አለኝ
    ባሪያህን ጌታዬ አትለፈኝ

ፍቅር ነህ ወዳጄ ፍቅር ነህ
ፍቅር ነህ አንድዬ ፍቅር ነህ
ሰው አይረሳም ይራራል ውብ ዐይንህ (X2)

ሲመሽ ይመጣል ሲመሽ
ወዳጄ ያልከው ሲሸሽ
ሲመሽ ይመጣል በማታ
የኔ ምትለው ስታጣ
ሲመሽ መጣልኝ ሲመሽ
ወዳጄ ያልኩት ሲሸሽ
ሲመሽ መጣልኝ በማታ
የእኔ የምለው ሰው ሳጣ
'''
                  }),
              Song(
                  name: 'የዜማ ጊዜ',
                  videoURL: 'https://youtu.be/MKFkOKVew_Y?si=omSF0WVpMUQCvFYr',
                  songLyrics: {
                    'lyrics': '''
የዜማ ጊዜ ስለደረሰ
በምድራችን ሊይ ቅኔ ፈሰሰ
በዓለት ንቃቃት በጥልቁ ያላችሁ
ወደ ፊት ውጡ ከበሮ ይዛችሁ

ወይኖች በእርሻ አብበዋል
መዐዛቸው ይሸተናል
ክረምቱ አልፎ ዝናብ ሄደ
መጋረጃው ተቀደደ
   ቀበሮችን አጥምዱልን
   ሳያጠፉት እርሻችንን
   ይህ ዝማሬ ከአርያም ነው
   ማንም ማቆም የማይችለው

በጨለማ ለሚኖሩት
በሸለቆ ለታሰሩት
የሚያስደንቅ ብርሃን ወጣ
ደግሞ ዘመን ስለመጣ 
   ከቅጥራችን ኋላ ቆሞ
   የጋረደን ጠላት ቀድሞ
   ንጉሣችን ኢየሱስ ነው
   ሳይታገል የሚጥለው 

ኢዮሳፍጥ ብልህ ሆኗል
ለሰልፉ ድል መዝሙር ፅፏል  
ዝቅ ሲሉ ቀስቱ አለፈ
ሞት በቅኔ ተሸነፈ 
    ጌጠኛ ነው ልብሳችን
    የንጉሡን ስም ፅፈን
    ሞአብ ወድቆ ጌታን ፈራ
    ድብቅ ጦሩን ሲያሰማራ

ሃሌ ሉያ በሰማይ
ስለ ሆነ ኤልሻዳይ
በመከራ ወለደን
ፍቅር ሆኖ አሳየን
    ቀራንዮ ጎልጎታ
    ለእኛ ነግቶ ለእርሱ ማታ
    ሁሉን አጥቶ አግኝቶናል
    ላንነቀል ተተክለናል
'''
                  }),
              Song(name: 'እሱን ስማው ', videoURL: '', songLyrics: {
                'lyrics': '''
እሱን ስማው ካልከኝማ 
አመስግነው ካልከኝማ
በደመና ውረድና
መንፈስህን ሙላኝና
ላመስግነው እንደገና

ተልስማህ ከሰማይ ልጄ ነው ስትል 
የላክልኝን የዘላለምቃል
በአዳምበደል የተዘጋው ገነት
በእርሱ ተከፍቷል በላክልኝ እውነት
  የምወደው ልጄ በለኝ የምወደው
  እኔም እርሱን ልከተለው

አባትአለሜ መጠርያ ሞገሴ
የፍቅር ዋጋ የልጅነት ውርሴ
መሰክራለሁ እንደምወድህ
ውስጤ ቀርተሃል ተርኮህ ልጅህ
  የምወደው ልጄ በለኝ የምወደው
  እኔም እርሱን ልከተለው

የናቁህ ሁሉ ከእግሮችህ በታች
ይሰግዱልሃል ንጉስ እያሉህ
የአንበሳው ጉድጓድ በእምነት ተደፈነ 
በትልቁ አይቀርም በልጅህ ያመነ
  የምወደው ልጄ በለኝ የምወደው
  እኔም እርሱን ልከተለው
'''
              }),
              Song(
                  name: 'በከበረ ሰረገላ',
                  videoURL: 'https://youtu.be/1pBE46fl5DA?si=KzMl5C4oK6ftcALp',
                  songLyrics: {
                    'lyrics': '''
በከበረ ሰረገላ ጭኖ 
በአባትነት ፍቅር አሳምኖ
ይረዳኛል አጠገቤ ሆኖ

መባርቅቱ ሰማያትን ቢያርሱ
ጋራው ቢናድ በአውሎ ነፋሱ
ሞገድ ማዕበል ቢቆም እንደ ዝግባ
የሞት መዳፍ ከእልፍኜ ቢገባ
አምንሀለሁ

ሰማይ ቢናድ ተቆርሶ እንደ አፈር
ጠባይ መልኳን ብትለውጥ ምድር
የመቃብር ደጃፉ ቢሰፋ
ነገን ላላይ ባይኖረኝም ተስፋ
አምንሀለሁ

ቢገነፍል ሲኦል ገደብ አልፎ
ዘንዶው ቢጮህ ጦሩን አሰልፎ
ቢተራመስ ፍጥረት ያለ ፋታ
ጉድ ቢፈጠር ባለሁበት ቦታ
አምንሀለሁ

ፀሀይ ክዳኝ ቢደፈን አለሙ
ከዋክብቱ ሳይወጡ ቢያድሙ
ጨረቃዬ አይኗን ብትጨፍን
ምድር ጮኻ ጩኸቴን ብታፍን
አምንሀለሁ
'''
                  }),
            ]),
        Albums(
            albumNumber: 01,
            name: 'ከፍ ከፍ ላርግህ',
            photo: MELogo,
            realeasedDate: DateTime.now(),
            songs: [
              Song(
                  name: 'ምስጋና ነው ሥራዬ',
                  videoURL: 'https://youtu.be/XMysshgVpsw?si=TDhRbTEUq4QJjF3n',
                  songLyrics: {
                    'lyrics': '''
ምስጋና ነው ሥራዬ በዘመኔ በዕድሜዬ
ለዋለልኝ ውለታ ምን ልክፈለው ለጌታ

ትናንትና ጥልቁ ነበረ መኖሪያዬ
የማዳኑ ቀኑ ደረሰ የጌታዬ
ራቁቴን ሸፍኖልኛል በብርሃኑ
ምግቤ ሆኗል ስሙን ማወደስ በየቀኑ

አልተራብኩም አልተጠማሁም በዘመኔ
ምግበ ሥጋ ምግበ ነፍስ ነው ጌታ ለኔ
ተበጥሷል የእሳቱ ገመድ ሰንሰለት
አልረሳውም የሱን ውለታ ብድራት

ማን ያፈቅራል እስከ ሞት ድረስ ዋጋ ከፍሎ
ማን ያድናል ባለሥልጣኑን ሞትን ገድሎ
አማኑኤል በፍቅሩ ጸዳል ምድርን ከድኖ
ሰው አርጎኛል የማይሆኑትን ሁሉ ሆኖ

እንዴት ሆኜ ፍቅሩን ልግለጸው እንዴት ብዬ
ስለ እጆቹ በዕንባ ጨቀየ መኝታዬ
በእርሱ ቁስል ነፍሴ ወጥታለች ከመከራ
በዝማሬ ስሙን ማክበር ነው የኔ ሥራ
'''
                  }),
              Song(
                  name: 'በማንም የማልቀይርህ',
                  videoURL: 'https://youtu.be/5TzQvrcM31E?si=s_2FnCLStRv2Ibbc',
                  songLyrics: {
                    'lyrics': '''
በማንም የማልቀይርህ
በምንም የማልወጥህ
ኢየሱስ ለእኔ ልዩ ነህ
አባቴ ለእኔ ልዩ ነህ 

ከማዳን ይበልጣል ማዳኑ
አዲስ ነው ሥራው በየቀኑ
ሕመሜ ተወግዷል ሞቴ
ፈውሴ ነህ ቤዛ መድኃኒቴ

መስቀል ላይ ሆነህ ስትጮኽ
ቀስቅሶኝ የፍቅር ሲቃህ
ከዓለም መጣሁኝ ኮብልዬ
አባቴ ወዳጄ ነህ ብዬ

ይሞቃል እቅፍህ ምቹ ነው
ልቤ አርፏል ማንም አያደክመው
የዛሬ የነገም ታሪኬ
ተጽፏል ባንተ ተማርኬ

ውድ ነው ከቀይ ዕንቁ በላይ
ማደሪያው ጫፍ የሌለው ሰማይ
አልወጣም ከፍቅርህ እልፍኝ
የቱ ነው ከአንተ የሚለየኝ

አርቆ ነገን ያይልኛል
አምናለሁ እጅግ ይወደኛል
ሰማልኝ ጠላት ሲመክርብኝ
ምሕረቱን አላጎደለብኝ
'''
                  }),
              Song(
                  name: 'ከፍ ከፍ ላርግህ',
                  videoURL: 'https://youtu.be/0gMXXP6YkIw?si=VYShHyK1xR7BWTMy',
                  songLyrics: {
                    'lyrics': '''
ከፍ ከፍ ላርግህ ከፍ ከፍ በልልኝ
ሕይወት ሰጥተኸኛል ሞተህ በመስቀል
እንዴት ዝም እላለሁ እያየሁ ፍቅርህን
ለዓለም አውጃለሁ ዛሬም ውለታህን

ጀርባህን አየሁት ጅራፍ አቁስሎታል
እጅና እግርህን ችንካር ወጥሮታል
ከጎንህ ይፈሳል ደምና ውኃው
ልቤን አስለቀሰው ፍቅርህ ኃያል ነው
  የሾህ አክሊል ከራስህ ላይ ያለው
  የእውነተኛ ፍቅር ምስክር ነው
  ተስሎብኝ ደም ያጠበው ገጽህ
  አይጠፋኝም ያቃሰትከው ድምፅህ

መስቀል ተሸክመህ ስትወጣ ዳገት
ሲጨክኑ እያየህ የእጆችህ ፍጥረት
የትዕግስትህ መጠን ጥልቀቱን ፈልጌ
እፁብ እፁብ አልኩኝ ድምፄን ከፍ አርጌ
  ማን ይከፍላል የፍቅርህን ዕዳ
  ስለ ነፍሱ ላየህለት ፍዳ
  ትንግርት ነው ከኅሊና በላይ
  ንገስልኝ በምድር በሰማይ

ያ የብርሃን ፊትህ ጸዳል የሞላበት
በጥፊ ተመታ ምራቅ ተተፋበት
መላእክት በፍርሃት ፊትህ ሚቆሙልህ
ጲላጦስ ፊት ስትቆም እንዴት ቻለው ልብህ
  ከዚህ በፊት ታሪክ አልሰማንም
  ወደፊትም ዐይናችን አያይም
  የክርስቶስ የማዳኑ ሥራ
  ለዘላለም አያልቅም ቢወራ

እረኞች የሚያደንቁህ እረኛ ነህ አንተ
በደምህ ማኅተም ሰማይ ተከፈተ
ከጠቢባን ጥበብ ማስተዋል በላይ ነህ
ዕርቃንህን ሆነህ ጌታዬ ታምራለህ
  ማን ይከፍላል የፍቅርህን ዕዳ
  ስለነፍሱ ላየህለት ፍዳ
  ትንግርት ነው ከኅሊና በላይ
  ንገስልኝ በምድር በሰማይ
'''
                  }),
            ]),
        Albums(
            albumNumber: 01,
            name: 'ቀራንዮ (የንሰሃ)',
            photo: yefera,
            realeasedDate: DateTime.now(),
            songs: [
              Song(name: 'በትህትና', videoURL: '', songLyrics: {
                'lyrics': '''
ከዚያ ታላቅ ዙፋን ወረደና
ወገቡን በጨርቁ ታጠቀና
የሰው እግር አጠበ በትህትና

በሞቱ በስቅለቱ
ሁለም እንዲመራ በአብነቱ
የሐዋርያቱን እግር አጠበ
ክብሩን በትህትና አስነበበ

ማንም ጌታ ሊሆን ቢፈልግ
በትህትና እንደ እኔ ያደግድግ
ትዕቢተኞች ከአምላክ ይጣላሉ
ትሁታን በክብር ከፍ ይላሉ

ዓለምን ቢያስገርም ጥበባችን
ሰማዩን ቢነካ ምስጋናችን
ማንጠቅም ባሪያዎች እኛ ነን
ጌታ ከትቢያ ሊይ ያነሳን
'''
              }),
              Song(
                  name: 'ቀራንዮ',
                  videoURL: 'https://youtu.be/hE6nXzi5cxs?si=a0a250X5ng6AX9uD',
                  songLyrics: {
                    'lyrics': '''
እርጥብ መስቀል ተሸክመህ
ዳገት ወጥተህ ቁልቁል ወርደህ
ሰው ያረከኝ ክርስቶስ ነህ
ይታየኛል ያ ገጽህ
የከበደው መከራህ
አቤት ስቃይ አቤት ፍቅር
ማን ይከፍላል ይህን ብድር (X2)

ቀራንዮ (X2) ጎልጎታ
አልረሳውም የርሱን ፍቅር ያን ውለታ

ደምና እንባህ ተቀላቅሎ
በአይሁድ ጅራፍ ጀርባህ ቆስሎ
ተዘርግተው እጆችህ
ነፃ ወጣን ባሮችህ (X2)

በምራቁ ዓይን የሰራ
ዕውራንን የሚያበራ
ተተፋበት ተገረፈ
ስለ ፍቅር ተሸነፈ

ልቡ በጥም ተቃጠለ
ሲጮህ ሰሙት ውሃ እያለ
ውሃ አፍልቆ ለሰጣቸው
ሀሞት ሰጡት የግፋቸው (X2)

ልብሱን ገፈው ተካፍለው
እጅና እግሩን ቸንክረው
እንዳጠፋ ወንጀለኛ
ተሰቀለ ደጉ እረኛ (X2)
'''
                  }),
              Song(
                  name: 'አምላካችን ገናና ነው',
                  videoURL: 'https://youtu.be/MOXKEZE5Z_s?si=fcy6O5sN5Kiusfu2',
                  songLyrics: {
                    'lyrics': '''
አምላካችን ገናና ነው
ፍቅሩ ድንበር ወሰን የለው
አይጥለንም ለዘላለም
አይተወንም ለዘላለም
ይወደናል መድኃኒዓለም(X2)

ያንን ሁሉ ዋጋ ከፍሎ
ሸክማችንን አንከባሎ
እንደዘበት እንደዋዛ
አይጥለንም የእኛ ቤዛ(X2)

ጎኑን ወግተው ደሙ ፈሶ
በግርፋት ጀርባው ታርሶ
መዳፉ ላይ ተቀርፀናል
እንዴት ብሎ ይረሳናል(X2) 

መከራችን ቢበረታ
ጥያቄያችን ባይፈታ
ለጊዜው ነው ዝምታው
በማዳኑ ታማኝ ነው(X2)

የዳዊት ክብር የሳዖል
የጌዴዎን የዳንኤል
ስንቱ በቃ ለክብር
እያገዘው እግዚአብሔር(X2)
'''
                  }),
              Song(
                  name: 'ውለታህን',
                  videoURL: 'https://youtu.be/KuFj6ihKQF0?si=BUTPBCXio2N9fn1P',
                  songLyrics: {
                    'lyrics': '''
ውለታህን እንዴት እረሳለሁ
ስጦታህን እንዴት እረሳለሁ
የኔ ጌታ ገና እዘምራለሁ
የኔ ጌታ ገና እወድሃለሁ

በጠላቴ ደንደሱ ላይ ቆመህ
ሚመካበት ጉልበቱን ሰባብረህ
አወጣኸኝ እጆቼን ይዘህ
ሁሉ ያንተ ነው ምኔን ልክፈልህ

ለዘላለም ልቤን ይደንቀኛል
ጉልበተኛው ፍቅርህ ያስነባኛል
መውደድህን ገለጥከው በሥራ
እኔም ቆምኩኝ ክብርህን ላወራ

ማረፊያዬ የሕይወት ውሃዬ
ሙላቴ ነህ ጥጋብ እርካታዬ
ለመለምኩኝ ወንዝ ዳር ተክለከኝ
አይበርደኝም ስምክን አልብሰኸኝ

ከትቢያ ላይ ከአፈር ላይ አንስተህ
ከሸለቆው ከጥልቁ ጎትተህ
ከፍ አረግኸኝ ለስምህ ዝማሬ
እኔ አልሻም ላንተ ይሁን ክብሬ
'''
                  }),
              Song(
                  name: 'የትናንትና ማንነቴን',
                  videoURL: 'https://youtu.be/rECiAUQ7FRI?si=SmxNloltoNYIVktK',
                  songLyrics: {
                    'lyrics': '''
የትናንትና ማንነቴን
ያደፈው ታሪክ መዛግብቴን
እዩት ጌታዬ ሲያድስልኝ
ተስፋ ሲሞላልኝ ሲራራልኝ

ብዙ መዝገብ አለው የፍቅር የምህረት
ኃጢአቴ ኃይል የለው ወድቋል ዙፋኑ ፊት
ንስሐ ስገባ አዲስ መዝገብ መዝዞ
ጽድቄን ይፅፈዋል በደሌን ሰርዞ(X2)

በፍቅር የፈሰሰው ያ ደም ለማን ሆኖ
እንዴት ዝም ይለኛል ስጠፋ ጨክኖ
ምህረቱ ይበልጣል ከእጆቼ በደል
ጌታዬ ፍቅር ነው አልገባም ሲኦል(X2)

ባይፈልግኝ ኖሮ ባይወደኝ ጌታዬ
አይቀርበኝ ነበር ስጠራው በእንባዬ
ፀሐይ ሳይበግረው በቅትር ይመጣል
እንስራዬን ጥሎ ፍቅር ያሸክመኛል(X2)

ወድቆ ስላነሳኝ ንጹህ ደሙን ከፍሎ
ቁስሌን ስለሻረው በመከራ ቆስሎ
ብስት ብበድልም በለበስኩት ስጋ
ሳለቅስ ሰምቶኛል ደጃፉን ሳይዘጋ(X2)
'''
                  }),
              Song(
                  name: 'ፍቅር ነህ አባቴ',
                  videoURL: 'https://youtu.be/nGqXEdjEIBk?si=0yjh9jsANUnJUJgu',
                  songLyrics: {
                    'lyrics': '''
ፍቅር ነህ አባቴ ፍቅር ነህ
ፍቅር ነህ ጌታዬ
በሰላም እኖራለሁ አልፎልኝ ያሁሉ ስቃዬ

ከቁጥር በዝቶ ኃጢአቴ በደሌ ቢያስጨንቀኝም
ተስፋ ቆርጬ በራሴ ለማረፍ ሞቴን ብመኝም
አልተሟጠጠም ትዕስትህ ለልጅህ ያለህ ፍቅር
አልነቀልከኝም ጨክነህ ሕይወቴ ስልህ ልኑር

እንዳንተ ያለ እረኛ እንዳንተ ያለ ወዳጅ
የትም አላገኝ ስፈልግ ዕድሜ ዘመኔን ብፈጅ

ገደቡን አልፎ ሐዘኔ ሲሰብረው ጽኑ ልቤን
ብቻዬን መሆን ፈለኩኝ መሸከም ከብዶኝ ስድቤን
እያቃሰትኩኝ ፈለግሁህ እየታመምኩኝ አባቴ
አስተውያለሁ ፍቅርህን ተስለህብኝ ከፊቴ

እንዳንተ ያለ እረኛ እንዳንተ ያለ ወዳጅ
የትም አላገኝ ስፈልግ ዕድሜ ዘመኔን ብፈጅ

ምርጫዬ ስህተት አይደለም ማፍቀሬ አንተን ለይቼ
መሰክራለሁ ስላንተ ሳላፍር አፌን ሞልቼ
ምክንያት አትሻም ስትወደኝ ባዶ ሆኜ ነው ያየኸኝ
በሸለቆ ውስጥ ተጥዬ ለዛሬው ክብር ያሰብከኝ

እንዳንተ ያለ እረኛ እንዳንተ ያለ ወዳጅ
የትም አላገኝ ስፈልግ ዕድሜ ዘመኔን ብፈጅ
'''
                  }),
              Song(
                  name: 'አንድ ጊዜ ፈሦ ደሙ',
                  videoURL: 'https://youtu.be/nmTlC1WuhUU?si=6fKUeIMQEIm7-j2F',
                  songLyrics: {
                    'lyrics': '''
አንድ ጊዜ ፈሦ ደሙ
አንድ ጊዜ ዳነ ዓለሙ
የእግዚአብሔር በግ ኢየሱስ
ታርደሃልና ንገስ

የመስቀልህ ውበት ስቦኝ
የሕማምህ ጩኸት ጠርቶኝ
በስቃይህ አቃሰትኩኝ
ተከተልኩህ አያማጥኩኝ
   ከቶ አያሻም ሌላ ቤዛ
   አድኖናል አንዴ ጌታ
   በርሱ ያመነ ሕይወት አለው
   የእግዚአብሔር በግ እግዚአብሔር ነው

ከአቤል ደም በተሻለ
ፍቅር ይጮሃል ማር እያለ
የበጉ ደም ለዘላለም
ያስታርቃል ይህን አለም
    ከቶ አያሻም ሌላ ቤዛ
   አድኖናል አንዴ ጌታ
   በርሱ ያመነ ሕይወት አለው
   የእግዚአብሔር በግ እግዚአብሔር ነው

የጨለማው አገልግሎት
የእንስሳቱን ደም በመርጨት
ፍጥረት ከሞት ስላልወጣ
ጌታ ለሞት ታዞ መጣ
   ከቶ አያሻም ሌላ ቤዛ
   አድኖናል አንዴ ጌታ
   በርሱ ያመነ ሕይወት አለው
   የእግዚአብሔር በግ እግዚአብሔር ነው

እኔ አምናለሁ እንደዳንኩኝ
በክርስቶስ ስላመንኩኝ
የለብኝም ሞት ኩነኔ
ምትክ ሆኖ ጌታ ለኔ
   ከቶ አያሻም ሌላ ቤዛ
   አድኖናል አንዴ ጌታ
   በርሱ ያመነ ሕይወት አለው
   የእግዚአብሔር በግ እግዚአብሔር ነው

'''
                  }),
              Song(name: 'የሚያኖረኝ ጌታ ነው', videoURL: '', songLyrics: {
                'lyrics': '''
የሚያኖረኝ ጌታ ነው ምን ያስጨንቀኛል
የሚያስፈልገኝንም ያዘጋጅልኛል
ከመጨነቅ ሁሌ ከማዘን
ይሻለኛል ጌታዬን ማመን

ደስታ ሲሸሽ ሃዘን እየተተካ
አንዱ ሲሄድ አንዱ ደጄን እያንኳኳ
በእርሱ ምህረት ለዚህ ደርሻለሁ
ካለ ጌታ/አንድዬ/ ነገም እኖራለሁ

ምንም እንኳ በለስ ባታፈራ
ወዝ ባይኖረው የዘይቱ እንስራ
ኦና ቢሆን ጋጣና በረቱ
ክርስቶስ/ኢየሱስ/ ነው የልቤ ሃሴቱ

እንጀራዬን ጋግሮ የሰጠኝ
የወዜን ቋት የወሰነልኝ
አይሻግትም አይመክንም መሶቤ
ከሰማይ ነው ቀን በቀን ቀለቤ(X2)
'''
              }),
            ]),
        Albums(
            albumNumber: 01,
            name: 'ወራሹ ወረሰን',
            photo: werashu,
            realeasedDate: DateTime.now(),
            songs: [
              Song(
                  name: 'ለወደደን',
                  videoURL: 'https://youtu.be/LUKYOb0xmn4?si=wth_vERQaXYBN9xi',
                  songLyrics: {
                    'lyrics': '''
ለወደደን ከኃጢአታችን በደሙ ላጠበን
ለአባቱ ለመንግስቱ ካህናት ላረገን
ለዓለም ለዘለአለም ለኢየሱስ ክብር ይሁን (X2)

ደረቱን ወገቡን በወርቅ የታጠቀው
ሰባቱን ከዋክብት በቀኝ እጁ የያዘው
በሰባቱ መቅረዝ መካከል የታየው
ሞትን ድል አድርጎ በድል ያረገው ነው (X2)

ፍጹም የወደደን እስከ መጨረሻ
በደሙ ያጠበን ከኃጢአት ቆሻሻ
ነፍሱን ለበጎቹ ያኖረው አረኛ
አስታራቂ ካህን ፍርድ ሰጭ ዳኛ(X2)

ጠጉሩ አንደ በረዶ አይኑ እንደነበልባል
ድምጹ እንደ ፏፏቴ ወርዶ ያስገመግማል
ከአፉ የተሳለ የቃል ሰይፍ ይወጣል
ክህደትን ክፋትን ጠላትን ይቆርጣል(X2)

ከደመና ጋራ በክብር ይመጣል
እጆቹን እግሮቹን የወጉት ያዩታል
ያለህ የነበርከው የምትመጣው ጌታ
አሜን ጌታ ኢየሱስ አሜን ማራናታ(X2)
'''
                  }),
              Song(
                  name: 'ማነው ከልካዩ',
                  videoURL: 'https://youtu.be/nUweyxNWVqY?si=wkA77O07ZRV1mUJ9',
                  songLyrics: {
                    'lyrics': '''
ማነው ከልካዩ ላዳነኝ ስዘምርለት
ማነው የክብሩን ምስጋና የሚወስድበት
የኔ ልቤ ሰማይ ነው ኢየሱስ ባለበት
የኔ ልቤ ሰማይ ነው ውዴ ነግሶበት

ስደክም የሚያግዘኝ የሚያበረታኝ አለ
ሞቴን ፍርዴን ወስዶልኝ በመስቀል ላይ የዋለ
ሳልዘምርለት አይመሽ ሳላመልከው አይነጋ
አልፈራም ስመሰክር ገዝቶኝ በደሙ ዋጋ (X2)

የአዳነኝ ኢየሱስ ነው የሞተልኝ ቤዛዬ
ሌላ አዳኝ የሇኝም አንድ ነው መመኪያዬ
የእንባዬን ዶፍ ያቆመው የደሜን ጎርፍ ያቆመው
የመዳኔ ምስጢሩ የፈሰሰው ደሙ ነው (X2)

አልክደውም መድኅኔን አልጠላውም ወዳጄን
ስንቱን ያሻገረኝን በፍቅር ይዞት እጄን
ጠላቴ ሆይ አትድከም አትልፋ በቀን ማታ
ነፍሴ በነፍሱ ታስራ ሆኛሇሁኝ የጌታ (X2)

ወንበር ያለህ ተነሳ ባለዝናው ዝቅ በል
ልብህን ከፍተህ ዘርጋው ጌታህን ለመቀበል
አትደምቅም ያለ ክብሩ አትረታም ያለ ስሙ
መንግስቱን የምትወርሰው ስትጸዳ ነው በደሙ (X2)

እልል ነው እንጂ እልል
ላስታጠቀን የእውነት ወንጌል
እልል ነው እንጂ ጌታ
ሰባቱን ማህተም ለፈታ
'''
                  }),
              Song(
                  name: 'መናዬ መናዬ ',
                  videoURL: 'https://youtu.be/2M85cb2Zywg?si=ZCERxiYRpMDDPr52',
                  songLyrics: {
                    'lyrics': '''
መናዬ መናዬ ኢየሱስ መናዬ
ማእዴ ጥጋቤ ደግሞም እርካታዬ
መጠጤም አንተነህ የአለቱ ውኃ
ያረሰረስክልኝ የነፍሴን በርሃ

ሙሴ የመታው አለት በቃዴስ በረሃ
እየተከተለ ያጠጣቸው ውኃ
አለቴ ኢየሱስ ቃልህ ውስጤ ፈልቋል
የኔን ልብ የሞላው ምድርን አጥለቅልቋል

አንተን አመልካለሁ በመዝሙር በዜማ
ገፈኸዋልና የነፍሴን ጨለማ

ይናገራል ደምህ ምህረትን ይጮሃል
እስከ ዓለም ፍጻሜ ኃጢአትን ያነጻል
አዳኝ መሆንህን እመሰክራለሁ
ፍጹም ላልለይህ ላንተ ታስሬአለሁ

አንተን አመልካለሁ በመዝሙር በዜማ
ፈተኸዋልና የነፍሴን ጨለማ

ያረጀው መስዋዕት ባንተ ተተክቷል
ኪዳኑ አዲስ ሆኖ በደምህ ተሰርቷል
አንድ ግዜ ከፍለህ እዳዬን በሙሉ
በልቤ ነግሰሃል ኢየሱስ ኃያሉ

አንተን አመልካለሁ በመዝሙር በዜማ
ፈተኸዋልና የነፍሴን ጨለማ

እስራኤል በልተውት የኦሪቱን መና
ዳግም ተርበዋል ጊዜያዊ ነውና
የሕይወት እንጀራዬን አንተን ተመግቤ
ሙላት ሆኖልኛል ተገድሏል ርሃቤ

አንተን አመልካለሁ በመዝሙር በዜማ
ፈተኸዋልና የነፍሴን ጨለማ
'''
                  }),
              Song(
                  name: 'ምትክ የሌለህ ወዳጅ',
                  videoURL: 'https://youtu.be/6NYRai5vRjM?si=ez3AtWwRZ0uTrd4W',
                  songLyrics: {
                    'lyrics': '''
ምትክ የሌለህ ወዳጅ ጌታ የክፉ ቀኔ
ማስታውሰው አንተን ነው በእድሜዬ በዘመኔ
ማቄን ቀደህልኛል አስታጥቀኸኛል ደስታ
የምከፍልህ የለኝም ተባረክ የኔ ጌታ
ተመስገን የኔጌታ

አልጨርሰው ቆጥሬ ውለታህን ዘርዝሬ
ከቃላት በላይ ነው ለኔማ ያረከው
ላሸብሽብ ዝቅ ብዬ በፍቅር ተቃጥዬ
እወድሃለሁ ውዴ አንተ እኮ ነህ ዘመዴ
በማይከፈል ብድር ወደር በሌለው ፍቅር
ከሞት ገላግለኸኛል ነጩን አልብሰኸኛል
ያንተስ የተለዬ ነው ያልሰማን ያላየነው
ምን ብዬ ላመስግን ወለላ ማር እኮ ነህ

ሚረዳኝ የለም ብዬ ስጠራህ በእንባዬ
በሀዘን ተከብቤ አንተን ሲናፍቅ ልቤ
ጨለማው ተገፈፈ መከራዬም አለፈ
እንባዬን አብሰሀል መመለክ ያንስብሃል

ስጠፋ የፈለከኝ ስታገኘኝ ያቀፍከኝ
ቁጣህን ዋጥ አድርገህ በፈገግታ የሳምከኝ
በስር ፈንታ ቀለበት በውርደት ፈንታ ሹመት
ፍሪዳህን ሰውተህ ደስ አለህ ሁሉን ትተህ

ተባረክ የኔ ጌታ ተባረክ
ዙፋንህ ፊት በአምልኮ ልንበርከክ
ተመስገን የኔ ወዳጅ ተመስገን
ቸርነትህ አድርሶኛል ለዚህ ቀን
የማጥለኝ የማትረሳኝ እረዳቴ
ኢየሱስ ነህ ቤዛዬ እና መድኃኒቴ
'''
                  }),
              Song(
                  name: 'አማኑኤል ሆይ',
                  videoURL: 'https://youtu.be/qO7Y4fFYlZs?si=LmxlAK1SyHzMdO8a',
                  songLyrics: {
                    'lyrics': '''
አማኑኤል ሆይ የእጆችህ መዘርጋት
ፍቅርህ ሸፈነው ይህን ሁሉ ፍጥረት
አንተ ሞተህ ነው የቆምነው በሕይወት
ይኸው ልባችን ግባ ኑርበት

ማንነበረ የሚያድነን የሚያወጣን ከጨለማ
በሞት መርገም ስትማቅቅ ሕይወታችን እጅግ ታማ
ፍቅር ስቦህ ከዙፋንህ ለኛ መኖር ስትሰዋ
ታጥቦ ሄደ በደምህ የነፍሳችን መከራዋ(X3)

መላእክትን ባስገረመው ዝምታና ትህትና
ልብህ በፍቅር እያማጠ ወልደኸናል እንደገና
ከአንደበት ቃል ከልብ ሃሳብ ያንተስ አልፏል ከህሊና
ምላሻችን መገዛት ነው ዝቅ ብለን በምስጋና (X3)

ከስም ሁሉ የሚበልጠው ተአምረኛው ህያው ስምህ
ከመቃብር በላይ ሆኖ ድንቅ ያደርጋል እንደቃልህ
ምን ተስፋ አለን ያላንተማ ምን ክብር አለን ኢየሱስ
ሞታችንን አውልቀናል ሕይወትህን ስንለብስ (X3)
ያስለቀሰን ፍቅርህ ነው የሚያስነባን በፊትህ
አንዳች መክፈል ያቃተን ለመስቀሉ ውለታህ
መንፈሳዊው ሕይወታችን እንደቃልህ መች ሆነና
ይቅር በለን አማኑኤል ደግሞ አታግባን ከፈተና(X3)
'''
                  }),
              Song(
                  name: 'አቤቱ በቅድስናህ',
                  videoURL: 'https://youtu.be/UFBtoIpu9vQ?si=l165P-5RtB0hmXM-',
                  songLyrics: {
                    'lyrics': '''
አቤቱ በቅድስናህ ቅዱስ ነህ
ጌታዬ በንጽህናህ ንጹህ ነህ
በስራህ ግሩም ድንቅ ነህና
ላንተ እንሰዋለን አዲስ ምስጋና

ተራሮች ሰንሰለት ሰርተው ስራህን ያስነብባሉ
ወሰኑን ገድበህለት ለጥልቁ ለማዕበሉ
ፏፏቴው ወንዙ ጅረቱ ይጮኃል ፈጥሮለት ዜማ
ጨረቃ ፀሐይ ፈንጥቀው ድል ነሱት ያንን ጨለማ

ደመናን በነፋስ ዙረት ስታሾር በሰማያት
በረዶን እያቀጣጠንክ ስትዘራው በምድር ፊት
ገበሬው እርሻው ተባርኮ ማጀቱ ምስጋና ሞላ
እግዚአብሔር አንተ ብቻ ነህ የነፍስም የስጋም ተድላ

አዕዋፍ በዝማሬአቸው አዲሱን ቀን ያበስራሉ
አዶናይ በቸርነቱ ዘመንን አመጣ እያሉ
ከእሳት ላንቃ በባሱት ጥልቅን ባሰሱት አይኖችህ
ዘላለም አንዳንረሳ አንዴ ታይተናል ልጆችህ

በሰማይ መቅደስህ ያሉ ሌት ተቀን ይዘምራሉ
ምድር አና ሰራዊቶቿ በመዝሙር ይንሳፈፋሉ
ሳትታይ የምትመለክ ሳትጮህ የምትሰማ
በልጅህ ተተርከኻል ይብዛልህ ክብር ምስጋና

ሃሌ ሃሌ ሉያ ሁሉን ለፈጠርከው
ትልቁን ኃይልህን በስልጣን ለያዝከው
ስግደት ላንተ ይሁን አምልኮ ምስጋና
አለሙን በልጅህ ጠቅልለኸልና
'''
                  }),
              Song(
                  name: 'አይኔ ሲያለቅስ',
                  videoURL: 'https://youtu.be/fGsYV8qXzZs?si=KyMeNNzVThv77woC',
                  songLyrics: {
                    'lyrics': '''
አይኔ ሲያለቅስ ልቤ ይዘምራል
ከትናንትናው ፍቅሬ ጨምሯል
ነገም እንደ አዲስ እማርሀለሁ
ማለዳ አዲስ ነህ አመልክሀለሁ (X2)

በልጅነቴ ስተዋወቅህ
ስትሸከመኝ አንገትክን ሳቅፍህ
የአንተ መአዛ የእጆችህ ሽታ
ከውስጤ አልጠፋም ውበትህ ጌታ
    በንጹህ ልቤ በትንሽ አይኔ
    ትኩር ብዬ ስስልህ ያኔ
    እንደምትወደኝ በቃል ነግረኸኝ
    ይቅር ብለኸኝ ጌታ ዛሬ አሳመንከኝ(X2)

በሠላሳ እድሜ ሠላሳ ገጾች
አንተን አነበብኩ ባንተው ዘመኖች
ተነቦ ማያልቅ መጽሐፍ ነህና
ባወኩህ መጠን ያሔው ምስጋና
    የወረድክልኝ ወተህልኛል
    በሰማይ ስፍራ አስቀምጠኸኛል
    ስጠቀልለኝ በሰማይ ቤቴ
    አንተን መንካት ነው ጌታ ጽኑ መሻቴ(X2)

ከእውቀት በላይ የሚበልጠው
አንተን በክብርህ መረዳት ነው
አያጓጓኝም የዓለም ጥበብ
የአንተ ክብር ነው የኔ ጥጋብ
    ሙሴ ለመነ ክብርህን ሊያይ
    ፍቅርህ ወድቆበት ከሰማይ ላይ
    ከሞት ቀስቅሰህ ከመቃብር
    ኢየሱስ አንተን አይቷል ደብረታቦር(X2)
'''
                  }),
              Song(
                  name: 'ወራሹ ወረሰን',
                  videoURL: 'https://youtu.be/2lpt6AwkMf0?si=X0zXhud0gExMpxDq',
                  songLyrics: {
                    'lyrics': '''
ወራሹ ወረሰን የራሱ አረገን
ቢወርስም ይገባዋል የደሙን ዋጋ ከፍሏል።
የካህናት ክህነት የነቢያት ትንቢት
የነገስታት መንግስት ተወርሷል በኢየሱስ

ወራሹ ህጻን ሆኖ ተገልጦ ነበር(X2)
ራሱን ሰውቶ እኛን ለማኖር (X2)
ከህግ በታች ስንኖር ፈትቶናል በአዋጅ (X2)
የባርያን መልክ ይዞ የእግዚአብሔር ልጅ (X2)
    ባሮች አይደለንም ልጆች ነን
    ኢየሱስ በደሙ ያነጻን
    አባ አባት ብለን እንጮሃለን
    በጸጋ ወራሹን እንወርሳለን

ልጄንስ ያፍሩታል ብሎ ቢልከው(X2)
አባት አንድ ልጁን ከእርሻው ቢሰደው (X2)
ነቢያት ባረደው በለመደ እጃቸው (X2)
ልጁንም ገደሉት እጅግ ክፉ ናቸው (X2)
    በአይሁድ ቅናት በገበሬዎቹ
    ተቸንክረው እጆቹና እግሮቹ
    እየሞተ ሁሉን የወረሰ
    ምስጋናችን ለክብሩ ፈሰሰ 

ካህናት የሆኑ እጅግ ብዙ ናቸው(X2)
ፍጹም ስላልሆኑ ሞት የገደባቸው (X2)
የኢየሱስ ክህነቱ የማይለወጥ ነው (X2)
በአባቱ ቀኝ ሆኖ ስለኛ የሚታየው (X2)
    ከሰሎሞን ሚበልጥ ከዮናስ
    ከሙሴ ከአሮን ከኤልያስ
    ከአብርሃም በፊት የነበረ
    ኢየሱስ ጌታ ነው የከበረ

ክርስቶስ ንጉስ ነው የነቢያት ጌታ (X2)
ደግሞ ሊቀ ካህን የቆመ ለይቅርታ (X2)
ሁሉንም የሆነው በስጋ መጣና (X2)
ግድግዳውን ንዶ መጋረጃ ቀድዶ አስገባን በደህና (X2) 
    ከዳዊት ዘር ከይሁዳ ነገድ
    የመጣልን ሞትን ሊያምበረክክ
    ለመንግሥቱ ህልፈት የሌለው
    ክርስቶስ ዘላለም ንጉስ ነው
'''
                  }),
              Song(
                  name: 'ግሩም ነው አግዚአብሔር',
                  videoURL: 'https://youtu.be/TMWy-GnJDYg?si=2O_F5ACLFnOQF-xI',
                  songLyrics: {
                    'lyrics': '''
ግሩም ነው አግዚአብሔር
ድንቅ ነው አግዚአብሔር
ሕይወት የሰጠ ለዓለም
ፀንቶ የሚኖር ዘለአለለም

እንደ አጥቢያ ኮከብ ሚያበራ
ዙፋኑን በእሳት የሰራ
በኪሩቤል ላይ ተቀምጧል
በልብሱ መቅደሱን ሞልቷል
ኦዝያን ሲሞት ታላቁ
ክብሩ ሲደፋ በጥልቁ
ከፍ ብሎ ታዬ በሰማይ
አምላክ ነውና የበላይ

ታላላቆቹን የመታ
መንግስታቸውን የፈታ
የእስራኤል ቅዱስ ታዳጊ
ስሙ እግዚአብሔር ነው ተዋጊ
አንጎደጎደ በድምጹ
ብርሃን ይዘንባል ከገጹ
ጸሐይ ሳይፈጥር ለቀኑ
ያበራ ነበር ዙፋኑ

በአብ ልብ የታሰበው
በወልድ የተነገረው
ተከናውናለች ሕይወት
በመንፈስ ቅዱስ እሳት
በልጅህ በኢየሱስ ስም ነው
አባት ሆይ ከፊትህ የቆምነው
አንዘምራለን ለክብርህ
ስለታመነው ማዳንህ

ሱራፌል ፊቱን ሸፍኖ
ቅዱስ የሚለው በአድንኖ
መላዕክት እና ስልጣናት
የሚሰግዱለት በፍርሃት
አክሊላቸውን አውልቀው
ጽንሐውን በእጣን ሞልተው
በክብር ለነገሰው
አመሰገኑት ወድቀው
'''
                  }),
              Song(
                  name: 'የይሁዳ አንበሳ',
                  videoURL: 'https://youtu.be/rvPteQIT9i4?si=1EuEf2GZT8bsnbO8',
                  songLyrics: {
                    'lyrics': '''
ሞተሃል ብለውኝ ለቀብር ብመጣ
ቀራንዮ አፋፍ ከዚያች ጎልጎታ
መንገዱ ረዝሞብኝ ብደርስ እሁድ ማታ
ለካስ ተነስተሃል አቤት የእኔ ጌታ (X2)

የይሁዳ አንበሳ አንበሳ		
ድል አድርጎ ተነሳ ኢየሱስ ጌታ ነው ጌታ ነው	
	 ምሳሌ የሌለው

ምን ይሰበክ ነበር ምን ይዘመር ነበር
በዮሴፍ መቃብር ተውጠህ ብትቀር
የአገልግሎታችን ሞገስና ግርማ
በትንሣኤህ ኮራን ተሞላን በዜማ 

እኛስ እንሰብካለን የተነሳውን 
ከሙታን በኩር ሆኖ ከብሮ ያረገውን
ሞት ሆይ መውጊያህ የታል የመግደያህ ቀስት
ካቅሙ በላይ ሆኗል የኢየሱስ ጉልበት

ቀና ቀና አድርጎት የደከመውን
እግሩም እጁም ዝሎ የወደቀውን
እንደ ዓለም ጥራጊ ቢገፉን ብንጣል
ተስፋ እንዳትቆርጡ ክብራችን ይመጣል

የአርቡ ግርግር የቅዳሜው ፍርሀት
የአይሁድ ፉከራ የአማኞች ሽሽት
ሁሉም አለፈና እሁድ በማለዳ
እሰይ ደስ ይበለን ኢየሱስ ተነሳ
'''
                  }),
              Song(
                  name: 'አልፋ ነህ',
                  videoURL: 'https://youtu.be/Sj1KJbWpY6Q?si=CzA6IdwKh0LsGXik',
                  songLyrics: {
                    'lyrics': '''
አልፋ ነህ መጀመሪያዬ 
ዖሜጋ ነህ መጨረሻዬ
 የአዲስ ኪዳን መካከለኛ 
ኢየሱስ ነህ የእኔ መዳኛ 
ሜዳ አርገኸው የለም ሸለቆ 
ኮርቷል ልቤ ስምህን ታጥቆ 
የጠጣሁህ የዓለቱ ውሃ 
ማረፊያዬ የዓይኔ ፍሥሃ 
   በመስቀል ላይ የሞትክልኝ 
   እየቆሰልክ የፈወስከኝ 
   ምስኪን ሳለሁ ገና ደካማ 
   ወደኸኛል ምሕረትህ ቀድማ 

አንድ ብሎ አይቆጠርም 
እስከ ብሎ አይገደብም 
ዘመን እድሜህ የማይለካ 
ታርደህልኝ ሆኗል ፋሲካ 
   በድንግዝግዝ እያሰብኩህ 
   በግልጥ ነው ዛሬ ያየሁህ 
   ማዳንህን እሰብከዋለሁ 
   ለዘላለም አመልክሃለሁ

ፍቅርህ ደምቆ ታውጇል በዓለም 
ተፅፎበት በደምህ ቀለም 
ተምረናል ማድረግ ይቅርታ 
ተሸንፈህ ሁሉን ስትረታ 
   ይኸው ቅኔ አዲስ ዝማሬ 
   ንግሥናዬ አንተ ነህ ክብሬ 
   እወድሃለሁ ታውቃለህ ጌታ 
   ስለዳንኩኝ በአንተ ውለታ 

አይታወቅ ያንተ መነሻ 
አይደረስ ያንተ መድረሻ 
የጅማሬ ፈፃሚ ዋልታ 
የፍፃሜ ጀማሪ ጌታ 
   ከዘላለም ድንበር በኋላ 
   የዘመንህ ቁጥር አይሞላ 
   ይቀጥላል መንግሥትህ ጸንቶ 
   በምስጋና በክብር ሞልቶ
'''
                  }),
              Song(
                  name: 'ሁሌ በጌታ',
                  videoURL: 'https://youtu.be/M398mCMX8hY?si=jtEL3Ex57W1tv6bA',
                  songLyrics: {
                    'lyrics': '''
ሁሌ በጌታ ደስ ይበላችሁ
ደግሜ እላለሁ ደስ ይበላችሁ
በአንዳች ነገር አትጨነቁ
ከምስጋና ጋር ጌታን ጠብቁ

የሲኦልን መዝጊያዎች በስልጣኑ ሰባብሯል
ከበረከት ተራራ እርግማንን አባሯል
ነፍሳችን አምልጣለች ከአዳኙ መንጋጋ
ጸሐየ ጽድቅ ኢየሱስ ጨለማውን አነጋ

ነገ መልካም ይሆነናል እንዘምር በአንድነት
ቢያገኙም ቢደኧዩም አይቀርምና መሞት
ሕይወት ግን ይቀጥላል ከመቃብር በኋላ
በክርስቶስ ከተማ በዚያ ነው የእኛ ተድላ

ብቻውን አንደኛ ነው ብቻውን ታላቅ ደስታ
አምላካችን ኢየሱስ የነፍሳችን እፎይታ
በምድራዊ በረከት አይመዘንም ፍቅሩ
ብዙ ሰላም አጭደዋል ከጌታ ጋር የዘሩ

ትናንት እንዳመሰግን ባህሩን ተሻግረን
ከበሮና በገና ጸናጽል አንስተን
ጉዳያችን ባይሞላ ዛሬም እንዘምራለን
ከሁኔታችን በላይ ጌታን እንወዳለን
'''
                  }),
            ]),
      ])
    ];
  }
}
